posts/Emacs-Configuration.org
* config.org
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/config.el :mkdirp t
  :END:
  Set [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical-binding]] for this file.
  #+begin_src emacs-lisp
    ;;; config.el --- Base Emacs configuration file -*- lexical-binding: t -*-
    ;;; Commentary:
    ;; This file is auto-generated from `config.org'
    ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
    ;;; Code:
  #+end_src
* early-init.el
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/early-init.el
  :END:
  #+begin_src emacs-lisp
    ;;; early-init.el --- Customization before normal init -*- lexical-binding: t -*-
    ;;; Commentary:
    ;; This file is auto-generated from `config.org'
    ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
    ;;; Code:
  #+end_src
  This file is loaded before the package system and GUI is initialized.
** Set /+emacs-data-dir/ variables.
   #+begin_src emacs-lisp
     (defvar +emacs-data-dir
       (cond
        ((featurep 'chemacs)
         (if (getenv "XDG_DATA_HOME")
             (concat (getenv "XDG_DATA_HOME") "/emacs/" chemacs-profile-name)
           (concat (getenv "HOME") ".local/share/emacs" chemacs-profile-name)))
        ((if (getenv "XDG_DATA_HOME")
             (expand-file-name "emacs" (getenv "XDG_DATA_HOME"))
           (expand-file-name ".local/share/emacs" (getenv "HOME")))))
       "Location for Emacs data files.")
   #+end_src
   This will set the variable /+emacs-data-dir/ to =~/.local/share/emacs=, or to =~/.local/share/emacs/<chemacs-profile-name= if using /chemacs/.
** Increase the GC threshold for faster startup
   The default is 800 kilobytes, measured in bytes.
   #+begin_src emacs-lisp
     (setq gc-cons-threshold (* 50 1000 1000))
   #+end_src
** Prefer loading newest compiled .el files
   #+begin_src emacs-lisp
     (customize-set-variable 'load-prefer-newer noninteractive)
   #+end_src
** Native compilation settings.
   #+begin_src emacs-lisp
     (when (featurep 'native-compile)
       ;; Silence compiler warnings as they can be pretty disruptive
       (setq native-comp-async-report-warnings-errors nil)

       ;; Make native compilation happens asynchronously
       (setq native-comp-deferred-compilation t)

       ;; Set the right directory to store the native compilation cache
       (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" +emacs-data-dir)))
   #+end_src
** Don't use =package.el=, we'll use =straight.el= instead
   #+begin_src emacs-lisp
     (setq package-enable-at-startup nil)
   #+end_src
** Remove some unneeded UI elements.
   #+begin_src emacs-lisp
     (setq inhibit-startup-message t)
     (push '(tool-bar-lines . 0) default-frame-alist)
     (push '(menu-bar-lines . 0) default-frame-alist)
     (push '(vertical-scroll-bars) default-frame-alist)
     (push '(background-color . "#232635") default-frame-alist)
     (push '(foreground-color . "#FCFCFA") default-frame-alist)
     (push '(mouse-color . "white") default-frame-alist)
   #+end_src
   This also sets the initial /minimal theme/ to avoid having the vanilla theme.
** Make the initial buffer load faster by setting its mode to fundamental-mode.
   #+begin_src emacs-lisp
     (customize-set-variable 'initial-major-mode 'fundamental-mode)
   #+end_src
** Set location for /straight-base-dir/, must be set before straight.el initialized.
   #+begin_src emacs-lisp
     (customize-set-variable 'straight-base-dir +emacs-data-dir)
   #+end_src
** Adds footer since this is the end of the file [[file:early-init.el][early-init.el]]
   #+begin_src emacs-lisp
     (provide 'early-init)
     ;;; early-init.el ends here
   #+end_src
* init.el
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/init.el
  :END:
  #+begin_src emacs-lisp
    ;;; init.el --- Main Emacs configuration file -*- lexical-binding: t -*-
    ;;; Commentary:
    ;; This file is auto-generated from `config.org'
    ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
    ;;; Code:
  #+end_src
  [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][The Emacs initialization file]].
** Add the modules folder to the load path.
   #+begin_src emacs-lisp
     (add-to-list 'load-path (expand-file-name "modules/" user-emacs-directory))
   #+end_src
** User site-lisp directory
   #+begin_src emacs-lisp
     (defvar +site-lisp-dir
       (expand-file-name "site-lisp" user-emacs-directory)
       "Location of user site-lisp directory")
     (add-to-list 'load-path +site-lisp-dir)

     ;; create the directory
     (unless (file-directory-p +site-lisp-dir)
       (make-directory +site-lisp-dir))
   #+end_src
** Set default coding system.
   #+begin_src emacs-lisp
     (set-default-coding-systems 'utf-8)
   #+end_src
