posts/Emacs-Configuration.html
<section id="outline-container-orga838597" class="outline-2">
<h2 id="orga838597">config.org</h2>
<div class="outline-text-2" id="text-orga838597">
<pre class="example">
header-args: :tangle (expand-file-name "config.el" user-emacs-directory) :mkdirp t
</pre>
<p>
Set <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html">lexical-binding</a> for this file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config.el --- Base Emacs configuration file -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
</section>
<section id="outline-container-org31feb22" class="outline-2">
<h2 id="org31feb22">early-init.el</h2>
<div class="outline-text-2" id="text-org31feb22">
<pre class="example">
header-args: :tangle (expand-file-name "early-init.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">early-init.el --- Customization before normal init -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<p>
This file is loaded before the package system and GUI is initialized.
</p>
</div>
<div id="outline-container-org30e999b" class="outline-3">
<h3 id="org30e999b">Set <i>+emacs-data-dir</i> variables.</h3>
<div class="outline-text-3" id="text-org30e999b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+emacs-data-dir</span>
  (<span class="org-keyword">if</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>)
      (expand-file-name <span class="org-string">"emacs"</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>))
    (expand-file-name <span class="org-string">".local/share/emacs"</span> (getenv <span class="org-string">"HOME"</span>)))
  <span class="org-doc">"Location for Emacs data files."</span>)
</pre>
</div>
<p>
This will set the variable <i>+emacs-data-dir</i> to <code>~/.local/share/emacs</code>.
</p>
</div>
</div>
<div id="outline-container-orgb2f1bfa" class="outline-3">
<h3 id="orgb2f1bfa">Increase the GC threshold for faster startup</h3>
<div class="outline-text-3" id="text-orgb2f1bfa">
<p>
The default is 800 kilobytes, measured in bytes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> gc-cons-threshold (* 50 1000 1000))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga6555e0" class="outline-3">
<h3 id="orga6555e0">Prefer loading newest compiled .el files</h3>
<div class="outline-text-3" id="text-orga6555e0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'load-prefer-newer noninteractive)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge5acb28" class="outline-3">
<h3 id="orge5acb28">Native compilation settings.</h3>
<div class="outline-text-3" id="text-orge5acb28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">native-compile</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Silence compiler warnings as they can be pretty disruptive</span>
  (<span class="org-keyword">setq</span> native-comp-async-report-warnings-errors nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Make native compilation happens asynchronously</span>
  (<span class="org-keyword">setq</span> native-comp-deferred-compilation t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Set the right directory to store the native compilation cache</span>
  (add-to-list 'native-comp-eln-load-path (expand-file-name <span class="org-string">"eln-cache/"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7922105" class="outline-3">
<h3 id="org7922105">Don&rsquo;t use <code>package.el</code>, we&rsquo;ll use <code>straight.el</code> instead</h3>
<div class="outline-text-3" id="text-org7922105">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> package-enable-at-startup nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc620cf" class="outline-3">
<h3 id="orgcc620cf">Remove some unneeded UI elements.</h3>
<div class="outline-text-3" id="text-orgcc620cf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> inhibit-startup-message t)
(<span class="org-keyword">push</span> '(tool-bar-lines . 0) default-frame-alist)
(<span class="org-keyword">push</span> '(menu-bar-lines . 0) default-frame-alist)
(<span class="org-keyword">push</span> '(vertical-scroll-bars) default-frame-alist)
(<span class="org-keyword">push</span> '(background-color . <span class="org-string">"#232635"</span>) default-frame-alist)
(<span class="org-keyword">push</span> '(foreground-color . <span class="org-string">"#FCFCFA"</span>) default-frame-alist)
(<span class="org-keyword">push</span> '(mouse-color . <span class="org-string">"white"</span>) default-frame-alist)
</pre>
</div>
<p>
This also sets the initial <i>minimal theme</i> to avoid having the vanilla theme.
</p>
</div>
</div>
<div id="outline-container-org4256fa8" class="outline-3">
<h3 id="org4256fa8">Make the initial buffer load faster by setting its mode to fundamental-mode.</h3>
<div class="outline-text-3" id="text-org4256fa8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'initial-major-mode 'fundamental-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7c9600" class="outline-3">
<h3 id="orgd7c9600">Set location for <i>straight-base-dir</i>, must be set before straight.el initialized.</h3>
<div class="outline-text-3" id="text-orgd7c9600">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'straight-base-dir +emacs-data-dir)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a0f857" class="outline-3">
<h3 id="org3a0f857">Adds footer since this is the end of the file <a href="early-init.el">early-init.el</a></h3>
<div class="outline-text-3" id="text-org3a0f857">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">early-init</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">early-init.el ends here</span>
</pre>
</div>
</div>
</div>
</section>
<section id="outline-container-org6999496" class="outline-2">
<h2 id="org6999496">init.el</h2>
<div class="outline-text-2" id="text-org6999496">
<pre class="example">
header-args: :tangle (expand-file-name "init.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">init.el --- Main Emacs configuration file -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html">The Emacs initialization file</a>.
</p>
</div>
<div id="outline-container-org9f712b2" class="outline-3">
<h3 id="org9f712b2">Add the modules folder to the load path.</h3>
<div class="outline-text-3" id="text-org9f712b2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path (expand-file-name <span class="org-string">"modules/"</span> user-emacs-directory))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd864022" class="outline-3">
<h3 id="orgd864022">User site-lisp directory</h3>
<div class="outline-text-3" id="text-orgd864022">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+site-lisp-dir</span>
  (expand-file-name <span class="org-string">"site-lisp"</span> user-emacs-directory)
  <span class="org-doc">"Location of user site-lisp directory"</span>)
(add-to-list 'load-path +site-lisp-dir)

<span class="org-comment-delimiter">;; </span><span class="org-comment">create the directory</span>
(<span class="org-keyword">unless</span> (file-directory-p +site-lisp-dir)
  (make-directory +site-lisp-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org97b909b" class="outline-3">
<h3 id="org97b909b">Set default coding system.</h3>
<div class="outline-text-3" id="text-org97b909b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default-coding-systems 'utf-8)
</pre>
</div>
</div>
</div>
