posts/Emacs-Configuration.org
** always start server when it's not running
   #+begin_src emacs-lisp
     (if (and (fboundp 'server-running-p)
              (not (server-running-p)))
         (server-start))
   #+end_src
** Increase large file warning size to around 100MB.
   #+begin_src emacs-lisp
     (customize-set-variable 'large-file-warning-threshold 100000000)
   #+end_src
** Bootstrap [[https://github.com/raxod502/straight.el][straight.el]]
   #+begin_src emacs-lisp
     ;; redefine `+emacs-data-dir', it seems in Emacs 27
     ;; variables defined in early-init.el doesn't carry-over here.
     (unless (boundp '+emacs-data-dir)
       (defvar +emacs-data-dir
         (cond
          ((featurep 'chemacs)
           (if (getenv "XDG_DATA_HOME")
               (concat (getenv "XDG_DATA_HOME") "/emacs/" chemacs-profile-name)
             (concat (getenv "HOME") ".local/share/emacs" chemacs-profile-name)))
          ((if (getenv "XDG_DATA_HOME")
               (expand-file-name "emacs" (getenv "XDG_DATA_HOME"))
             (expand-file-name ".local/share/emacs" (getenv "HOME")))))
         "Location for Emacs data files."))
     (unless (file-directory-p +emacs-data-dir)
       (make-directory +emacs-data-dir :parents))
     (defvar bootstrap-version)
     (let ((bootstrap-file
            (expand-file-name "straight/repos/straight.el/bootstrap.el" +emacs-data-dir))
           (bootstrap-version 5))
       (unless (file-exists-p bootstrap-file)
         (with-current-buffer
             (url-retrieve-synchronously
              "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
              'silent 'inhibit-cookies)
           (goto-char (point-max))
           (eval-print-last-sexp)))
       (load bootstrap-file nil 'nomessage))
     ;; run org immediately
     (straight-use-package 'org)
   #+end_src
   This is a modification from [[https://github.com/raxod502/straight.el#getting-started][the original snippets]], so it needs to be evaluated regularly to merge any updates.
** Separate custom-file, and load it if exists.
   #+begin_src emacs-lisp
     (setq-default custom-file (expand-file-name "custom.el" +emacs-data-dir))
     (when (file-exists-p custom-file)
       (load custom-file))
   #+end_src
   This file is usually modified if you made changes using the =customize= function (e.g. ~M-x customize~).
** In order to have emacs use this file as its init file, first we have to convert this file from /org-mode/ into the usual emacs-lisp file.
   #+begin_src emacs-lisp
     (defvar +my-emacs-config-file (expand-file-name "config.org" user-emacs-directory)
       "My Emacs `org-mode' configuration file.")

     (when (file-exists-p +my-emacs-config-file)
       (org-babel-load-file +my-emacs-config-file))
   #+end_src
   This is *important*, this /org-mode/ file needs to also resides in the =user-emacs-directory=, this variable is dynamically set depending on where your =init.el= file. So if you already have that file inside =~/.config/emacs= *before* /Emacs/ started, that's where the =user-emacs-directory= (*only* if it not detect an =~/.emacs.d= directory, so remove that directory first if you want to use =~/.config/emacs=).

   Also, any /codes/ inside this file will automatically evaluated by /Emacs/. So you don't have to manually /require/ it.
** loads =config-defaults=, which doesn't require any foreign packages.
   #+begin_src emacs-lisp :tangle no
     (require 'config-defaults)
   #+end_src
   This is the *core* tweaks. Any /codes/ inside this file ([[file:modules/config-defaults.el][config-defaults.el]]) should not depends on any other files or modules except the ones bundled with /Emacs/.
** per-user configuration file, not maintained by git, so I can have different setup for my desktop and laptop.
   #+begin_src emacs-lisp
     (when (file-exists-p (expand-file-name "config-user.el" user-emacs-directory))
       (load (expand-file-name "config-user.el" user-emacs-directory)))
   #+end_src
   If there's any /modules/ or other files needed, this is where to place it.
** Load custom variables
   #+begin_src emacs-lisp
     (require 'config-defaults-variables)
   #+end_src
** Adds footer since this is the end of the file [[file:init.el][init.el]]
   #+begin_src emacs-lisp
     (provide 'init)
     ;;; init.el ends here
   #+end_src
* Variables
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/modules/config-defaults-variables.el :mkdirp t
  :END:
  #+begin_src emacs-lisp
    ;;; config-defaults-variables.el --- Summary -*- lexical-binding: t -*-
    ;;; Commentary:
    ;; This file is auto-generated from `config.org'
    ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
    ;;; Code:
  #+end_src
  This tangles into =~/.config/emacs/modules/config-defaults-variables.el=
** Determine running OS
   #+begin_src emacs-lisp
     (shell-command ". ~/.bashrc" nil nil)
   #+end_src
   This is needed for /EXWM/ inside /guixSD/.
*** guix
    #+begin_src emacs-lisp
      (setq +config/is-guix-system (and (eq system-type 'gnu/linux)
                                        (string= (getenv "GUIX_LOCPATH") "/run/current-system/locale")))
    #+end_src
** DE/WM
*** exwm
    #+begin_src emacs-lisp
      (setq +config/exwm-enabled (and (eq window-system 'x)
                                      (featurep 'exwm)))
    #+end_src
