posts/Emacs-Configuration.html
<div id="outline-container-org12af76c" class="outline-3">
<h3 id="org12af76c">always start server when it&rsquo;s not running</h3>
<div class="outline-text-3" id="text-org12af76c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">if</span> (<span class="org-keyword">and</span> (fboundp 'server-running-p)
         (not (server-running-p)))
    (server-start))
</pre>
</div>
</div>
</div>
<div id="outline-container-org982c574" class="outline-3">
<h3 id="org982c574">Increase large file warning size to around 100MB.</h3>
<div class="outline-text-3" id="text-org982c574">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'large-file-warning-threshold 100000000)
</pre>
</div>
</div>
</div>
<div id="outline-container-org686cb91" class="outline-3">
<h3 id="org686cb91">Bootstrap <a href="https://github.com/raxod502/straight.el">straight.el</a></h3>
<div class="outline-text-3" id="text-org686cb91">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">redefine `</span><span class="org-comment"><span class="org-constant">+emacs-data-dir</span></span><span class="org-comment">', it seems in Emacs 27</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">variables defined in early-init.el doesn't carry-over here.</span>
(<span class="org-keyword">unless</span> (boundp '+emacs-data-dir)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">+emacs-data-dir</span>
    (<span class="org-keyword">if</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>)
        (expand-file-name <span class="org-string">"emacs"</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>))
      (expand-file-name <span class="org-string">".local/share/emacs"</span> (getenv <span class="org-string">"HOME"</span>)))
    <span class="org-doc">"Location for Emacs data files."</span>))
(<span class="org-keyword">unless</span> (file-directory-p +emacs-data-dir)
  (make-directory +emacs-data-dir <span class="org-builtin">:parents</span>))
(<span class="org-keyword">defvar</span> <span class="org-variable-name">bootstrap-version</span>)
(<span class="org-keyword">let</span> ((bootstrap-file
       (expand-file-name <span class="org-string">"straight/repos/straight.el/bootstrap.el"</span> +emacs-data-dir))
      (bootstrap-version 5))
  (<span class="org-keyword">unless</span> (file-exists-p bootstrap-file)
    (<span class="org-keyword">with-current-buffer</span>
        (url-retrieve-synchronously
         <span class="org-string">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
<span class="org-comment-delimiter">;; </span><span class="org-comment">run org immediately</span>
(straight-use-package 'org)
</pre>
</div>
<p>
This is a modification from <a href="https://github.com/raxod502/straight.el#getting-started">the original snippets</a>, so it needs to be evaluated regularly to merge any updates.
</p>
</div>
</div>
<div id="outline-container-org7879743" class="outline-3">
<h3 id="org7879743">Separate custom-file, and load it if exists.</h3>
<div class="outline-text-3" id="text-org7879743">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq-default</span> custom-file (expand-file-name <span class="org-string">"custom.el"</span> +emacs-data-dir))
(<span class="org-keyword">when</span> (file-exists-p custom-file)
  (load custom-file))
</pre>
</div>
<p>
This file is usually modified if you made changes using the <code>customize</code> function (e.g. <code>M-x customize</code>).
</p>
</div>
</div>
<div id="outline-container-org3e02850" class="outline-3">
<h3 id="org3e02850">In order to have emacs use this file as its init file, first we have to convert this file from <i>org-mode</i> into the usual emacs-lisp file.</h3>
<div class="outline-text-3" id="text-org3e02850">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+my-emacs-config-file</span> (expand-file-name <span class="org-string">"config.org"</span> user-emacs-directory)
  <span class="org-doc">"My Emacs `</span><span class="org-doc"><span class="org-constant">org-mode</span></span><span class="org-doc">' configuration file."</span>)

(<span class="org-keyword">when</span> (file-exists-p +my-emacs-config-file)
  (org-babel-load-file +my-emacs-config-file))
</pre>
</div>
<p>
This is <b>important</b>, this <i>org-mode</i> file needs to also resides in the <code>user-emacs-directory</code>, this variable is dynamically set depending on where your <code>init.el</code> file. So if you already have that file inside <code>~/.config/emacs</code> <b>before</b> <i>Emacs</i> started, that&rsquo;s where the <code>user-emacs-directory</code> (<b>only</b> if it not detect an <code>~/.emacs.d</code> directory, so remove that directory first if you want to use <code>~/.config/emacs</code>).
</p>

<p>
Also, any <i>codes</i> inside this file will automatically evaluated by <i>Emacs</i>. So you don&rsquo;t have to manually <i>require</i> it.
</p>
</div>
</div>
<div id="outline-container-orgafb1fbe" class="outline-3">
<h3 id="orgafb1fbe">loads <code>config-defaults</code>, which doesn&rsquo;t require any foreign packages.</h3>
<div class="outline-text-3" id="text-orgafb1fbe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults</span>)
</pre>
</div>
<p>
This is the <b>core</b> tweaks. Any <i>codes</i> inside this file (<a href="modules/config-defaults.el">config-defaults.el</a>) should not depends on any other files or modules except the ones bundled with <i>Emacs</i>.
</p>
</div>
</div>
<div id="outline-container-org896b2b8" class="outline-3">
<h3 id="org896b2b8">per-user configuration file, not maintained by git, so I can have different setup for my desktop and laptop.</h3>
<div class="outline-text-3" id="text-org896b2b8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (file-exists-p (expand-file-name <span class="org-string">"config-user.el"</span> user-emacs-directory))
  (customize-set-variable 'vc-follow-symlinks t)
  (load (expand-file-name <span class="org-string">"config-user.el"</span> user-emacs-directory)))
</pre>
</div>
<p>
If there&rsquo;s any <i>modules</i> or other files needed, this is where to place it.
</p>
</div>
</div>
<div id="outline-container-org2364321" class="outline-3">
<h3 id="org2364321">Load custom variables</h3>
<div class="outline-text-3" id="text-org2364321">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb728657" class="outline-3">
<h3 id="orgb728657">Adds footer since this is the end of the file <a href="init.el">init.el</a></h3>
<div class="outline-text-3" id="text-orgb728657">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">init</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">init.el ends here</span>
</pre>
</div>
</div>
</div>
</section>
<section id="outline-container-org8964a47" class="outline-2">
<h2 id="org8964a47">Variables</h2>
<div class="outline-text-2" id="text-org8964a47">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-variables.el" user-emacs-directory) :mkdirp t
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-variables.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<p>
This tangles into <code>~/.config/emacs/modules/config-defaults-variables.el</code>
</p>
</div>
<div id="outline-container-org92c516e" class="outline-3">
<h3 id="org92c516e">Determine running OS</h3>
<div class="outline-text-3" id="text-org92c516e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(shell-command <span class="org-string">". ~/.bashrc"</span> nil nil)
</pre>
</div>
<p>
This is needed for <i>EXWM</i> inside <i>guixSD</i>.
</p>
</div>
<div id="outline-container-org5db2c27" class="outline-4">
<h4 id="org5db2c27">guix</h4>
<div class="outline-text-4" id="text-org5db2c27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> +config/is-guix-system (<span class="org-keyword">and</span> (eq system-type 'gnu/linux)
                                  (string= (getenv <span class="org-string">"GUIX_LOCPATH"</span>) <span class="org-string">"/run/current-system/locale"</span>)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org24f17d3" class="outline-3">
<h3 id="org24f17d3">DE/WM</h3>
<div class="outline-text-3" id="text-org24f17d3">
</div>
<div id="outline-container-org0719b9e" class="outline-4">
<h4 id="org0719b9e">exwm</h4>
<div class="outline-text-4" id="text-org0719b9e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> +config/exwm-enabled
      (<span class="org-keyword">or</span> (string= (getenv <span class="org-string">"DESKTOP_SESSION"</span>) <span class="org-string">"exwm"</span>)
          (<span class="org-keyword">featurep</span> '<span class="org-constant">exwm</span>)))
</pre>
</div>
</div>
</div>
</div>
