posts/Emacs-Configuration.org
** XDG Directories
   #+begin_src emacs-lisp
     ;; set XDG_PICTURES_DIR
     (unless (getenv "XDG_PICTURES_DIR")
       (setenv "XDG_PICTURES_DIR" (expand-file-name "Pictures" (getenv "HOME"))))
     ;; set XDG_MUSIC_DIR
     (unless (getenv "XDG_MUSIC_DIR")
       (setenv "XDG_MUSIC_DIR" (expand-file-name "Music" (getenv "HOME"))))
     ;; set XDG_DOWNLOAD_DIR
     (unless (getenv "XDG_DOWNLOAD_DIR")
       (setenv "XDG_DOWLNOAD_DIR" (expand-file-name "Downloads" (getenv "HOME"))))
   #+end_src
** emms music directory
   #+begin_src emacs-lisp
     (defvar +emms-music-dir (getenv "XDG_MUSIC_DIR")
       "Location for `emms' music directory.")
   #+end_src
** backups and autosave files
   The first thing to do is set the directories for backups and autosave, most people turn off these settings, but I sometimes need them, not inside the =user-emacs-directory= though, because I'd like to have few lines in my =.gitignore=.
   #+begin_src emacs-lisp
     (defvar +emacs-backup-directory
       (cond
        ((featurep 'chemacs)
         (expand-file-name "backups" +emacs-data-dir))
        ((if (getenv "XDG_DATA_HOME")
             (expand-file-name "emacs/backups" (getenv "XDG_DATA_HOME"))
           (expand-file-name ".local/share/emacs/backups" (getenv "HOME")))))
       "Location of Emacs backup files.")
     (unless backup-directory-alist
       (setq backup-directory-alist `(("." . ,+emacs-backup-directory))))
     (unless (file-directory-p +emacs-backup-directory)
       (make-directory +emacs-backup-directory :parents))
     (setq backup-by-copying t)
     (setq auto-save-list-file-prefix (expand-file-name "auto-saves/sessions/" +emacs-backup-directory))
     (setq auto-save-file-name-transform
           `((".*" ,(expand-file-name "auto-saves/" +emacs-backup-directory) t)))
   #+end_src
** other builtin data file
   #+begin_src emacs-lisp
     (setq filesets-menu-cache-file (expand-file-name "filesets-menu-cache.el" +emacs-data-dir))
     (setq gamegrid-user-score-file-directory (expand-file-name "gamegrid-user-score/" +emacs-data-dir))
     (setq kkc-init-file-name (expand-file-name "kkc-init.el" +emacs-data-dir))
     (setq multisession-directory (expand-file-name "multisession/" +emacs-data-dir))
     (setq project-list-file (expand-file-name "project-list.el" +emacs-data-dir))
     (setq quickurl-url-file (expand-file-name "quickurl-url.el" +emacs-data-dir))
     (setq rcirc-log-directory (expand-file-name "rcirc-log/" +emacs-data-dir))
     (setq srecode-map-save-file (expand-file-name "srecode-map.el" +emacs-data-dir))
     (setq semanticdb-default-save-directory (expand-file-name "semantic/" +emacs-data-dir))
     (setq shared-game-score-directory (expand-file-name "shared-game-score/" +emacs-data-dir))
     (setq timeclock-file (expand-file-name "timeclock" +emacs-data-dir))
     (setq type-break-file-name (expand-file-name "type-break.el" +emacs-data-dir))
   #+end_src
** footer
   #+begin_src emacs-lisp
     (provide 'config-defaults-variables)
     ;;; config-defaults-variables.el ends here
   #+end_src
* modules
  With this modular design, I can include per files configuration only.
** defaults
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults.el
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
   #+end_src
*** Other defaults modules
    #+begin_src emacs-lisp
      (require 'config-defaults-org)
      (require 'config-defaults-ui)
      (require 'config-defaults-editings)
      (require 'config-defaults-completion)
      (require 'config-defaults-various)
      (require 'config-defaults-ide)
      (require 'config-defaults-email)
      (require 'config-defaults-shell)
      (require 'config-defaults-tools)
      (require 'config-defaults-keybindings)
    #+end_src
*** end of config-defaults.el
    #+begin_src emacs-lisp
      (provide 'config-defaults)
      ;;; config-defaults.el ends here
    #+end_src
** Default UI
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-ui.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-ui.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
   #+end_src
