posts/Emacs-Configuration.html
<div id="outline-container-orgfdfc217" class="outline-3">
<h3 id="orgfdfc217">XDG Directories</h3>
<div class="outline-text-3" id="text-orgfdfc217">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">set XDG_PICTURES_DIR</span>
(<span class="org-keyword">unless</span> (getenv <span class="org-string">"XDG_PICTURES_DIR"</span>)
  (setenv <span class="org-string">"XDG_PICTURES_DIR"</span> (expand-file-name <span class="org-string">"Pictures"</span> (getenv <span class="org-string">"HOME"</span>))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">set XDG_MUSIC_DIR</span>
(<span class="org-keyword">unless</span> (getenv <span class="org-string">"XDG_MUSIC_DIR"</span>)
  (setenv <span class="org-string">"XDG_MUSIC_DIR"</span> (expand-file-name <span class="org-string">"Music"</span> (getenv <span class="org-string">"HOME"</span>))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">set XDG_DOWNLOAD_DIR</span>
(<span class="org-keyword">unless</span> (getenv <span class="org-string">"XDG_DOWNLOAD_DIR"</span>)
  (setenv <span class="org-string">"XDG_DOWLNOAD_DIR"</span> (expand-file-name <span class="org-string">"Downloads"</span> (getenv <span class="org-string">"HOME"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1843550" class="outline-3">
<h3 id="org1843550">emms music directory</h3>
<div class="outline-text-3" id="text-org1843550">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+emms-music-dir</span> (getenv <span class="org-string">"XDG_MUSIC_DIR"</span>)
  <span class="org-doc">"Location for `</span><span class="org-doc"><span class="org-constant">emms</span></span><span class="org-doc">' music directory."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orged2b052" class="outline-3">
<h3 id="orged2b052">backups and autosave files</h3>
<div class="outline-text-3" id="text-orged2b052">
<p>
The first thing to do is set the directories for backups and autosave, most people turn off these settings, but I sometimes need them, not inside the <code>user-emacs-directory</code> though, because I&rsquo;d like to have few lines in my <code>.gitignore</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+emacs-backup-directory</span>
  (<span class="org-keyword">if</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>)
      (expand-file-name <span class="org-string">"emacs/backups"</span> (getenv <span class="org-string">"XDG_DATA_HOME"</span>))
    (expand-file-name <span class="org-string">".local/share/emacs/backups"</span> (getenv <span class="org-string">"HOME"</span>)))
  <span class="org-doc">"Location of Emacs backup files."</span>)
(<span class="org-keyword">unless</span> backup-directory-alist
  (<span class="org-keyword">setq</span> backup-directory-alist `((<span class="org-string">"."</span> . ,+emacs-backup-directory))))
(<span class="org-keyword">unless</span> (file-directory-p +emacs-backup-directory)
  (make-directory +emacs-backup-directory <span class="org-builtin">:parents</span>))
(<span class="org-keyword">setq</span> backup-by-copying t)
(<span class="org-keyword">setq</span> auto-save-list-file-prefix (expand-file-name <span class="org-string">"auto-saves/sessions/"</span> +emacs-backup-directory))
(<span class="org-keyword">setq</span> auto-save-file-name-transform
      `((<span class="org-string">".*"</span> ,(expand-file-name <span class="org-string">"auto-saves/"</span> +emacs-backup-directory) t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org801884c" class="outline-3">
<h3 id="org801884c">other builtin data file</h3>
<div class="outline-text-3" id="text-org801884c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> filesets-menu-cache-file (expand-file-name <span class="org-string">"filesets-menu-cache.el"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> gamegrid-user-score-file-directory (expand-file-name <span class="org-string">"gamegrid-user-score/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> kkc-init-file-name (expand-file-name <span class="org-string">"kkc-init.el"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> multisession-directory (expand-file-name <span class="org-string">"multisession/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> project-list-file (expand-file-name <span class="org-string">"project-list.el"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> quickurl-url-file (expand-file-name <span class="org-string">"quickurl-url.el"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> rcirc-log-directory (expand-file-name <span class="org-string">"rcirc-log/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> srecode-map-save-file (expand-file-name <span class="org-string">"srecode-map.el"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> semanticdb-default-save-directory (expand-file-name <span class="org-string">"semantic/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> shared-game-score-directory (expand-file-name <span class="org-string">"shared-game-score/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> timeclock-file (expand-file-name <span class="org-string">"timeclock"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> type-break-file-name (expand-file-name <span class="org-string">"type-break.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org49c1c71" class="outline-3">
<h3 id="org49c1c71">footer</h3>
<div class="outline-text-3" id="text-org49c1c71">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-variables</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-variables.el ends here</span>
</pre>
</div>
</div>
</div>
</section>
<section id="outline-container-org8cc6b6f" class="outline-2">
<h2 id="org8cc6b6f">modules</h2>
<div class="outline-text-2" id="text-org8cc6b6f">
<p>
With this modular design, I can include per files configuration only.
</p>
</div>
<div id="outline-container-org7eabe64" class="outline-3">
<h3 id="org7eabe64">defaults</h3>
<div class="outline-text-3" id="text-org7eabe64">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
<div id="outline-container-org50705bf" class="outline-4">
<h4 id="org50705bf">Other defaults modules</h4>
<div class="outline-text-4" id="text-org50705bf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-org</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-ui</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-editings</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-completion</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-various</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-ide</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-email</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-shell</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-tools</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-keybindings</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org074e3e9" class="outline-4">
<h4 id="org074e3e9">end of config-defaults.el</h4>
<div class="outline-text-4" id="text-org074e3e9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
