posts/Emacs-Configuration.org
*** Default fonts
    Got this from [[https://emacsredux.com/blog/2021/12/22/check-if-a-font-is-available-with-emacs-lisp/][emacsredux]]:
    #+begin_src emacs-lisp
      (cond
       ((find-font (font-spec :name "Source Code Pro"))
        (set-frame-font "Source Code Pro-10"))
       ((find-font (font-spec :name "Fira Code"))
        (set-frame-font "Fire Code-10"))
       ((find-font (font-spec :name "DejaVu Sans Mono"))
        (set-frame-font "DejaVu Sans Mono-10"))
       ((find-font (font-spec :name "Ubuntu Mono"))
        (set-frame-font "Ubuntu Mono-12")))
    #+end_src
*** Load theme
    #+begin_src emacs-lisp
      (unless custom-enabled-themes
        (load-theme 'manoj-dark t))
    #+end_src
*** Revert Dired and other buffers
    #+begin_src emacs-lisp
      (customize-set-variable 'global-auto-revert-non-file-buffers t)
    #+end_src
*** Revert buffers when the underlying file has changed
    #+begin_src emacs-lisp
      (global-auto-revert-mode 1)
    #+end_src
*** Make scrolling less stuttered
    #+begin_src emacs-lisp
      (setq auto-window-vscroll nil)
      (customize-set-variable 'fast-but-imprecise-scrolling t)
      (customize-set-variable 'scroll-conservatively 101)
      (customize-set-variable 'scroll-margin 0)
      (customize-set-variable 'scroll-preserve-screen-position t)
    #+end_src
*** enable visual-line-mode
    #+begin_src emacs-lisp
      (visual-line-mode 1)
    #+end_src
*** move point to help window
    #+begin_src emacs-lisp
      (setq help-window-select t)
    #+end_src
*** always maximize frame
    #+begin_src emacs-lisp
      (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
      (add-to-list 'default-frame-alist '(fullscreen . maximized))
    #+end_src
*** don't truncate lines
    #+begin_src emacs-lisp
      (setq truncate-lines 'nil)
    #+end_src
*** Lines should be 80 characters wide
    #+begin_src emacs-lisp
      (setq fill-column 80)
    #+end_src
*** Show empty lines after buffer end
    #+begin_src emacs-lisp
      (set-default 'indicate-empty-lines t)
    #+end_src
*** don't confirm when following symlink files
    #+begin_src emacs-lisp
      (setq vc-follow-symlinks t)
    #+end_src
*** Enable recursive minibuffers
    #+begin_src emacs-lisp
      (setq enable-recursive-minibuffers t)
    #+end_src
*** uniquify
    #+begin_src emacs-lisp
      (require 'uniquify)
      (setq uniquify-buffer-name-style 'forward)
    #+end_src
*** Offer to create parent directories if they do not exists, from [[http://iqbalansari.github.io/blog/2014/12/07/automatically-create-parent-directories-on-visiting-a-new-file-in-emacs/][iqbalansari.github.io]]
    #+begin_src emacs-lisp
      (defun +my-create-non-existent-directory ()
        (let ((parent-directory (file-name-directory buffer-file-name)))
          (when (and (not (file-exists-p parent-directory))
                     (y-or-n-p (format "Directory `%s' does not exist! Create it?" parent-directory)))
            (make-directory parent-directory t))))

      (add-to-list 'find-file-not-found-functions '+my-create-non-existent-directory)
    #+end_src
*** line numbering for some modes
    #+begin_src emacs-lisp
      (column-number-mode)

      ;; Enable line numbers for some modes
      (dolist (mode '(text-mode-hook
                      prog-mode-hook
                      conf-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 1))))

      ;; Override some modes which derive from the above
      (dolist (mode '(org-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 0))))
    #+end_src
*** add visual pulse when changing focus, like beacon but built-in, from [[https://karthinks.com/software/batteries-included-with-emacs/][karthinks.com]].
    #+begin_src emacs-lisp
      (defun +pulse-line (&rest _)
        "Pulse the current line."
        (pulse-momentary-highlight-one-line (point)))

      (dolist (command '(scroll-up-command scroll-down-command
                                           recenter-top-bottom other-window))
        (advice-add command :after #'+pulse-line))
    #+end_src
*** eldoc
    #+begin_src emacs-lisp
      (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
      (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
      (add-hook 'ielm-mode-hook 'eldoc-mode)
      (add-hook 'prog-mode-hook 'eldoc-mode)
    #+end_src
*** enable line numbering for some mode automatically.
    #+begin_src emacs-lisp
      (column-number-mode)

      ;; Enable line numbers for some modes
      (dolist (mode '(text-mode-hook
                      prog-mode-hook
                      conf-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 1))))

      ;; Override some modes which derive from the above
      (dolist (mode '(org-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 0))))
    #+end_src
*** Additional Packages
