posts/Emacs-Configuration.html
<div id="outline-container-org6d8f0b8" class="outline-3">
<h3 id="org6d8f0b8">Default UI</h3>
<div class="outline-text-3" id="text-org6d8f0b8">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-ui.el" user-emacs-directory) :mkdirp t
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-ui.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
<div id="outline-container-orgd453d06" class="outline-4">
<h4 id="orgd453d06">Default fonts</h4>
<div class="outline-text-4" id="text-orgd453d06">
<p>
Got this from <a href="https://emacsredux.com/blog/2021/12/22/check-if-a-font-is-available-with-emacs-lisp/">emacsredux</a>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">cond</span>
 ((find-font (font-spec <span class="org-builtin">:name</span> <span class="org-string">"Source Code Pro"</span>))
  (set-frame-font <span class="org-string">"Source Code Pro-10"</span>))
 ((find-font (font-spec <span class="org-builtin">:name</span> <span class="org-string">"Fira Code"</span>))
  (set-frame-font <span class="org-string">"Fire Code-10"</span>))
 ((find-font (font-spec <span class="org-builtin">:name</span> <span class="org-string">"DejaVu Sans Mono"</span>))
  (set-frame-font <span class="org-string">"DejaVu Sans Mono-10"</span>))
 ((find-font (font-spec <span class="org-builtin">:name</span> <span class="org-string">"Ubuntu Mono"</span>))
  (set-frame-font <span class="org-string">"Ubuntu Mono-12"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeedb54b" class="outline-4">
<h4 id="orgeedb54b">Load theme</h4>
<div class="outline-text-4" id="text-orgeedb54b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> custom-enabled-themes
  (load-theme 'manoj-dark t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9757b3e" class="outline-4">
<h4 id="org9757b3e">Revert Dired and other buffers</h4>
<div class="outline-text-4" id="text-org9757b3e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'global-auto-revert-non-file-buffers t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org782754f" class="outline-4">
<h4 id="org782754f">Revert buffers when the underlying file has changed</h4>
<div class="outline-text-4" id="text-org782754f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-auto-revert-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga2cfe55" class="outline-4">
<h4 id="orga2cfe55">Make scrolling less stuttered</h4>
<div class="outline-text-4" id="text-orga2cfe55">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> auto-window-vscroll nil)
(customize-set-variable 'fast-but-imprecise-scrolling t)
(customize-set-variable 'scroll-conservatively 101)
(customize-set-variable 'scroll-margin 0)
(customize-set-variable 'scroll-preserve-screen-position t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org696fa0d" class="outline-4">
<h4 id="org696fa0d">enable visual-line-mode</h4>
<div class="outline-text-4" id="text-org696fa0d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(visual-line-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org05ea95a" class="outline-4">
<h4 id="org05ea95a">move point to help window</h4>
<div class="outline-text-4" id="text-org05ea95a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> help-window-select t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1a67914" class="outline-4">
<h4 id="org1a67914">always maximize frame</h4>
<div class="outline-text-4" id="text-org1a67914">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
</pre>
</div>
</div>
</div>
<div id="outline-container-org277b308" class="outline-4">
<h4 id="org277b308">don&rsquo;t truncate lines</h4>
<div class="outline-text-4" id="text-org277b308">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> truncate-lines 'nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org16ac20e" class="outline-4">
<h4 id="org16ac20e">Lines should be 80 characters wide</h4>
<div class="outline-text-4" id="text-org16ac20e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> fill-column 80)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe886c7" class="outline-4">
<h4 id="orgfe886c7">Show empty lines after buffer end</h4>
<div class="outline-text-4" id="text-orgfe886c7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default 'indicate-empty-lines t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecf35be" class="outline-4">
<h4 id="orgecf35be">don&rsquo;t confirm when following symlink files</h4>
<div class="outline-text-4" id="text-orgecf35be">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> vc-follow-symlinks t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga0a3b6f" class="outline-4">
<h4 id="orga0a3b6f">Enable recursive minibuffers</h4>
<div class="outline-text-4" id="text-orga0a3b6f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> enable-recursive-minibuffers t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org11a08bd" class="outline-4">
<h4 id="org11a08bd">uniquify</h4>
<div class="outline-text-4" id="text-org11a08bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">uniquify</span>)
(<span class="org-keyword">setq</span> uniquify-buffer-name-style 'forward)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga38e95d" class="outline-4">
<h4 id="orga38e95d">Offer to create parent directories if they do not exists, from <a href="http://iqbalansari.github.io/blog/2014/12/07/automatically-create-parent-directories-on-visiting-a-new-file-in-emacs/">iqbalansari.github.io</a></h4>
<div class="outline-text-4" id="text-orga38e95d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">+my-create-non-existent-directory</span> ()
  (<span class="org-keyword">let</span> ((parent-directory (file-name-directory buffer-file-name)))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (not (file-exists-p parent-directory))
               (y-or-n-p (format <span class="org-string">"Directory `</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">' does not exist! Create it?"</span> parent-directory)))
      (make-directory parent-directory t))))

(add-to-list 'find-file-not-found-functions '+my-create-non-existent-directory)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e05395" class="outline-4">
<h4 id="org3e05395">line numbering for some modes</h4>
<div class="outline-text-4" id="text-org3e05395">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(column-number-mode)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Enable line numbers for some modes</span>
(<span class="org-keyword">dolist</span> (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (<span class="org-keyword">lambda</span> () (display-line-numbers-mode 1))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Override some modes which derive from the above</span>
(<span class="org-keyword">dolist</span> (mode '(org-mode-hook))
  (add-hook mode (<span class="org-keyword">lambda</span> () (display-line-numbers-mode 0))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org53912cb" class="outline-4">
<h4 id="org53912cb">add visual pulse when changing focus, like beacon but built-in, from <a href="https://karthinks.com/software/batteries-included-with-emacs/">karthinks.com</a>.</h4>
<div class="outline-text-4" id="text-org53912cb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">+pulse-line</span> (<span class="org-type">&amp;rest</span> _)
  <span class="org-doc">"Pulse the current line."</span>
  (pulse-momentary-highlight-one-line (point)))

(<span class="org-keyword">dolist</span> (command '(scroll-up-command scroll-down-command
                                     recenter-top-bottom other-window))
  (advice-add command <span class="org-builtin">:after</span> #'+pulse-line))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8efe21c" class="outline-4">
<h4 id="org8efe21c">eldoc</h4>
<div class="outline-text-4" id="text-org8efe21c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
(add-hook 'ielm-mode-hook 'eldoc-mode)
(add-hook 'prog-mode-hook 'eldoc-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb200d2a" class="outline-4">
<h4 id="orgb200d2a">enable line numbering for some mode automatically.</h4>
<div class="outline-text-4" id="text-orgb200d2a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(column-number-mode)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Enable line numbers for some modes</span>
(<span class="org-keyword">dolist</span> (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (<span class="org-keyword">lambda</span> () (display-line-numbers-mode 1))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Override some modes which derive from the above</span>
(<span class="org-keyword">dolist</span> (mode '(org-mode-hook))
  (add-hook mode (<span class="org-keyword">lambda</span> () (display-line-numbers-mode 0))))
</pre>
</div>
</div>
</div>
