posts/Emacs-Configuration.org
**** all-the-icons
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-all-the-icons.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-all-the-icons.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (when (display-graphic-p)
           (straight-use-package 'all-the-icons)))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-all-the-icons)
        ;;; config-all-the-icons.el ends here
      #+end_src
**** doom-modeline
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-doom-modelines.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-doom-modelines.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'doom-modeline))
       (customize-set-variable 'doom-modeline-height 15)
       (customize-set-variable 'doom-modeline-bar-width 6)
       (customize-set-variable 'doom-modeline-minor-modes t)
       (customize-set-variable 'doom-modeline-buffer-file-name-style 'truncate-except-project)
       (add-hook 'after-init-hook 'doom-modeline-init)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-doom-modelines)
        ;;; config-doom-modelines.el ends here
      #+end_src
**** doom-themes
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-doom-themes.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-doom-themes.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'doom-themes))
       (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
             doom-themes-enable-italic t) ; if nil, italics is universally disabled
       ;; Enable flashing mode-line on errors
       (doom-themes-visual-bell-config)
       ;; Enable custom neotree theme (all-the-icons must be installed!)
       (doom-themes-neotree-config)
       ;; or for treemacs users
       (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
       (doom-themes-treemacs-config)
       ;; Corrects (and improves) org-mode's native fontification.
       (doom-themes-org-config)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-doom-themes)
        ;;; config-doom-themes.el ends here
      #+end_src
**** theme-magic
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-theme-magic.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-theme-magic.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'theme-magic))
       (when (executable-find "wal")
         (theme-magic-export-theme-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-theme-magic)
        ;;; config-theme-magic.el ends here
      #+end_src
