posts/Emacs-Configuration.html
<div id="outline-container-org9c20b0b" class="outline-4">
<h4 id="org9c20b0b">Additional Packages</h4>
<div class="outline-text-4" id="text-org9c20b0b">
</div>
<ul class="org-ul">
<li><a id="org3444582"></a>all-the-icons<br>
<div class="outline-text-5" id="text-org3444582">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-all-the-icons.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-all-the-icons.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (<span class="org-keyword">when</span> (display-graphic-p)
    (straight-use-package 'all-the-icons)))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org426465f"></a>Footer<br>
<div class="outline-text-6" id="text-org426465f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-all-the-icons</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-all-the-icons.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org0052ada"></a>doom-modeline<br>
<div class="outline-text-5" id="text-org0052ada">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-doom-modelines.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-doom-modelines.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'doom-modeline))
(customize-set-variable 'doom-modeline-height 15)
(customize-set-variable 'doom-modeline-bar-width 6)
(customize-set-variable 'doom-modeline-minor-modes t)
(customize-set-variable 'doom-modeline-buffer-file-name-style 'truncate-except-project)
(add-hook 'after-init-hook 'doom-modeline-init)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org9e4f6eb"></a>Footer<br>
<div class="outline-text-6" id="text-org9e4f6eb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-doom-modelines</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-doom-modelines.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org1a76bc6"></a>doom-themes<br>
<div class="outline-text-5" id="text-org1a76bc6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-doom-themes.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-doom-themes.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'doom-themes))
(<span class="org-keyword">setq</span> doom-themes-enable-bold t    <span class="org-comment-delimiter">; </span><span class="org-comment">if nil, bold is universally disabled</span>
      doom-themes-enable-italic t) <span class="org-comment-delimiter">; </span><span class="org-comment">if nil, italics is universally disabled</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Enable flashing mode-line on errors</span>
(doom-themes-visual-bell-config)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Enable custom neotree theme (all-the-icons must be installed!)</span>
(doom-themes-neotree-config)
<span class="org-comment-delimiter">;; </span><span class="org-comment">or for treemacs users</span>
(<span class="org-keyword">setq</span> doom-themes-treemacs-theme <span class="org-string">"doom-atom"</span>) <span class="org-comment-delimiter">; </span><span class="org-comment">use "doom-colors" for less minimal icon theme</span>
(doom-themes-treemacs-config)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Corrects (and improves) org-mode's native fontification.</span>
(doom-themes-org-config)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgdd94483"></a>Footer<br>
<div class="outline-text-6" id="text-orgdd94483">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-doom-themes</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-doom-themes.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org931395d"></a>theme-magic<br>
<div class="outline-text-5" id="text-org931395d">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-theme-magic.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-theme-magic.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'theme-magic))
(<span class="org-keyword">when</span> (executable-find <span class="org-string">"wal"</span>)
  (theme-magic-export-theme-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgb9078e7"></a>Footer<br>
<div class="outline-text-6" id="text-orgb9078e7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-theme-magic</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-theme-magic.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
