posts/Emacs-Configuration.org
**** helpful
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-helpful.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-helpful.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'elisp-demos)
         (straight-use-package 'helpful))
     #+end_src
     #+begin_src emacs-lisp
       (require 'helpful)
       (define-key helpful-mode-map [remap revert-buffer] #'helpful-update)
       (global-set-key [remap describe-command] #'helpful-command)
       (global-set-key [remap describe-function] #'helpful-callable)
       (global-set-key [remap describe-key] #'helpful-key)
       (global-set-key [remap describe-symbol] #'helpful-symbol)
       (global-set-key [remap describe-variable] #'helpful-variable)
       (global-set-key (kbd "C-h F") #'helpful-function)
       (global-set-key (kbd "C-h K") #'describe-keymap)
       (require 'elisp-demos)
       (advice-add 'helpful-update :after #'elisp-demos-advice-helpful-update)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-helpful)
        ;;; config-helpful.el ends here
      #+end_src
**** which-key
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-which-key.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-which-key.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'which-key))
       (require 'which-key)
       (which-key-mode)
       (which-key-setup-side-window-right-bottom)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-which-key)
        ;;; config-which-key.el ends here
      #+end_src
**** ace-window
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-ace-window.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-ace-window.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'ace-window))
       (require 'ace-window)

       (set-face-attribute
        'aw-leading-char-face nil
        :foreground "deep sky blue"
        :weight 'bold
        :height 3.0)

       (set-face-attribute
        'aw-mode-line-face nil
        :inherit 'mode-line-buffer-id
        :foreground "lawn green")

       (setq aw-scope 'frame)
       (setq aw-dispatch-always nil)
       (setq aw-minibuffer-flag t)
       (setq aw-keys '(?q ?w ?e ?r ?t ?a ?s ?d ?f))
       (defvar aw-dispatch-alist
         '((?x aw-delete-window "Delete Window")
           (?m aw-swap-window "Swap Windows")
           (?M aw-move-window "Move Window")
           (?c aw-copy-window "Copy Window")
           (?j aw-switch-buffer-in-window "Select Buffer")
           (?n aw-flip-window)
           (?u aw-switch-buffer-other-window "Switch Buffer Other Window")
           (?c aw-split-window-fair "Split Fair Window")
           (?v aw-split-window-vert "Split Vert Window")
           (?b aw-split-window-horz "Split Horz Window")
           (?o delete-other-windows "Delete Other Windows")
           (?? aw-show-dispatch-help))
         "List of actions for `aw-dispatch-default'.")

       (ace-window-display-mode t)
       (global-set-key [remap other-window] 'ace-window)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-ace-window)
        ;;; config-ace-window.el ends here
      #+end_src
**** perpective
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-perspective.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-perspective.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'perspective))
       (setq persp-initial-frame-name "Main")
       (setq persp-state-default-fle (expand-file-name "statesave" +emacs-data-dir))
       (unless (equal persp-mode t)
         (persp-mode))
       (global-set-key (kbd "C-x b") 'persp-switch-to-buffer*)
       (global-set-key (kbd "C-x k") 'persp-kill-buffer*)
     #+end_src
