posts/Emacs-Configuration.html
<li><a id="org9c4cafc"></a>helpful<br>
<div class="outline-text-5" id="text-org9c4cafc">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-helpful.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-helpful.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'elisp-demos)
  (straight-use-package 'helpful))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">helpful</span>)
(define-key helpful-mode-map [remap revert-buffer] #'helpful-update)
(global-set-key [remap describe-command] #'helpful-command)
(global-set-key [remap describe-function] #'helpful-callable)
(global-set-key [remap describe-key] #'helpful-key)
(global-set-key [remap describe-symbol] #'helpful-symbol)
(global-set-key [remap describe-variable] #'helpful-variable)
(global-set-key (kbd <span class="org-string">"C-h F"</span>) #'helpful-function)
(global-set-key (kbd <span class="org-string">"C-h K"</span>) #'describe-keymap)
(<span class="org-keyword">require</span> '<span class="org-constant">elisp-demos</span>)
(advice-add 'helpful-update <span class="org-builtin">:after</span> #'elisp-demos-advice-helpful-update)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org69ed15f"></a>Footer<br>
<div class="outline-text-6" id="text-org69ed15f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-helpful</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-helpful.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org2b0133c"></a>which-key<br>
<div class="outline-text-5" id="text-org2b0133c">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-which-key.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-which-key.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'which-key))
(<span class="org-keyword">require</span> '<span class="org-constant">which-key</span>)
(which-key-mode)
(which-key-setup-side-window-right-bottom)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org2782a3a"></a>Footer<br>
<div class="outline-text-6" id="text-org2782a3a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-which-key</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-which-key.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd663c39"></a>ace-window<br>
<div class="outline-text-5" id="text-orgd663c39">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-ace-window.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ace-window.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'ace-window))
(<span class="org-keyword">require</span> '<span class="org-constant">ace-window</span>)

(set-face-attribute
 'aw-leading-char-face nil
 <span class="org-builtin">:foreground</span> <span class="org-string">"deep sky blue"</span>
 <span class="org-builtin">:weight</span> 'bold
 <span class="org-builtin">:height</span> 3.0)

(set-face-attribute
 'aw-mode-line-face nil
 <span class="org-builtin">:inherit</span> 'mode-line-buffer-id
 <span class="org-builtin">:foreground</span> <span class="org-string">"lawn green"</span>)

(<span class="org-keyword">setq</span> aw-scope 'frame)
(<span class="org-keyword">setq</span> aw-dispatch-always nil)
(<span class="org-keyword">setq</span> aw-minibuffer-flag t)
(<span class="org-keyword">setq</span> aw-keys '(?q ?w ?e ?r ?t ?a ?s ?d ?f))
(<span class="org-keyword">defvar</span> <span class="org-variable-name">aw-dispatch-alist</span>
  '((?x aw-delete-window <span class="org-string">"Delete Window"</span>)
    (?m aw-swap-window <span class="org-string">"Swap Windows"</span>)
    (?M aw-move-window <span class="org-string">"Move Window"</span>)
    (?c aw-copy-window <span class="org-string">"Copy Window"</span>)
    (?j aw-switch-buffer-in-window <span class="org-string">"Select Buffer"</span>)
    (?n aw-flip-window)
    (?u aw-switch-buffer-other-window <span class="org-string">"Switch Buffer Other Window"</span>)
    (?c aw-split-window-fair <span class="org-string">"Split Fair Window"</span>)
    (?v aw-split-window-vert <span class="org-string">"Split Vert Window"</span>)
    (?b aw-split-window-horz <span class="org-string">"Split Horz Window"</span>)
    (?o delete-other-windows <span class="org-string">"Delete Other Windows"</span>)
    (?? aw-show-dispatch-help))
  <span class="org-doc">"List of actions for `</span><span class="org-doc"><span class="org-constant">aw-dispatch-default</span></span><span class="org-doc">'."</span>)

(ace-window-display-mode t)
(global-set-key [remap other-window] 'ace-window)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org3fef9e0"></a>Footer<br>
<div class="outline-text-6" id="text-org3fef9e0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-ace-window</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ace-window.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd7a8bc0"></a>perpective<br>
<div class="outline-text-5" id="text-orgd7a8bc0">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-perspective.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-perspective.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'perspective))
(<span class="org-keyword">setq</span> persp-initial-frame-name <span class="org-string">"Main"</span>)
(<span class="org-keyword">setq</span> persp-state-default-file (expand-file-name <span class="org-string">"statesave"</span> +emacs-data-dir))
(<span class="org-keyword">unless</span> (equal persp-mode t)
  (persp-mode))
(global-set-key (kbd <span class="org-string">"C-x b"</span>) 'persp-switch-to-buffer*)
(global-set-key (kbd <span class="org-string">"C-x k"</span>) 'persp-kill-buffer*)
(<span class="org-keyword">unless</span> +config/exwm-enabled
  (add-hook 'emacs-startup-hook (<span class="org-keyword">lambda</span> () (persp-state-load persp-state-default-file)))
  (add-hook 'kill-emacs-hook #'persp-state-save))
</pre>
</div>
</div>
<ul class="org-ul">
