posts/Emacs-Configuration.org
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-perspective)
        ;;; config-perspective.el ends here
      #+end_src
**** centaur-tabs
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-centaur-tabs.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-centaur-tabs.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'centaur-tabs)
       (add-hook 'dashboard-mode-hook #'centaur-tabs-local-mode)
       (add-hook 'term-mode-hook #'centaur-tabs-local-mode)
       (add-hook 'calendar-mode-hook #'centaur-tabs-local-mode)
       (add-hook 'org-agenda-mode-hook #'centaur-tabs-local-mode)
       (add-hook 'helpful-mode-hook #'centaur-tabs-local-mode)
       (setq centaur-tabs-style "rounded"
             centaur-tabs-set-icons t
             centaur-tabs-set-bar 'under
             x-underline-at-descent-line t
             centaur-tabs-set-modified-marker t)
       (centaur-tabs-mode t)
       (global-set-key (kbd "C-c t p") 'centaur-tabs-backward)
       (global-set-key (kbd "C-c t C-p") 'centaur-tabs-backward)
       (global-set-key (kbd "C-c t n") 'centaur-tabs-forward)
       (global-set-key (kbd "C-c t C-n") 'centaur-tabs-forward)
       (global-set-key (kbd "C-c t M-p") 'centaur-tabs-backward-group)
       (global-set-key (kbd "C-c t M-n") 'centaur-tabs-forward-group)

       ;; buffer groups
       (defun centaur-tabs-buffer-groups ()
         "`centaur-tabs-buffer-groups' control buffers' group rules.

          Group centaur-tabs with mode if buffer is derived from
         `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
          All buffer name start with * will group to \"Emacs\".
          Other buffer group by `centaur-tabs-get-group-name' with project name."
         (list
          (cond
           ((or (string-equal "*" (substring (buffer-name) 0 1))
                (memq major-mode '(magit-process-mode
                                   magit-status-mode
                                   magit-diff-mode
                                   magit-log-mode
                                   magit-file-mode
                                   magit-blob-mode
                                   magit-blame-mode
                                   )))
            "Emacs")
           ((derived-mode-p 'prog-mode)
            "Editing")
           ((derived-mode-p 'dired-mode)
            "Dired")
           ((memq major-mode '(helpful-mode
                               help-mode))
            "Help")
           ((memq major-mode '(org-mode
                               org-agenda-clockreport-mode
                               org-src-mode
                               org-agenda-mode
                               org-beamer-mode
                               org-indent-mode
                               org-bullets-mode
                               org-cdlatex-mode
                               org-agenda-log-mode
                               diary-mode))
            "OrgMode")
           (t
            (centaur-tabs-get-group-name (current-buffer))))))
       (setq centaur-tabs--buffer-show-groups t)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-centaur-tabs)
        ;;; config-centaur-tabs.el ends here
      #+end_src
**** rainbow-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-rainbow-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-rainbow-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'rainbow-mode))
       (require 'rainbow-mode)
       (add-hook 'css-mode-hook #'rainbow-mode)
       ;; turn off word colors
       (defun +rainbow-turn-off-words ()
         "Turn off word colors in rainbow-mode."
         (interactive)
         (font-lock-remove-keywords
          nil
          `(,@rainbow-x-colors-font-lock-keywords
            ,@rainbow-latex-rgb-colors-font-lock-keywords
            ,@rainbow-r-colors-font-lock-keywords
            ,@rainbow-html-colors-font-lock-keywords
            ,@rainbow-html-rgb-colors-font-lock-keywords)))
       ;; turn off hexadecimal colors
       (defun +rainbow-turn-off-hexadecimal ()
         "Turn off hexadecimal colors in rainbow-mode."
         (interactive)
         (font-lock-remove-keywords
          nil
          `(,@rainbow-hexadecimal-colors-font-lock-keywords)))
       ;; TODO: set toggling and keybindings
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-rainbow-mode)
        ;;; config-rainbow-mode.el ends here
      #+end_src
