posts/Emacs-Configuration.html
<li><a id="org7268795"></a>Footer<br>
<div class="outline-text-6" id="text-org7268795">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-perspective</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-perspective.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgf4bd5e1"></a>centaur-tabs<br>
<div class="outline-text-5" id="text-orgf4bd5e1">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-centaur-tabs.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-centaur-tabs.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'centaur-tabs)
(add-hook 'dashboard-mode-hook #'centaur-tabs-local-mode)
(add-hook 'term-mode-hook #'centaur-tabs-local-mode)
(add-hook 'calendar-mode-hook #'centaur-tabs-local-mode)
(add-hook 'org-agenda-mode-hook #'centaur-tabs-local-mode)
(add-hook 'helpful-mode-hook #'centaur-tabs-local-mode)
(<span class="org-keyword">setq</span> centaur-tabs-style <span class="org-string">"rounded"</span>
      centaur-tabs-set-icons t
      centaur-tabs-set-bar 'under
      x-underline-at-descent-line t
      centaur-tabs-set-modified-marker t)
(centaur-tabs-mode t)
(global-set-key (kbd <span class="org-string">"C-c t p"</span>) 'centaur-tabs-backward)
(global-set-key (kbd <span class="org-string">"C-c t C-p"</span>) 'centaur-tabs-backward)
(global-set-key (kbd <span class="org-string">"C-c t n"</span>) 'centaur-tabs-forward)
(global-set-key (kbd <span class="org-string">"C-c t C-n"</span>) 'centaur-tabs-forward)
(global-set-key (kbd <span class="org-string">"C-c t M-p"</span>) 'centaur-tabs-backward-group)
(global-set-key (kbd <span class="org-string">"C-c t M-n"</span>) 'centaur-tabs-forward-group)
(global-set-key (kbd <span class="org-string">"C-c t g"</span>) 'centaur-tabs-consult-switch-group)

<span class="org-comment-delimiter">;; </span><span class="org-comment">buffer groups</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">centaur-tabs-buffer-groups</span> ()
  <span class="org-doc">"`</span><span class="org-doc"><span class="org-constant">centaur-tabs-buffer-groups</span></span><span class="org-doc">' control buffers' group rules.</span>

<span class="org-doc">   Group centaur-tabs with mode if buffer is derived from</span>
<span class="org-doc">  `</span><span class="org-doc"><span class="org-constant">eshell-mode</span></span><span class="org-doc">' `</span><span class="org-doc"><span class="org-constant">emacs-lisp-mode</span></span><span class="org-doc">' `</span><span class="org-doc"><span class="org-constant">dired-mode</span></span><span class="org-doc">' `</span><span class="org-doc"><span class="org-constant">org-mode</span></span><span class="org-doc">' `</span><span class="org-doc"><span class="org-constant">magit-mode</span></span><span class="org-doc">'.</span>
<span class="org-doc">   All buffer name start with * will group to \"Emacs\".</span>
<span class="org-doc">   Other buffer group by `</span><span class="org-doc"><span class="org-constant">centaur-tabs-get-group-name</span></span><span class="org-doc">' with project name."</span>
  (list
   (<span class="org-keyword">cond</span>
    ((<span class="org-keyword">or</span> (string-equal <span class="org-string">"*"</span> (substring (buffer-name) 0 1))
         (memq major-mode '(magit-process-mode
                            magit-status-mode
                            magit-diff-mode
                            magit-log-mode
                            magit-file-mode
                            magit-blob-mode
                            magit-blame-mode
                            )))
     <span class="org-string">"Emacs"</span>)
    ((derived-mode-p 'prog-mode)
     <span class="org-string">"Editing"</span>)
    ((derived-mode-p 'dired-mode)
     <span class="org-string">"Dired"</span>)
    ((memq major-mode '(helpful-mode
                        help-mode))
     <span class="org-string">"Help"</span>)
    ((memq major-mode '(org-mode
                        org-agenda-clockreport-mode
                        org-src-mode
                        org-agenda-mode
                        org-beamer-mode
                        org-indent-mode
                        org-bullets-mode
                        org-cdlatex-mode
                        org-agenda-log-mode
                        diary-mode))
     <span class="org-string">"OrgMode"</span>)
    (t
     (centaur-tabs-get-group-name (current-buffer))))))
(<span class="org-keyword">setq</span> centaur-tabs--buffer-show-groups t)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org054fad9"></a>consult integration<br>
<div class="outline-text-6" id="text-org054fad9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">centaur-tabs-consult-switch-group</span> ()
  <span class="org-doc">"Display a list of current buffer groups using Consult."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">consult</span>)
    (<span class="org-keyword">require</span> '<span class="org-constant">consult</span>)
    (centaur-tabs-switch-group
     (consult--read
      (centaur-tabs-get-groups)
      <span class="org-builtin">:prompt</span> <span class="org-string">"Centaur Tabs Groups:"</span>))))
</pre>
</div>
</div>
</li>
<li><a id="orgf29bb32"></a>Footer<br>
<div class="outline-text-6" id="text-orgf29bb32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-centaur-tabs</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-centaur-tabs.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org6e60282"></a>rainbow-mode<br>
<div class="outline-text-5" id="text-org6e60282">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-rainbow-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rainbow-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'rainbow-mode))
(<span class="org-keyword">require</span> '<span class="org-constant">rainbow-mode</span>)
(add-hook 'css-mode-hook #'rainbow-mode)
<span class="org-comment-delimiter">;; </span><span class="org-comment">turn off word colors</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">+rainbow-turn-off-words</span> ()
  <span class="org-doc">"Turn off word colors in rainbow-mode."</span>
  (<span class="org-keyword">interactive</span>)
  (font-lock-remove-keywords
   nil
   `(,@rainbow-x-colors-font-lock-keywords
     ,@rainbow-latex-rgb-colors-font-lock-keywords
     ,@rainbow-r-colors-font-lock-keywords
     ,@rainbow-html-colors-font-lock-keywords
     ,@rainbow-html-rgb-colors-font-lock-keywords)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">turn off hexadecimal colors</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">+rainbow-turn-off-hexadecimal</span> ()
  <span class="org-doc">"Turn off hexadecimal colors in rainbow-mode."</span>
  (<span class="org-keyword">interactive</span>)
  (font-lock-remove-keywords
   nil
   `(,@rainbow-hexadecimal-colors-font-lock-keywords)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: set toggling and keybindings</span>
</pre>
</div>
</div>
<ul class="org-ul">
