posts/Emacs-Configuration.org
**** rainbow-delimiters
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-rainbow-delimiters.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-rainbow-delimiters.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'rainbow-delimiters))
       (require 'rainbow-delimiters)
       (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
       (add-hook 'org-mode-hook 'rainbow-delimiters-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-rainbow-delimiters)
        ;;; config-rainbow-delimiters.el ends here
      #+end_src
**** hl-todo
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-hl-todo.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-hl-todo.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'hl-todo)
       (require 'hl-todo)
       (global-hl-todo-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-hl-todo)
        ;;; config-hl-todo.el ends here
      #+end_src
**** diminish
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-diminish.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-diminish.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'diminish))
       (require 'diminish)
       (diminish 'rainbow-mode)
       (diminish 'eldoc-mode)
       (diminish 'subword-mode)
       (diminish 'flycheck-mode)
       (diminish 'projectile-mode)
       (diminish 'yas-global-mode)
       (diminish 'yas-extra-mode)
       (diminish 'yas-minor-mode)
       (diminish 'which-key-mode)
       (diminish 'theme-magic-export-theme-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-diminish)
        ;;; config-diminish.el ends here
      #+end_src
**** dashboard
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-dashboard.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-dashboard.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'dashboard))
       (require 'dashboard)
       (dashboard-setup-startup-hook)
       (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
       (setq dashboard-center-content t)
       (setq dashboard-items '((recents  . 5)
                               (bookmarks . 5)
                               (projects . 5)
                               (agenda . 5)
                               (registers . 5)))
       (setq dashboard-set-heading-icons t)
       (setq dashboard-set-file-icons t)
       (setq dashboard-set-navigator t)
       (setq dashboard-set-init-info t)
       (setq dashboard-week-agenda t)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-dashboard)
        ;;; config-dashboard.el ends here
      #+end_src
**** alert
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-alert.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-alert.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'alert))

       (customize-set-variable 'alert-default-style #'notifications)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-alert)
        ;;; config-alert.el ends here
      #+end_src
