posts/Emacs-Configuration.html
<li><a id="orgee8d40e"></a>Footer<br>
<div class="outline-text-6" id="text-orgee8d40e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-rainbow-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rainbow-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgbcdd69f"></a>rainbow-delimiters<br>
<div class="outline-text-5" id="text-orgbcdd69f">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-rainbow-delimiters.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rainbow-delimiters.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'rainbow-delimiters))
(<span class="org-keyword">require</span> '<span class="org-constant">rainbow-delimiters</span>)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
(add-hook 'org-mode-hook 'rainbow-delimiters-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org518005c"></a>Footer<br>
<div class="outline-text-6" id="text-org518005c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-rainbow-delimiters</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rainbow-delimiters.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org30a7772"></a>hl-todo<br>
<div class="outline-text-5" id="text-org30a7772">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-hl-todo.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-hl-todo.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'hl-todo)
(<span class="org-keyword">require</span> '<span class="org-constant">hl-todo</span>)
(global-hl-todo-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgf3dcc32"></a>Footer<br>
<div class="outline-text-6" id="text-orgf3dcc32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-hl-todo</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-hl-todo.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org78dad05"></a>diminish<br>
<div class="outline-text-5" id="text-org78dad05">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-diminish.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-diminish.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'diminish))
(<span class="org-keyword">require</span> '<span class="org-constant">diminish</span>)
(<span class="org-keyword">progn</span>
  (diminish 'rainbow-mode)
  (diminish 'eldoc-mode)
  (diminish 'subword-mode)
  (diminish 'flycheck-mode)
  (diminish 'projectile-mode)
  (diminish 'yas-global-mode)
  (diminish 'yas-extra-mode)
  (diminish 'yas-minor-mode)
  (diminish 'which-key-mode)
  (diminish 'desktop-environment-mode)
  (diminish 'desktop-environment-mode)
  (diminish 'projectile-mode)
  (diminish 'paredit-mode)
  (diminish 'theme-magic-export-theme-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org62a3cc1"></a>Footer<br>
<div class="outline-text-6" id="text-org62a3cc1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-diminish</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-diminish.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd7e909a"></a>dashboard<br>
<div class="outline-text-5" id="text-orgd7e909a">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-dashboard.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-dashboard.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'dashboard))
(<span class="org-keyword">require</span> '<span class="org-constant">dashboard</span>)
(dashboard-setup-startup-hook)
(<span class="org-keyword">setq</span> initial-buffer-choice (<span class="org-keyword">lambda</span> () (get-buffer <span class="org-string">"*dashboard*"</span>)))
(<span class="org-keyword">setq</span> dashboard-center-content t)
(<span class="org-keyword">setq</span> dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))
(<span class="org-keyword">setq</span> dashboard-set-heading-icons t)
(<span class="org-keyword">setq</span> dashboard-set-file-icons t)
(<span class="org-keyword">setq</span> dashboard-set-navigator t)
(<span class="org-keyword">setq</span> dashboard-set-init-info t)
(<span class="org-keyword">setq</span> dashboard-week-agenda t)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1937018"></a>Footer<br>
<div class="outline-text-6" id="text-org1937018">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-dashboard</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-dashboard.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org9976236"></a>alert<br>
<div class="outline-text-5" id="text-org9976236">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-alert.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-alert.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'alert))

(customize-set-variable 'alert-default-style #'notifications)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org15378cd"></a>Footer<br>
<div class="outline-text-6" id="text-org15378cd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-alert</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-alert.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
