posts/Emacs-Configuration.org
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-ui)
      ;;; config-defaults-ui.el ends here
    #+end_src
** Default Editings
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-editings.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-editings.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
   #+end_src
*** Escape cancels all
    #+begin_src emacs-lisp
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    #+end_src
*** Enable =show-paren-mode=
    #+begin_src emacs-lisp
      (show-paren-mode)
    #+end_src
*** Enable =electric-pair-mode=
    #+begin_src emacs-lisp
      (electric-pair-mode 1)
    #+end_src
*** Use spaces instead of tabs
    #+begin_src emacs-lisp
      (setq-default indent-tabs-mode nil)
    #+end_src
*** Use "y" and "n" to confirm/negate prompt instead of "yes" and "no".
    #+begin_src emacs-lisp
      (fset 'yes-or-no-p 'y-or-n-p)
    #+end_src
*** Don't save duplicates in =kill-ring=
    #+begin_src emacs-lisp
      (customize-set-variable 'kill-do-not-save-duplicates t)
    #+end_src
*** Better support for files with long lines.
    #+begin_src emacs-lisp
      (setq-default bidi-paragraph-direction 'left-to-right)
      (setq-default bidi-inhibit-bpa t)
      (global-so-long-mode 1)
    #+end_src
*** Make shebang (#!) file executable when saved.
    #+begin_src emacs-lisp
      (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
    #+end_src
*** Remove text in active region if inserting text.
    #+begin_src emacs-lisp
      (delete-selection-mode 1)
    #+end_src
*** Mouse middle-click yanks where the point is, not where the mouse is.
    #+begin_src emacs-lisp
      (setq mouse-yank-at-point t)
    #+end_src
*** Delete trailing whitespace on save.
    #+begin_src emacs-lisp
      (add-hook 'before-save-hook 'delete-trailing-whitespace)
    #+end_src
*** Easily navigate sillycased words.
    #+begin_src emacs-lisp
      (global-subword-mode 1)
    #+end_src
*** Apropos commands will search more extensively.
    #+begin_src emacs-lisp
      (require 'apropos)
      (setq apropos-do-all t)
    #+end_src
*** Turn on =recentf-mode=
    #+begin_src emacs-lisp
      (add-hook 'after-init-hook #'recentf-mode)
      (setq recentf-save-file (expand-file-name "recentf" +emacs-data-dir))
      (setq recentf-max-saved-items 100) ;; just 20 is too recent
    #+end_src
*** Enable =savehist-mode= for an command history
    #+begin_src emacs-lisp
      (savehist-mode 1)
      (setq history-length 1000)
      (setq savehist-file (expand-file-name "history" +emacs-backup-directory))
      (setq savehist-additional-variables
            '(kill-ring
              search-ring
              regexp-search-ring))
    #+end_src
*** Enable =save-place-mode=
    #+begin_src emacs-lisp
      (setq save-place-mode 1)
      (setq save-place-file (expand-file-name "save-place.el" +emacs-data-dir))
    #+end_src
*** =abbrev-mode=
    #+begin_src emacs-lisp
      (setq abbrev-file-name (expand-file-name "abbrev_defs" +emacs-data-dir))
    #+end_src
*** =auto-insert= mode
**** auto-insert-directory
     #+begin_src emacs-lisp
       (setq auto-insert-directory (expand-file-name "auto-insert/" +emacs-data-dir))
     #+end_src
**** TODO =auto-insert-alist=
     :LOGBOOK:
     - State "TODO"       from              [2022-03-22 Tue 16:45]
     :END:

*** Move files to trash when deleting.
    #+begin_src emacs-lisp
      (setq delete-by-moving-to-trash t)
    #+end_src
*** Additional Packages
