posts/Emacs-Configuration.html
<div id="outline-container-org09db3f3" class="outline-4">
<h4 id="org09db3f3">Footer</h4>
<div class="outline-text-4" id="text-org09db3f3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-ui</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-ui.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7c9abd2" class="outline-3">
<h3 id="org7c9abd2">Default Editings</h3>
<div class="outline-text-3" id="text-org7c9abd2">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-editings.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-editings.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-org0490f25" class="outline-4">
<h4 id="org0490f25">Escape cancels all</h4>
<div class="outline-text-4" id="text-org0490f25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"&lt;escape&gt;"</span>) 'keyboard-escape-quit)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a9ae17" class="outline-4">
<h4 id="org0a9ae17">Enable <code>show-paren-mode</code></h4>
<div class="outline-text-4" id="text-org0a9ae17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(show-paren-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7dce8fc" class="outline-4">
<h4 id="org7dce8fc">Enable <code>electric-pair-mode</code></h4>
<div class="outline-text-4" id="text-org7dce8fc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(electric-pair-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6799417" class="outline-4">
<h4 id="org6799417">Use spaces instead of tabs</h4>
<div class="outline-text-4" id="text-org6799417">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq-default</span> indent-tabs-mode nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e5239f" class="outline-4">
<h4 id="org2e5239f">Use &ldquo;y&rdquo; and &ldquo;n&rdquo; to confirm/negate prompt instead of &ldquo;yes&rdquo; and &ldquo;no&rdquo;.</h4>
<div class="outline-text-4" id="text-org2e5239f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c1b726" class="outline-4">
<h4 id="org7c1b726">Don&rsquo;t save duplicates in <code>kill-ring</code></h4>
<div class="outline-text-4" id="text-org7c1b726">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'kill-do-not-save-duplicates t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ba06ec" class="outline-4">
<h4 id="org9ba06ec">Better support for files with long lines.</h4>
<div class="outline-text-4" id="text-org9ba06ec">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq-default</span> bidi-paragraph-direction 'left-to-right)
(<span class="org-keyword">setq-default</span> bidi-inhibit-bpa t)
(global-so-long-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org149e999" class="outline-4">
<h4 id="org149e999">Make shebang (#!) file executable when saved.</h4>
<div class="outline-text-4" id="text-org149e999">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4208107" class="outline-4">
<h4 id="org4208107">Remove text in active region if inserting text.</h4>
<div class="outline-text-4" id="text-org4208107">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(delete-selection-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge480ada" class="outline-4">
<h4 id="orge480ada">Mouse middle-click yanks where the point is, not where the mouse is.</h4>
<div class="outline-text-4" id="text-orge480ada">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> mouse-yank-at-point t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda9b1bd" class="outline-4">
<h4 id="orgda9b1bd">Delete trailing whitespace on save.</h4>
<div class="outline-text-4" id="text-orgda9b1bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'delete-trailing-whitespace)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d7f8f7" class="outline-4">
<h4 id="org9d7f8f7">Easily navigate sillycased words.</h4>
<div class="outline-text-4" id="text-org9d7f8f7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-subword-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga434620" class="outline-4">
<h4 id="orga434620">Apropos commands will search more extensively.</h4>
<div class="outline-text-4" id="text-orga434620">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">apropos</span>)
(<span class="org-keyword">setq</span> apropos-do-all t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgccb15f9" class="outline-4">
<h4 id="orgccb15f9">Turn on <code>recentf-mode</code></h4>
<div class="outline-text-4" id="text-orgccb15f9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook #'recentf-mode)
(<span class="org-keyword">setq</span> recentf-save-file (expand-file-name <span class="org-string">"recentf"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> recentf-max-saved-items 100) <span class="org-comment-delimiter">;; </span><span class="org-comment">just 20 is too recent</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9099dfb" class="outline-4">
<h4 id="org9099dfb">Enable <code>savehist-mode</code> for an command history</h4>
<div class="outline-text-4" id="text-org9099dfb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(savehist-mode 1)
(<span class="org-keyword">setq</span> history-length 1000)
(<span class="org-keyword">setq</span> savehist-file (expand-file-name <span class="org-string">"history"</span> +emacs-backup-directory))
(<span class="org-keyword">setq</span> savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
</pre>
</div>
</div>
</div>
<div id="outline-container-org381d4d3" class="outline-4">
<h4 id="org381d4d3">Enable <code>save-place-mode</code></h4>
<div class="outline-text-4" id="text-org381d4d3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> save-place-mode 1)
(<span class="org-keyword">setq</span> save-place-file (expand-file-name <span class="org-string">"save-place.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6484025" class="outline-4">
<h4 id="org6484025"><code>abbrev-mode</code></h4>
<div class="outline-text-4" id="text-org6484025">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> abbrev-file-name (expand-file-name <span class="org-string">"abbrev_defs"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd88107a" class="outline-4">
<h4 id="orgd88107a"><code>auto-insert</code> mode</h4>
<div class="outline-text-4" id="text-orgd88107a">
</div>
<ul class="org-ul">
<li><a id="orgb734e3f"></a>auto-insert-directory<br>
<div class="outline-text-5" id="text-orgb734e3f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> auto-insert-directory (expand-file-name <span class="org-string">"auto-insert/"</span> +emacs-data-dir))
</pre>
</div>
</div>
</li>
<li><a id="org90aee73"></a><span class="todo TODO">TODO</span> <code>auto-insert-alist</code><br>
<div class="outline-text-5" id="text-org90aee73">
<ul class="org-ul">
<li>State &ldquo;TODO&rdquo;       from              <span class="timestamp-wrapper"><span class="timestamp">[2022-03-22 Tue 16:45]</span></span></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org4dab172" class="outline-4">
<h4 id="org4dab172">Move files to trash when deleting.</h4>
<div class="outline-text-4" id="text-org4dab172">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> delete-by-moving-to-trash t)
</pre>
</div>
</div>
</div>
