posts/Emacs-Configuration.org
**** multiple-cursors
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-multiple-cursors.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-multiple-cursors.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'multiple-cursors))
       (setq mc/list-file (expand-file-name ".mc-lists.el" +emacs-data-dir))
       (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
       (global-set-key (kbd "C-c M->") 'mc/mark-next-like-this)
       (global-set-key (kbd "C-c M-<") 'mc/mark-previous-like-this)
       (global-set-key (kbd "C-c M-a") 'mc/mark-all-like-this)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-multiple-cursors)
        ;;; config-multiple-cursors.el ends here
      #+end_src
**** yasnippet
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-yasnippet.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-yasnippet.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'yasnippet)
         (straight-use-package 'yasnippet-snippets))
       (setq yas-snippet-dir `(,(expand-file-name "yasnippet/snippets/" +emacs-data-dir)))
       (eval-after-load 'yasnippet
         (make-directory (expand-file-name "yasnippet/snippets/" +emacs-data-dir) :parents))
       (yas-global-mode 1)
       (global-set-key (kbd "C-c y i") 'yas-insert-snippet)
       (global-set-key (kbd "C-c y d") 'yas-describe-tables)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-yasnippet)
        ;;; config-yasnippet.el ends here
      #+end_src
**** geiser
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-geiser.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-geiser.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'geiser)
         (straight-use-package 'geiser-guile)
         (straight-use-package 'geiser-racket))
       (eval-after-load 'geiser
         `(make-directory ,(expand-file-name "geiser/" +emacs-data-dir) t))
       (setq geiser-repl-history-filename     (expand-file-name "geiser/repl-history" +emacs-data-dir))
       (require 'geiser-impl)
       (add-to-list 'geiser-implementations-alist '((regexp "\\.scm$") guile))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-geiser)
        ;;; config-geiser.el ends here
      #+end_src
**** yaml-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-yaml-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-yaml-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'yaml-mode))
       (require 'yaml-mode)
       (add-to-list 'auto-mode-alist '("'\\.yaml\\'" . yaml-mode))
       (add-to-list 'auto-mode-alist '("'\\.yml\\'" . yaml-mode))
       (add-hook 'yaml-mode-hook
                 #'(lambda ()
                     (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-yaml-mode)
        ;;; config-yaml-mode.el ends here
      #+end_src
**** toml-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-toml-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-toml-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'toml-mode))
       (add-to-list 'auto-mode-alist '("'\\.toml\\'" . toml-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-toml-mode)
        ;;; config-toml-mode.el ends here
      #+end_src
