posts/Emacs-Configuration.html
<div id="outline-container-orge5e8144" class="outline-4">
<h4 id="orge5e8144">Additional Packages</h4>
<div class="outline-text-4" id="text-orge5e8144">
</div>
<ul class="org-ul">
<li><a id="org36ad5f6"></a>multiple-cursors<br>
<div class="outline-text-5" id="text-org36ad5f6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-multiple-cursors.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-multiple-cursors.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'multiple-cursors))
(<span class="org-keyword">setq</span> mc/list-file (expand-file-name <span class="org-string">".mc-lists.el"</span> +emacs-data-dir))
(global-set-key (kbd <span class="org-string">"C-S-c C-S-c"</span>) 'mc/edit-lines)
(global-set-key (kbd <span class="org-string">"C-c M-&gt;"</span>) 'mc/mark-next-like-this)
(global-set-key (kbd <span class="org-string">"C-c M-&lt;"</span>) 'mc/mark-previous-like-this)
(global-set-key (kbd <span class="org-string">"C-c M-a"</span>) 'mc/mark-all-like-this)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org58c8eb7"></a>Footer<br>
<div class="outline-text-6" id="text-org58c8eb7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-multiple-cursors</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-multiple-cursors.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org4db8a48"></a>yasnippet<br>
<div class="outline-text-5" id="text-org4db8a48">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-yasnippet.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-yasnippet.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'yasnippet)
  (straight-use-package 'yasnippet-snippets))
(<span class="org-keyword">setq</span> yas-snippet-dir `(,(expand-file-name <span class="org-string">"yasnippet/snippets/"</span> +emacs-data-dir)))
(eval-after-load 'yasnippet
  (make-directory (expand-file-name <span class="org-string">"yasnippet/snippets/"</span> +emacs-data-dir) <span class="org-builtin">:parents</span>))
(yas-global-mode 1)
(global-set-key (kbd <span class="org-string">"C-c y i"</span>) 'yas-insert-snippet)
(global-set-key (kbd <span class="org-string">"C-c y d"</span>) 'yas-describe-tables)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1765b5f"></a>Footer<br>
<div class="outline-text-6" id="text-org1765b5f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-yasnippet</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-yasnippet.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgaea3088"></a>geiser<br>
<div class="outline-text-5" id="text-orgaea3088">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-geiser.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-geiser.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'geiser)
  (straight-use-package 'geiser-guile)
  (straight-use-package 'geiser-racket))
(eval-after-load 'geiser
  `(make-directory ,(expand-file-name <span class="org-string">"geiser/"</span> +emacs-data-dir) t))
(<span class="org-keyword">setq</span> geiser-repl-history-filename     (expand-file-name <span class="org-string">"geiser/repl-history"</span> +emacs-data-dir))
(<span class="org-keyword">require</span> '<span class="org-constant">geiser-impl</span>)
(add-to-list 'geiser-implementations-alist '((regexp <span class="org-string">"\\.scm$"</span>) guile))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org2a97c65"></a>Footer<br>
<div class="outline-text-6" id="text-org2a97c65">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-geiser</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-geiser.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org8b0a5ef"></a>yaml-mode<br>
<div class="outline-text-5" id="text-org8b0a5ef">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-yaml-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-yaml-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'yaml-mode))
(<span class="org-keyword">require</span> '<span class="org-constant">yaml-mode</span>)
(add-to-list 'auto-mode-alist '(<span class="org-string">"'\\.yaml\\'"</span> . yaml-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"'\\.yml\\'"</span> . yaml-mode))
(add-hook 'yaml-mode-hook
          #'(lambda ()
              (define-key yaml-mode-map <span class="org-string">"\C-m"</span> 'newline-and-indent)))
</pre>
</div>
</div>
<ul class="org-ul">
