posts/Emacs-Configuration.org
**** nix-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-nix-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-nix-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'nix-mode))
       (add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-nix-mode)
        ;;; config-nix-mode.el ends here
      #+end_src
**** nginx-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-toml-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-toml-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'toml-mode))
       (add-to-list 'auto-mode-alist '("'\\.toml\\'" . toml-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-toml-mode)
        ;;; config-toml-mode.el ends here
      #+end_src
**** nix-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-nginx-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-nginx-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'nginx-mode))
       (require 'nginx-mode)
       (add-to-list 'auto-mode-alist '("/nginx/sites-\\(?:available\\|enabled\\)/" . nginx-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-nginx-mode)
        ;;; config-nginx-mode.el ends here
      #+end_src
**** markdown-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-markdown-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-markdown-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'markdown-mode))
       (autoload 'markdown-mode "markdown-mode"
         "Major mode for editing Markdown files" t)
       (add-to-list 'auto-mode-alist
                    '("\\.\\(?:md\\|markdown\\|mkd\\|mdown\\|mkdn\\|mdwn\\)\\'" . markdown-mode))

       (autoload 'gfm-mode "markdown-mode"
         "Major mode for editing GitHub Flavored Markdown files" t)
       (add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-markdown-mode)
        ;;; config-markdown-mode.el ends here
      #+end_src
