posts/Emacs-Configuration.html
<li><a id="org11d1de2"></a>Footer<br>
<div class="outline-text-6" id="text-org11d1de2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-yaml-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-yaml-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgeb870d7"></a>toml-mode<br>
<div class="outline-text-5" id="text-orgeb870d7">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-toml-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-toml-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'toml-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"'\\.toml\\'"</span> . toml-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org2e519cf"></a>Footer<br>
<div class="outline-text-6" id="text-org2e519cf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-toml-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-toml-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org1bf21b4"></a>nix-mode<br>
<div class="outline-text-5" id="text-org1bf21b4">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-nix-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-nix-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'nix-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.nix\\'"</span> . nix-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org7302c06"></a>Footer<br>
<div class="outline-text-6" id="text-org7302c06">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-nix-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-nix-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org828f151"></a>nginx-mode<br>
<div class="outline-text-5" id="text-org828f151">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-toml-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-toml-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'toml-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"'\\.toml\\'"</span> . toml-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org127f32c"></a>Footer<br>
<div class="outline-text-6" id="text-org127f32c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-toml-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-toml-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org78126d1"></a>nix-mode<br>
<div class="outline-text-5" id="text-org78126d1">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-nginx-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-nginx-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'nginx-mode))
(<span class="org-keyword">require</span> '<span class="org-constant">nginx-mode</span>)
(add-to-list 'auto-mode-alist '(<span class="org-string">"/nginx/sites-</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(?:</span></span><span class="org-string">available</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">enabled</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">/"</span> . nginx-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org2286129"></a>Footer<br>
<div class="outline-text-6" id="text-org2286129">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-nginx-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-nginx-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org2267726"></a>markdown-mode<br>
<div class="outline-text-5" id="text-org2267726">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-markdown-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-markdown-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'markdown-mode))
(autoload 'markdown-mode <span class="org-string">"markdown-mode"</span>
  <span class="org-doc">"Major mode for editing Markdown files"</span> t)
(add-to-list 'auto-mode-alist
             '(<span class="org-string">"\\.</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(?:</span></span><span class="org-string">md</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">markdown</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mkd</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mdown</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mkdn</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mdwn</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\'"</span> . markdown-mode))

(autoload 'gfm-mode <span class="org-string">"markdown-mode"</span>
  <span class="org-doc">"Major mode for editing GitHub Flavored Markdown files"</span> t)
(add-to-list 'auto-mode-alist '(<span class="org-string">"README\\.md\\'"</span> . gfm-mode))
</pre>
</div>
</div>
<ul class="org-ul">
