posts/Emacs-Configuration.org
**** visual-regexp
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-visual-regexp.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-visual-regexp.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'visual-regexp))
       (require 'visual-regexp)
       (define-key global-map (kbd "C-c R") 'vr/replace)
       (define-key global-map (kbd "C-c q") 'vr/query-replace)
       ;; if you use multiple-cursors, this is for you:
       (when (featurep 'config-multiple-cursors)
         (define-key global-map (kbd "C-c M-m") 'vr/mc-mark))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-visual-regexp)
        ;;; config-visual-regexp.el ends here
      #+end_src
**** undo-fu
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-undo-fu.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-undo-fu.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'undo-fu)
         (straight-use-package 'undo-fu-session))
       (require 'undo-fu)
       (setq undo-fu-session-directory (expand-file-name "undo-fu-session/" +emacs-data-dir))
       (global-unset-key (kbd "C-z")) ; previously `suspend-frame'
       (global-set-key (kbd "C-z") 'undo-fu-only-undo)
       (global-set-key (kbd "C-S-z") 'undo-fu-only-redo)
       (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
       (global-undo-fu-session-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-undo-fu)
        ;;; config-undo-fu.el ends here
      #+end_src
**** block-nav
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-block-nav.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-block-nav.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'block-nav)
       (defun +block-nav-previous-block ()
         "Wrapper for `block-nav-previous-block'."
         (interactive)
         (block-nav-previous-block)
         (set-temporary-overlay-map
          (let ((map (make-sparse-keymap)))
            (define-key map (kbd "M-p") '+block-nav-previous-block)
            map)))
       (defun +block-nav-next-block ()
         "Wrapper for `block-nav-next-block'."
         (interactive)
         (block-nav-next-block)
         (set-temporary-overlay-map
          (let ((map (make-sparse-keymap)))
            (define-key map (kbd "M-n") '+block-nav-next-block)
            map)))
       (defun +block-nav-previous-indentation-level ()
         "Wrapper for `block-nav-previous-indentation-level'."
         (interactive)
         (block-nav-previous-indentation-level)
         (set-temporary-overlay-map
          (let ((map (make-sparse-keymap)))
            (define-key map (kbd "M-P") '+block-nav-previous-indentation-level)
            map)))
       (defun +block-nav-next-indentation-level ()
         "Wrapper for `block-nav-next-indentation-level'."
         (interactive)
         (block-nav-next-indentation-level)
         (set-temporary-overlay-map
          (let ((map (make-sparse-keymap)))
            (define-key map (kbd "M-N") '+block-nav-next-indentation-level)
            map)))

       (setf block-nav-move-skip-shallower t
             block-nav-center-after-scroll t)
       (global-set-key (kbd "C-c M-p") '+block-nav-previous-block)
       (global-set-key (kbd "C-c M-n") '+block-nav-next-block)
       (global-set-key (kbd "C-c M-P") '+block-nav-previous-indentation-level)
       (global-set-key (kbd "C-c M-N") '+block-nav-next-indentation-level)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-block-nav)
        ;;; config-block-nav.el ends here
      #+end_src
