posts/Emacs-Configuration.html
<li><a id="orgdad6767"></a>Footer<br>
<div class="outline-text-6" id="text-orgdad6767">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-markdown-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-markdown-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgde0630f"></a>visual-regexp<br>
<div class="outline-text-5" id="text-orgde0630f">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-visual-regexp.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-visual-regexp.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'visual-regexp))
(<span class="org-keyword">require</span> '<span class="org-constant">visual-regexp</span>)
(define-key global-map (kbd <span class="org-string">"C-c R"</span>) 'vr/replace)
(define-key global-map (kbd <span class="org-string">"C-c q"</span>) 'vr/query-replace)
<span class="org-comment-delimiter">;; </span><span class="org-comment">if you use multiple-cursors, this is for you:</span>
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">config-multiple-cursors</span>)
  (define-key global-map (kbd <span class="org-string">"C-c M-m"</span>) 'vr/mc-mark))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgc5b27f4"></a>Footer<br>
<div class="outline-text-6" id="text-orgc5b27f4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-visual-regexp</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-visual-regexp.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org85007c6"></a>undo-fu<br>
<div class="outline-text-5" id="text-org85007c6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-undo-fu.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-undo-fu.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'undo-fu)
  (straight-use-package 'undo-fu-session))
(<span class="org-keyword">require</span> '<span class="org-constant">undo-fu</span>)
(<span class="org-keyword">setq</span> undo-fu-session-directory (expand-file-name <span class="org-string">"undo-fu-session/"</span> +emacs-data-dir))
(global-unset-key (kbd <span class="org-string">"C-z"</span>)) <span class="org-comment-delimiter">; </span><span class="org-comment">previously `</span><span class="org-comment"><span class="org-constant">suspend-frame</span></span><span class="org-comment">'</span>
(global-set-key (kbd <span class="org-string">"C-z"</span>) 'undo-fu-only-undo)
(global-set-key (kbd <span class="org-string">"C-S-z"</span>) 'undo-fu-only-redo)
(<span class="org-keyword">setq</span> undo-fu-session-incompatible-files '(<span class="org-string">"/COMMIT_EDITMSG\\'"</span> <span class="org-string">"/git-rebase-todo\\'"</span>))
(global-undo-fu-session-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orga4d3c48"></a>Footer<br>
<div class="outline-text-6" id="text-orga4d3c48">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-undo-fu</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-undo-fu.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgb48779e"></a>block-nav<br>
<div class="outline-text-5" id="text-orgb48779e">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-block-nav.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-block-nav.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'block-nav)
(<span class="org-keyword">defun</span> <span class="org-function-name">+block-nav-previous-block</span> ()
  <span class="org-doc">"Wrapper for `</span><span class="org-doc"><span class="org-constant">block-nav-previous-block</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (block-nav-previous-block)
  (set-temporary-overlay-map
   (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
     (define-key map (kbd <span class="org-string">"M-p"</span>) '+block-nav-previous-block)
     map)))
(<span class="org-keyword">defun</span> <span class="org-function-name">+block-nav-next-block</span> ()
  <span class="org-doc">"Wrapper for `</span><span class="org-doc"><span class="org-constant">block-nav-next-block</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (block-nav-next-block)
  (set-temporary-overlay-map
   (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
     (define-key map (kbd <span class="org-string">"M-n"</span>) '+block-nav-next-block)
     map)))
(<span class="org-keyword">defun</span> <span class="org-function-name">+block-nav-previous-indentation-level</span> ()
  <span class="org-doc">"Wrapper for `</span><span class="org-doc"><span class="org-constant">block-nav-previous-indentation-level</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (block-nav-previous-indentation-level)
  (set-temporary-overlay-map
   (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
     (define-key map (kbd <span class="org-string">"M-P"</span>) '+block-nav-previous-indentation-level)
     map)))
(<span class="org-keyword">defun</span> <span class="org-function-name">+block-nav-next-indentation-level</span> ()
  <span class="org-doc">"Wrapper for `</span><span class="org-doc"><span class="org-constant">block-nav-next-indentation-level</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (block-nav-next-indentation-level)
  (set-temporary-overlay-map
   (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
     (define-key map (kbd <span class="org-string">"M-N"</span>) '+block-nav-next-indentation-level)
     map)))

(<span class="org-keyword">setf</span> block-nav-move-skip-shallower t
      block-nav-center-after-scroll t)
(global-set-key (kbd <span class="org-string">"C-c M-p"</span>) '+block-nav-previous-block)
(global-set-key (kbd <span class="org-string">"C-c M-n"</span>) '+block-nav-next-block)
(global-set-key (kbd <span class="org-string">"C-c M-P"</span>) '+block-nav-previous-indentation-level)
(global-set-key (kbd <span class="org-string">"C-c M-N"</span>) '+block-nav-next-indentation-level)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgf9a69cd"></a>Footer<br>
<div class="outline-text-6" id="text-orgf9a69cd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-block-nav</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-block-nav.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
