posts/Emacs-Configuration.org
**** rust-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-rust-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-rust-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'rust-mode))
       (require 'rust-mode)
       (add-hook 'rust-mode-hook
                 (lambda () (prettify-symbols-mode)))
       (add-hook 'rust-mode-hook
                 (lambda () (setq indent-tabs-mode nil)))
       (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-rust-mode)
        ;;; config-rust-mode.el ends here
      #+end_src
**** ansible
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-ansible.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-ansible.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'ansible)
       (require 'ansible)
       (add-hook 'yaml-mode-hook #'(lambda () (ansible 1)))
       (add-hook 'ansible-hook 'ansible-auto-decrypt-encrypt)
       ;; set keybinding in yaml-mode since I usually set secrets in variable file
       (define-key yaml-mode-map (kbd "C-c a d") 'ansible-decrypt-buffer)
       (define-key yaml-mode-map (kbd "C-c a e") 'ansible-encrypt-buffer)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-ansible)
        ;;; config-ansible.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-editings)
      ;;; config-defaults-editings.el ends here
    #+end_src
** Default Org Configurations
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-org.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-org.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
     (require 'org)
   #+end_src
   This file stores the common /org-mode/ configuration.
*** load org-contrib
    #+begin_src emacs-lisp
      (when (featurep 'straight)
        (unless +config/is-guix-system
          (straight-use-package 'org-contrib)))
    #+end_src
*** Sets the default directories
    #+begin_src emacs-lisp
      (progn
        `(make-directory ,(expand-file-name "org/" +emacs-data-dir) t)
        (setq org-clock-persist-file (expand-file-name "org/clock-persist.el" +emacs-data-dir))
        (setq org-id-locations-file (expand-file-name "org/id-locations.el" +emacs-data-dir))
        (setq org-persist-directory (expand-file-name "org/persist/" +emacs-data-dir))
        (setq org-publish-timestamp-directory  (expand-file-name "org/timestamps/" +emacs-data-dir))
        (setq org-generic-id-locations-file (expand-file-name ".org-generic-id-locations" +emacs-data-dir)))
    #+end_src
*** =org-structure-template-alist=
    This is an /alist/ of keys and block types, with this, a block can be inserted by pressing ~TAB~ after the string =<KEY=.
    #+begin_src emacs-lisp
      (require 'org-tempo)
      (add-to-list 'org-modules 'org-tempo t)
      (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
      (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (add-to-list 'org-structure-template-alist '("go" . "src go"))
      (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
      (add-to-list 'org-structure-template-alist '("json" . "src json"))
    #+end_src
*** Startup variables
    #+begin_src emacs-lisp
      (setq org-startup-truncated nil
            org-startup-indented nil
            org-startup-align-all-tables t
            org-startup-with-inline-images t
            org-startup-with-latex-preview t
            org-hide-block-startup t)
    #+end_src
*** sound and notifications
    #+begin_src emacs-lisp
      (setq org-clock-sound t)
      (setq org-show-notification-handler "notify-send")
    #+end_src
*** hide leading stars
    #+begin_src emacs-lisp
      (setq org-hide-leading-stars t)
    #+end_src
