posts/Emacs-Configuration.html
<li><a id="org3fdd2b4"></a>rust-mode<br>
<div class="outline-text-5" id="text-org3fdd2b4">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-rust-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rust-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'rust-mode))
(<span class="org-keyword">require</span> '<span class="org-constant">rust-mode</span>)
(add-hook 'rust-mode-hook
          (<span class="org-keyword">lambda</span> () (prettify-symbols-mode)))
(add-hook 'rust-mode-hook
          (<span class="org-keyword">lambda</span> () (<span class="org-keyword">setq</span> indent-tabs-mode nil)))
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.rs\\'"</span> . rust-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org9198eeb"></a>Footer<br>
<div class="outline-text-6" id="text-org9198eeb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-rust-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-rust-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org2f4df21"></a>ansible<br>
<div class="outline-text-5" id="text-org2f4df21">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-ansible.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ansible.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'ansible)
(<span class="org-keyword">require</span> '<span class="org-constant">ansible</span>)
(add-hook 'yaml-mode-hook #'(lambda () (ansible 1)))
(add-hook 'ansible-hook 'ansible-auto-decrypt-encrypt)
<span class="org-comment-delimiter">;; </span><span class="org-comment">set keybinding in yaml-mode since I usually set secrets in variable file</span>
(define-key yaml-mode-map (kbd <span class="org-string">"C-c a d"</span>) 'ansible-decrypt-buffer)
(define-key yaml-mode-map (kbd <span class="org-string">"C-c a e"</span>) 'ansible-encrypt-buffer)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgbf7f24b"></a>Footer<br>
<div class="outline-text-6" id="text-orgbf7f24b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-ansible</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ansible.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgce72e8d" class="outline-4">
<h4 id="orgce72e8d">Footer</h4>
<div class="outline-text-4" id="text-orgce72e8d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-editings</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-editings.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8680f67" class="outline-3">
<h3 id="org8680f67">Default Org Configurations</h3>
<div class="outline-text-3" id="text-org8680f67">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-org.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-org.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)
</pre>
</div>
<p>
This file stores the common <i>org-mode</i> configuration.
</p>
</div>
<div id="outline-container-orga5eb9b7" class="outline-4">
<h4 id="orga5eb9b7">load org-contrib</h4>
<div class="outline-text-4" id="text-orga5eb9b7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">straight</span>)
  (<span class="org-keyword">unless</span> +config/is-guix-system
    (straight-use-package 'org-contrib)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge816d77" class="outline-4">
<h4 id="orge816d77">Sets the default directories</h4>
<div class="outline-text-4" id="text-orge816d77">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">progn</span>
  `(make-directory ,(expand-file-name <span class="org-string">"org/"</span> +emacs-data-dir) t)
  (<span class="org-keyword">setq</span> org-clock-persist-file (expand-file-name <span class="org-string">"org/clock-persist.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> org-id-locations-file (expand-file-name <span class="org-string">"org/id-locations.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> org-persist-directory (expand-file-name <span class="org-string">"org/persist/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> org-publish-timestamp-directory  (expand-file-name <span class="org-string">"org/timestamps/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> org-generic-id-locations-file (expand-file-name <span class="org-string">".org-generic-id-locations"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a4d53d" class="outline-4">
<h4 id="org0a4d53d"><code>org-structure-template-alist</code></h4>
<div class="outline-text-4" id="text-org0a4d53d">
<p>
This is an <i>alist</i> of keys and block types, with this, a block can be inserted by pressing <code>TAB</code> after the string <code>&lt;KEY</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)
(add-to-list 'org-modules 'org-tempo t)
(add-to-list 'org-structure-template-alist '(<span class="org-string">"sh"</span> . <span class="org-string">"src sh"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"lisp"</span> . <span class="org-string">"src lisp"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"el"</span> . <span class="org-string">"src emacs-lisp"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"sc"</span> . <span class="org-string">"src scheme"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"ts"</span> . <span class="org-string">"src typescript"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"py"</span> . <span class="org-string">"src python"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"go"</span> . <span class="org-string">"src go"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"yaml"</span> . <span class="org-string">"src yaml"</span>))
(add-to-list 'org-structure-template-alist '(<span class="org-string">"json"</span> . <span class="org-string">"src json"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org27217a6" class="outline-4">
<h4 id="org27217a6">Startup variables</h4>
<div class="outline-text-4" id="text-org27217a6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-startup-truncated nil
      org-startup-indented nil
      org-startup-align-all-tables t
      org-startup-with-inline-images t
      org-startup-with-latex-preview t
      org-hide-block-startup t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2ac29f" class="outline-4">
<h4 id="orge2ac29f">sound and notifications</h4>
<div class="outline-text-4" id="text-orge2ac29f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-clock-sound t)
(<span class="org-keyword">setq</span> org-show-notification-handler <span class="org-string">"notify-send"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9521d10" class="outline-4">
<h4 id="org9521d10">hide leading stars</h4>
<div class="outline-text-4" id="text-org9521d10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-hide-leading-stars t)
</pre>
</div>
</div>
</div>
