posts/Emacs-Configuration.org
*** adapt indentation
    #+begin_src emacs-lisp
      (setq org-adapt-indentation t)
    #+end_src
*** org-priorities
    #+begin_src emacs-lisp
      (setq org-highest-priority ?A
            org-lowest-priority ?C
            org-default-priority ?C)
      (setq org-priority-faces '((?A . (:foreground "#dc322f" :weight bold))
                                 (?B . (:foreground "#fdf6e3"))
                                 (?C . (:foreground "#859900"))))
    #+end_src
*** fontify
    #+begin_src emacs-lisp
      (setq org-fontify-quote-and-verse-blocks t)
    #+end_src
*** footnote
    #+begin_src emacs-lisp
      (setq org-footnote-auto-adjust t)
    #+end_src
*** invisible edits
    #+begin_src emacs-lisp
      (setq org-catch-invisible-edits 'smart)
    #+end_src
*** hide emphasis-marker
    #+begin_src emacs-lisp
      (setq org-hide-emphasis-markers t)
    #+end_src
*** images
    #+begin_src emacs-lisp
      (setq org-image-actual-width nil)
    #+end_src
*** links
    Set to relative path
    #+begin_src emacs-lisp
      (setq org-link-file-path-type 'relative)
    #+end_src
*** org-directory
    #+begin_src emacs-lisp
      (unless (boundp 'org-directory)
        (customize-set-variable 'org-directory (expand-file-name "Documents/org/" (getenv "HOME"))))
    #+end_src
*** org-agenda
    #+begin_src emacs-lisp
      (require 'org-agenda)
      (setq org-agenda-files (list org-directory)
            org-agenda-span 'day
            org-agenda-window-setup (quote current-window)
            org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled
            org-agenda-include-diary t
            org-clock-persist 'history)
    #+end_src
*** org-capture
    #+begin_src emacs-lisp
      (defvar +org-capture-todo-file "todo.org"
        "Default target for todo entries.
                    Relative to `org-directory', unless it is absolute.")

      (defun +org-capture-todo-file ()
        "Expand `+org-capture-todo-file' from `org-directory'.
                    If it is an absolute path return `+org-capture-todo-file' verbatim."
        (expand-file-name +org-capture-todo-file org-directory))

      (defvar +org-capture-notes-file "notes.org"
        "Default target for storing notes.
      Used as a fall back file for org-capture.el, for templates that do not specify a
      target file. Is relative to `org-directory', unless it is absolute.")

      (defun +org-capture-notes-file ()
        "Expand `+org-capture-notes-file' from `org-directory'.
      If it is an absolute path return `+org-capture-notes-file' verbatim."
        (defvar +org-capture-notes-file org-directory))

      (defvar +org-capture-links-file "links.org"
        "Default target for storing timestamped journal entries.
      Is relative to `org-directory', unless it is absolute.")

      (defun +org-capture-links-file ()
        "Expand `+org-capture-links-file' from `org-directory'.
      If it is an absolute path return `+org-capture-links-file' verbatim."
        (expand-file-name +org-capture-links-file org-directory))

      (defvar +org-capture-habits-file "habits.org"
        "Default target for storing repeated entries.
      Is relative to `org-directory', unless it is absolute.")

      (defun +org-capture-habits-file ()
        "Expand `+org-capture-habits-file' from `org-directory'.
      If it is an absolute path return `+org-capture-habits-file' verbatim."
        (expand-file-name +org-capture-habits-file org-directory))

      (defvar +org-capture-projects-file "projects.org"
        "Default target for storing project entries.
      Is relative to `org-directory', unless it is absolute.")

      (defun +org-capture-projects-file ()
        "Expand `+org-capture-projects-file' from `org-directory'.
      If it is an absolute path return `+org-capture-projects-file' verbatim."
        (expand-file-name +org-capture-projects-file org-directory))

      (require 'org-capture)
      (setq org-default-notes-file +org-capture-notes-file)
    #+end_src
*** org-archive
    #+begin_src emacs-lisp
      (defvar +org-archives-file "archives.org"
        "Default target for storing archived entries.
      Is relative to `org-directory', unless it is absolute.")

      (defun +org-archives-file ()
        "Expand `+org-archives-file' from `org-directory'.
      If it is an absolute path return `+org-archives-file' verbatim."
        (expand-file-name +org-archives-file org-directory))
    #+end_src
