posts/Emacs-Configuration.html
<div id="outline-container-orgeae6186" class="outline-4">
<h4 id="orgeae6186">adapt indentation</h4>
<div class="outline-text-4" id="text-orgeae6186">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-adapt-indentation t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a28214" class="outline-4">
<h4 id="org0a28214">org-priorities</h4>
<div class="outline-text-4" id="text-org0a28214">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-highest-priority ?A
      org-lowest-priority ?C
      org-default-priority ?C)
(<span class="org-keyword">setq</span> org-priority-faces '((?A . (<span class="org-builtin">:foreground</span> <span class="org-string">"#dc322f"</span> <span class="org-builtin">:weight</span> bold))
                           (?B . (<span class="org-builtin">:foreground</span> <span class="org-string">"#fdf6e3"</span>))
                           (?C . (<span class="org-builtin">:foreground</span> <span class="org-string">"#859900"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org12a41c8" class="outline-4">
<h4 id="org12a41c8">fontify</h4>
<div class="outline-text-4" id="text-org12a41c8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-fontify-quote-and-verse-blocks t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2736841" class="outline-4">
<h4 id="org2736841">footnote</h4>
<div class="outline-text-4" id="text-org2736841">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-footnote-auto-adjust t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org57601a1" class="outline-4">
<h4 id="org57601a1">invisible edits</h4>
<div class="outline-text-4" id="text-org57601a1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-catch-invisible-edits 'smart)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga1ce829" class="outline-4">
<h4 id="orga1ce829">hide emphasis-marker</h4>
<div class="outline-text-4" id="text-orga1ce829">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-hide-emphasis-markers t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb41e7d0" class="outline-4">
<h4 id="orgb41e7d0">images</h4>
<div class="outline-text-4" id="text-orgb41e7d0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-image-actual-width nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4c9cce" class="outline-4">
<h4 id="orgf4c9cce">links</h4>
<div class="outline-text-4" id="text-orgf4c9cce">
<p>
Set to relative path
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-link-file-path-type 'relative)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd275bb2" class="outline-4">
<h4 id="orgd275bb2">org-directory</h4>
<div class="outline-text-4" id="text-orgd275bb2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> (boundp 'org-directory)
  (customize-set-variable 'org-directory (expand-file-name <span class="org-string">"Documents/org/"</span> (getenv <span class="org-string">"HOME"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b3f3b2" class="outline-4">
<h4 id="org5b3f3b2">org-agenda</h4>
<div class="outline-text-4" id="text-org5b3f3b2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-agenda</span>)
(<span class="org-keyword">setq</span> org-agenda-files (list org-directory)
      org-agenda-span 'day
      org-agenda-window-setup (<span class="org-keyword">quote</span> current-window)
      org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled
      org-agenda-include-diary t
      org-clock-persist 'history)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc5277f6" class="outline-4">
<h4 id="orgc5277f6">org-capture</h4>
<div class="outline-text-4" id="text-orgc5277f6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-todo-file</span> <span class="org-string">"todo.org"</span>
  <span class="org-doc">"Default target for todo entries.</span>
<span class="org-doc">              Relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-capture-todo-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-capture-todo-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">              If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-capture-todo-file</span></span><span class="org-doc">' verbatim."</span>
  (expand-file-name +org-capture-todo-file org-directory))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-notes-file</span> <span class="org-string">"notes.org"</span>
  <span class="org-doc">"Default target for storing notes.</span>
<span class="org-doc">Used as a fall back file for org-capture.el, for templates that do not specify a</span>
<span class="org-doc">target file. Is relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-capture-notes-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-capture-notes-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-capture-notes-file</span></span><span class="org-doc">' verbatim."</span>
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-notes-file</span> org-directory))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-links-file</span> <span class="org-string">"links.org"</span>
  <span class="org-doc">"Default target for storing timestamped journal entries.</span>
<span class="org-doc">Is relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-capture-links-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-capture-links-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-capture-links-file</span></span><span class="org-doc">' verbatim."</span>
  (expand-file-name +org-capture-links-file org-directory))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-habits-file</span> <span class="org-string">"habits.org"</span>
  <span class="org-doc">"Default target for storing repeated entries.</span>
<span class="org-doc">Is relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-capture-habits-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-capture-habits-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-capture-habits-file</span></span><span class="org-doc">' verbatim."</span>
  (expand-file-name +org-capture-habits-file org-directory))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-capture-projects-file</span> <span class="org-string">"projects.org"</span>
  <span class="org-doc">"Default target for storing project entries.</span>
<span class="org-doc">Is relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-capture-projects-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-capture-projects-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-capture-projects-file</span></span><span class="org-doc">' verbatim."</span>
  (expand-file-name +org-capture-projects-file org-directory))

(<span class="org-keyword">require</span> '<span class="org-constant">org-capture</span>)
(<span class="org-keyword">setq</span> org-default-notes-file +org-capture-notes-file)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd2b98e3" class="outline-4">
<h4 id="orgd2b98e3">org-archive</h4>
<div class="outline-text-4" id="text-orgd2b98e3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-archives-file</span> <span class="org-string">"archives.org"</span>
  <span class="org-doc">"Default target for storing archived entries.</span>
<span class="org-doc">Is relative to `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">', unless it is absolute."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-archives-file</span> ()
  <span class="org-doc">"Expand `</span><span class="org-doc"><span class="org-constant">+org-archives-file</span></span><span class="org-doc">' from `</span><span class="org-doc"><span class="org-constant">org-directory</span></span><span class="org-doc">'.</span>
<span class="org-doc">If it is an absolute path return `</span><span class="org-doc"><span class="org-constant">+org-archives-file</span></span><span class="org-doc">' verbatim."</span>
  (expand-file-name +org-archives-file org-directory))
</pre>
</div>
</div>
</div>
