posts/Emacs-Configuration.org
*** Sets the defaults directories
    #+begin_src emacs-lisp
      (setq org-default-notes-file
            (expand-file-name +org-capture-notes-file org-directory)
            +org-capture-links-file
            (expand-file-name +org-capture-links-file org-directory)
            +org-capture-projects-file
            (expand-file-name +org-capture-projects-file org-directory)
            +org-capture-habits-file
            (expand-file-name +org-capture-habits-file org-directory))
    #+end_src
*** Logging
    #+begin_src emacs-lisp
      (setq org-log-done 'time
            org-log-refile 'time
            org-log-redeadline 'time
            org-log-note-clock-out t
            org-log-into-drawer t
            org-log-note-headings '((done . "CLOSING NOTE %t")
                                    (state . "State %-12s from %-12S %t")
                                    (note . "Note taken on %t")
                                    (reschedule . "Rescheduled from %S on %t")
                                    (delschedule . "Not scheduled, was %S on %t")
                                    (redeadline . "New deadline from %S on %t")
                                    (deldeadline . "Removed deadline, was %S on %t")
                                    (refile . "Refiled on %t")
                                    (clock-out . "")))
    #+end_src
*** habits
    #+begin_src emacs-lisp
      (add-to-list 'org-modules 'org-habit t)
      (setq org-habit-preceeding-days 7)
      (setq org-habit-following-days 3)
      (setq org-habit-graph-column 80)
      (setq org-habit-show-habits-only-for-today nil)
      (setq org-treat-insert-todo-heading-as-state-change t)
    #+end_src
*** Todos and tags
    #+begin_src emacs-lisp
      (setq org-todo-keywords
            '((sequence "TODO(t!)"
                        "PROG(p@/!)"
                        "WAITING(w@/!)"
                        "NEXT(n@/!)"
                        "MAYBE(m!)"
                        "|"
                        "DONE(d!)"
                        "CANCELLED(c@/!)")))

      (setq org-todo-keyword-faces
            '(("TODO" . (:foreground "#dc322f" :weight bold))
              ("PROG" . (:foreground "#b58900"))
              ("WAITING" . (:foreground "#859900"))
              ("DONE" . (:foreground "#2aa198"))
              ("MAYBE" . (:foreground "#FF2AFC"))
              ("CANCELLED" . (:foreground "#657b83"))))
      (setq org-complete-tags-always-offer-all-agenda-tags nil)
    #+end_src
*** Attach
    #+begin_src emacs-lisp
      (setq org-attach-directory (expand-file-name "data" org-directory))
      (setq org-attach-dir-relative t)
      (setq org-attach-archive-delete 'query)
      (add-hook 'dired-mode-hook
                (lambda ()
                  (define-key dired-mode-map
                    (kbd "C-c C-x a")
                    #'org-attach-dired-to-subtree)))
    #+end_src
*** Global keybindings
    #+begin_src emacs-lisp
      (global-set-key (kbd "C-c l") 'org-store-link)
      (global-set-key (kbd "C-c a") 'org-agenda)
      (global-set-key (kbd "C-c c") 'org-capture)
    #+end_src
*** babel
    see [[https://www.gnu.org/software/emacs/manual/html_node/org/Languages.html][here]] for available languages.
    #+begin_src emacs-lisp
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (awk . t)
         (C . t)
         (css . t)
         (calc . t)
         (screen . t)
         (dot . t )
         (haskell . t)
         (java . t)
         (js . t)
         (latex . t)
         (lisp . t)
         (lua . t)
         (org . t)
         (perl . t)
         (python .t)
         (ruby . t)
         (shell . t)
         (sed . t)
         (scheme . t)
         (sql . t)
         (sqlite . t)))
    #+end_src
*** org-agenda
    #+begin_src emacs-lisp
      (require 'org-agenda)
      (setq org-agenda-span 'day)
      (setq org-agenda-window-setup (quote current-window))
      (setq org-agenda-skip-deadlines-if-done t)
      (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
      (setq org-agenda-custom-commands
            `(("d" "Dashboard"
               ((agenda "" ((org-deadline-warning-days 3)))
                (tags-todo "+habit+TODO=\"TODO\"" ((org-agenda-overriding-header "Routine")))
                (tags-todo "{project*}-TODO=\"DONE\"-TODO=\"SOMEDAY\"-TODO=\"LEARN\""
                           ((org-agenda-overriding-header "Projects:")))
                (tags-todo "+followup" ((org-agenda-overriding-header "Needs Follow Up")))
                (tags "+TODO=\"NEXT\"+learning+" ((org-agenda-overriding-header "Learning:")))
                (alltodo ""
                         ((org-agenda-overriding-header "Inbox")))
                (tags-todo "TODO=\"TODO\"-project-reading-errands-video"
                           ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                            (org-agenda-skip-function
                             `(org-agenda-skip-entry-if
                               'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
                            (org-agenda-prefix-format "%-6e ")
                            (org-agenda-max-entries nil)
                            (org-agenda-overriding-header "Unscheduled TODO entries: ")
                            (org-agenda-sorting-strategy '(priority-down effort-up tag-up category-keep))))))))
      (setq org-agenda-include-diary t)
      (setq org-clock-persist 'history)
      (org-clock-persistence-insinuate)
      (setq org-global-properties '(("Effort_ALL". "0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 6:00 8:00")))
      (setq org-columns-default-format '"%38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM(Clock)")
    #+end_src
