posts/Emacs-Configuration.html
<div id="outline-container-org5764991" class="outline-4">
<h4 id="org5764991">Sets the defaults directories</h4>
<div class="outline-text-4" id="text-org5764991">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-default-notes-file
      (expand-file-name +org-capture-notes-file org-directory)
      +org-capture-links-file
      (expand-file-name +org-capture-links-file org-directory)
      +org-capture-projects-file
      (expand-file-name +org-capture-projects-file org-directory)
      +org-capture-habits-file
      (expand-file-name +org-capture-habits-file org-directory))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1425080" class="outline-4">
<h4 id="org1425080">Logging</h4>
<div class="outline-text-4" id="text-org1425080">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-log-done 'time
      org-log-refile 'time
      org-log-redeadline 'time
      org-log-note-clock-out t
      org-log-into-drawer t
      org-log-note-headings '((done . <span class="org-string">"CLOSING NOTE %t"</span>)
                              (state . <span class="org-string">"State %-12s from %-12S %t"</span>)
                              (note . <span class="org-string">"Note taken on %t"</span>)
                              (reschedule . <span class="org-string">"Rescheduled from %S on %t"</span>)
                              (delschedule . <span class="org-string">"Not scheduled, was %S on %t"</span>)
                              (redeadline . <span class="org-string">"New deadline from %S on %t"</span>)
                              (deldeadline . <span class="org-string">"Removed deadline, was %S on %t"</span>)
                              (refile . <span class="org-string">"Refiled on %t"</span>)
                              (clock-out . <span class="org-string">""</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga87b037" class="outline-4">
<h4 id="orga87b037">habits</h4>
<div class="outline-text-4" id="text-orga87b037">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'org-modules 'org-habit t)
(<span class="org-keyword">setq</span> org-habit-preceeding-days 7)
(<span class="org-keyword">setq</span> org-habit-following-days 3)
(<span class="org-keyword">setq</span> org-habit-graph-column 80)
(<span class="org-keyword">setq</span> org-habit-show-habits-only-for-today nil)
(<span class="org-keyword">setq</span> org-treat-insert-todo-heading-as-state-change t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org24eeb25" class="outline-4">
<h4 id="org24eeb25">Todos and tags</h4>
<div class="outline-text-4" id="text-org24eeb25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-todo-keywords
      '((sequence <span class="org-string">"TODO(t!)"</span>
                  <span class="org-string">"PROG(p@/!)"</span>
                  <span class="org-string">"WAITING(w@/!)"</span>
                  <span class="org-string">"NEXT(n@/!)"</span>
                  <span class="org-string">"MAYBE(m!)"</span>
                  <span class="org-string">"|"</span>
                  <span class="org-string">"DONE(d!)"</span>
                  <span class="org-string">"CANCELLED(c@/!)"</span>)))

(<span class="org-keyword">setq</span> org-todo-keyword-faces
      '((<span class="org-string">"TODO"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#dc322f"</span> <span class="org-builtin">:weight</span> bold))
        (<span class="org-string">"PROG"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#b58900"</span>))
        (<span class="org-string">"WAITING"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#859900"</span>))
        (<span class="org-string">"DONE"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#2aa198"</span>))
        (<span class="org-string">"MAYBE"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#FF2AFC"</span>))
        (<span class="org-string">"CANCELLED"</span> . (<span class="org-builtin">:foreground</span> <span class="org-string">"#657b83"</span>))))
(<span class="org-keyword">setq</span> org-complete-tags-always-offer-all-agenda-tags nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge37d63d" class="outline-4">
<h4 id="orge37d63d">Attach</h4>
<div class="outline-text-4" id="text-orge37d63d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-attach-directory (expand-file-name <span class="org-string">"data"</span> org-directory))
(<span class="org-keyword">setq</span> org-attach-dir-relative t)
(<span class="org-keyword">setq</span> org-attach-archive-delete 'query)
(add-hook 'dired-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (define-key dired-mode-map
              (kbd <span class="org-string">"C-c C-x a"</span>)
              #'org-attach-dired-to-subtree)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8362a96" class="outline-4">
<h4 id="org8362a96">Global keybindings</h4>
<div class="outline-text-4" id="text-org8362a96">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c l"</span>) 'org-store-link)
(global-set-key (kbd <span class="org-string">"C-c a"</span>) 'org-agenda)
(global-set-key (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4478d48" class="outline-4">
<h4 id="org4478d48">babel</h4>
<div class="outline-text-4" id="text-org4478d48">
<p>
see <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Languages.html">here</a> for available languages.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (awk . t)
   (C . t)
   (css . t)
   (calc . t)
   (screen . t)
   (dot . t )
   (haskell . t)
   (java . t)
   (js . t)
   (latex . t)
   (lisp . t)
   (lua . t)
   (org . t)
   (perl . t)
   (python .t)
   (ruby . t)
   (shell . t)
   (sed . t)
   (scheme . t)
   (sql . t)
   (sqlite . t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org32d7236" class="outline-4">
<h4 id="org32d7236">org-agenda</h4>
<div class="outline-text-4" id="text-org32d7236">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-agenda</span>)
(<span class="org-keyword">setq</span> org-agenda-span 'day)
(<span class="org-keyword">setq</span> org-agenda-window-setup (<span class="org-keyword">quote</span> current-window))
(<span class="org-keyword">setq</span> org-agenda-skip-deadlines-if-done t)
(<span class="org-keyword">setq</span> org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
(<span class="org-keyword">setq</span> org-agenda-custom-commands
      `((<span class="org-string">"d"</span> <span class="org-string">"Dashboard"</span>
         ((agenda <span class="org-string">""</span> ((org-deadline-warning-days 3)))
          (tags-todo <span class="org-string">"+habit+TODO=\"TODO\""</span> ((org-agenda-overriding-header <span class="org-string">"Routine"</span>)))
          (tags-todo <span class="org-string">"{project*}-TODO=\"DONE\"-TODO=\"SOMEDAY\"-TODO=\"LEARN\""</span>
                     ((org-agenda-overriding-header <span class="org-string">"Projects:"</span>)))
          (tags-todo <span class="org-string">"+followup"</span> ((org-agenda-overriding-header <span class="org-string">"Needs Follow Up"</span>)))
          (tags <span class="org-string">"+TODO=\"NEXT\"+learning+"</span> ((org-agenda-overriding-header <span class="org-string">"Learning:"</span>)))
          (alltodo <span class="org-string">""</span>
                   ((org-agenda-overriding-header <span class="org-string">"Inbox"</span>)))
          (tags-todo <span class="org-string">"TODO=\"TODO\"-project-reading-errands-video"</span>
                     ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                      (org-agenda-skip-function
                       `(org-agenda-skip-entry-if
                         'notregexp ,(format <span class="org-string">"\\[#%s\\]"</span> (char-to-string org-priority-highest))))
                      (org-agenda-prefix-format <span class="org-string">"%-6e "</span>)
                      (org-agenda-max-entries nil)
                      (org-agenda-overriding-header <span class="org-string">"Unscheduled TODO entries: "</span>)
                      (org-agenda-sorting-strategy '(priority-down effort-up tag-up category-keep))))))))
(<span class="org-keyword">setq</span> org-agenda-include-diary t)
(<span class="org-keyword">setq</span> org-clock-persist 'history)
(org-clock-persistence-insinuate)
(<span class="org-keyword">setq</span> org-global-properties '((<span class="org-string">"Effort_ALL"</span>. <span class="org-string">"0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 6:00 8:00"</span>)))
(<span class="org-keyword">setq</span> org-columns-default-format '<span class="org-string">"%38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM(Clock)"</span>)
</pre>
</div>
</div>
</div>
