posts/Emacs-Configuration.org
*** refile and archive
    #+begin_src emacs-lisp
      (setq org-refile-targets
            '((org-agenda-files :maxlevel . 9)))
      (setq org-refile-use-cache t)
      (setq org-refile-use-outline-path 'file)
      (setq org-outline-path-complete-in-steps nil)
      (setq org-refile-allow-creating-parent-nodes 'confirm)
      (setq org-archive-location (concat +org-archives-file "::datetree/* Archived Tasks"))
      (advice-add 'org-refile :after 'org-save-all-org-buffers)
    #+end_src
*** stuck-projects
    #+begin_src emacs-lisp
      (setq org-stuck-projects
            '("+project/-MAYBE-DONE-SOMEDAY" ("TODO" "NEXT") nil ""))
    #+end_src
    This is a list of four items:
    1. A tags/todo/property matcher string that is used to identify a project.
       See the manual for a description of tag and property searches.
       The entire tree below a headline matched by this is considered one project.
    2. A list of TODO keywords identifying non-stuck projects.
       If the project subtree contains any headline with one of these todo
       keywords, the project is considered to be not stuck.  If you specify
       "*" as a keyword, any TODO keyword will mark the project unstuck.
    3. A list of tags identifying non-stuck projects.
       If the project subtree contains any headline with one of these tags,
       the project is considered to be not stuck.  If you specify "*" as
       a tag, any tag will mark the project unstuck.  Note that this is about
       the explicit presence of a tag somewhere in the subtree, inherited
       tags do not count here.  If inherited tags make a project not stuck,
       use "-TAG" in the tags part of the matcher under (1.) above.
    4. An arbitrary regular expression matching non-stuck projects.
*** move bookmark file to =+emacs-data-dir=
    #+begin_src emacs-lisp
      (setq bookmark-file (concat +emacs-data-dir "/bookmarks"))
    #+end_src
