posts/Emacs-Configuration.html
<div id="outline-container-orga55855e" class="outline-4">
<h4 id="orga55855e">refile and archive</h4>
<div class="outline-text-4" id="text-orga55855e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-refile-targets
      '((org-agenda-files <span class="org-builtin">:maxlevel</span> . 9)))
(<span class="org-keyword">setq</span> org-refile-use-cache t)
(<span class="org-keyword">setq</span> org-refile-use-outline-path 'file)
(<span class="org-keyword">setq</span> org-outline-path-complete-in-steps nil)
(<span class="org-keyword">setq</span> org-refile-allow-creating-parent-nodes 'confirm)
(<span class="org-keyword">setq</span> org-archive-location (concat +org-archives-file <span class="org-string">"::datetree/* Archived Tasks"</span>))
(advice-add 'org-refile <span class="org-builtin">:after</span> 'org-save-all-org-buffers)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd5cdc7b" class="outline-4">
<h4 id="orgd5cdc7b">stuck-projects</h4>
<div class="outline-text-4" id="text-orgd5cdc7b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-stuck-projects
      '(<span class="org-string">"+project/-MAYBE-DONE-SOMEDAY"</span> (<span class="org-string">"TODO"</span> <span class="org-string">"NEXT"</span>) nil <span class="org-string">""</span>))
</pre>
</div>
<p>
This is a list of four items:
</p>
<ol class="org-ol">
<li>A tags/todo/property matcher string that is used to identify a project.
See the manual for a description of tag and property searches.
The entire tree below a headline matched by this is considered one project.</li>
<li>A list of TODO keywords identifying non-stuck projects.
If the project subtree contains any headline with one of these todo
keywords, the project is considered to be not stuck.  If you specify
&ldquo;*&rdquo; as a keyword, any TODO keyword will mark the project unstuck.</li>
<li>A list of tags identifying non-stuck projects.
If the project subtree contains any headline with one of these tags,
the project is considered to be not stuck.  If you specify &ldquo;*&rdquo; as
a tag, any tag will mark the project unstuck.  Note that this is about
the explicit presence of a tag somewhere in the subtree, inherited
tags do not count here.  If inherited tags make a project not stuck,
use &ldquo;-TAG&rdquo; in the tags part of the matcher under (1.) above.</li>
<li>An arbitrary regular expression matching non-stuck projects.</li>
</ol>
</div>
</div>
<div id="outline-container-org32d8120" class="outline-4">
<h4 id="org32d8120">move bookmark file to <code>+emacs-data-dir</code></h4>
<div class="outline-text-4" id="text-org32d8120">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> bookmark-file (concat +emacs-data-dir <span class="org-string">"/bookmarks"</span>))
</pre>
</div>
</div>
</div>
