posts/Emacs-Configuration.org
*** capture-templates
    #+begin_src emacs-lisp
        (setq org-capture-templates
              '(("t" "Personal (t)Tasks")
                ("tt" "(t)todo" entry
                 (file+headline +org-capture-todo-file "Inbox")
                 "** TODO [#A] %? %^G:followup:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom\t\"\"\t%U\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("ts" "(p)In Progress Tasks" entry
                 (file+headline +org-capture-todo-file "Inbox")
                 "** PROG [#B] %? %^G:followup:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"PROG\"\tfrom\t\"\"\t%U\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("tn" "(n)Notes" entry
                 (file+headline +org-capture-notes-file "Notes")
                 "** %? %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"
                 :empty-line 1
                 :jump-to-captured t)
                ("te" "(e)Next" entry
                 (file+headline +org-capture-todo-file "Inbox")
                 "** NEXT %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"
                 :empty-line 1
                 :jump-to-captured t)
                ("ti" "(I)Ideas" entry
                 (file+headline +org-capture-notes-file "Ideas")
                 "** MAYBE %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"
                 :empty-line 1
                 :jump-to-captured t)
                ("th" "(h)Habit" entry
                 (file+headline +org-capture-habits-file "Recurring")
                 "** TODO [#C] %? %^G:habit:\n SCHEDULED: %^t\n:PROPERTIES:\n:Style: habit\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"
                 :empty-line 1
                 :jump-to-captured t)
                ("td" "(d)Done" entry
                 (file+headline +org-capture-notes-file "Inbox")
                 "** DONE %?\nCLOSED: %U\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"DONE\"\tfrom \"\"\t%U\n:END:"
                 :empty-lines 1
                 :jump-to-captured t)
                ("p" "Project")
                ("pt" "Project (t)todo" entry
                 (file+headline +org-capture-projects-file "Inbox")
                 "** TODO [#A] %? %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("pe" "project (e)Next" entry
                 (file+headline +org-capture-projects-file "Inbox")
                 "** NEXT %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("pn" "project (n)Note" entry
                 (file+headline +org-capture-projects-file "Notes")
                 "** %? %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("pi" "project ()Ideas" entry
                 (file+headline +org-capture-projects-file "Ideas")
                 "** MAYBE %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"
                 :empty-line 1
                 :clock-in t
                 :clock-resume t
                 :jump-to-captured t)
                ("o" "org-protocol")
                ("ot" "org-protocol TODO(t)"
                 entry (file+headline +org-capture-todo-file "Inbox")
                 "** TODO %?\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"
                 :empty-lines 1
                 :jump-to-captured t)
                ("ol" "org-protocol Links(l)"
                 entry (file+headline +org-capture-links-file "Links")
                 "** %a %^G:website:\n\n%U\n\n%:initial %?"
                 :jump-to-capture t)
                ("j" "Journal")
                ("jt" "Journal Today" plain (function +org-journal-find-location)
                 "** %(format-time-string org-journal-time-format)%^{Title}\n%i%?"
                 :jump-to-captured t
                 :immediate-finish t)
                ("js" "Scheduled Journal" plain (function +org-journal-date-location)
                 "** TODO %?\n <%(princ +org-journal--date-location-scheduled-time)>\n"
                 :jump-to-captured t)
                )
              org-capture-default-templates "tt")
        (add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)
      #+end_src
*** Additional org packages
    This will be stored in each individual files.
