posts/Emacs-Configuration.html
<div id="outline-container-orgd3a3c42" class="outline-4">
<h4 id="orgd3a3c42">capture-templates</h4>
<div class="outline-text-4" id="text-orgd3a3c42">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-capture-templates
      '((<span class="org-string">"t"</span> <span class="org-string">"Personal (t)Tasks"</span>)
        (<span class="org-string">"tt"</span> <span class="org-string">"(t)todo"</span> entry
         (file+headline +org-capture-todo-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** TODO [#A] %? %^G:followup:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom\t\"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"ts"</span> <span class="org-string">"(p)In Progress Tasks"</span> entry
         (file+headline +org-capture-todo-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** PROG [#B] %? %^G:followup:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"PROG\"\tfrom\t\"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"tn"</span> <span class="org-string">"(n)Notes"</span> entry
         (file+headline +org-capture-notes-file <span class="org-string">"Notes"</span>)
         <span class="org-string">"** %? %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"te"</span> <span class="org-string">"(e)Next"</span> entry
         (file+headline +org-capture-todo-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** NEXT %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"ti"</span> <span class="org-string">"(I)Ideas"</span> entry
         (file+headline +org-capture-notes-file <span class="org-string">"Ideas"</span>)
         <span class="org-string">"** MAYBE %^G\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"th"</span> <span class="org-string">"(h)Habit"</span> entry
         (file+headline +org-capture-habits-file <span class="org-string">"Recurring"</span>)
         <span class="org-string">"** TODO [#C] %? %^G:habit:\n SCHEDULED: %^t\n:PROPERTIES:\n:Style: habit\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"td"</span> <span class="org-string">"(d)Done"</span> entry
         (file+headline +org-capture-notes-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** DONE %?\nCLOSED: %U\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"DONE\"\tfrom \"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-lines</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"p"</span> <span class="org-string">"Project"</span>)
        (<span class="org-string">"pt"</span> <span class="org-string">"Project (t)todo"</span> entry
         (file+headline +org-capture-projects-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** TODO [#A] %? %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"pe"</span> <span class="org-string">"project (e)Next"</span> entry
         (file+headline +org-capture-projects-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** NEXT %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"pn"</span> <span class="org-string">"project (n)Note"</span> entry
         (file+headline +org-capture-projects-file <span class="org-string">"Notes"</span>)
         <span class="org-string">"** %? %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"pi"</span> <span class="org-string">"project ()Ideas"</span> entry
         (file+headline +org-capture-projects-file <span class="org-string">"Ideas"</span>)
         <span class="org-string">"** MAYBE %^G:project:\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n:END:"</span>
         <span class="org-builtin">:empty-line</span> 1
         <span class="org-builtin">:clock-in</span> t
         <span class="org-builtin">:clock-resume</span> t
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"o"</span> <span class="org-string">"org-protocol"</span>)
        (<span class="org-string">"ot"</span> <span class="org-string">"org-protocol TODO(t)"</span>
         entry (file+headline +org-capture-todo-file <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** TODO %?\n:PROPERTIES:\n:Via: %a\n:Note:\n:END:\n:LOGBOOK:\n- State \"TODO\"\tfrom \"\"\t%U\n:END:"</span>
         <span class="org-builtin">:empty-lines</span> 1
         <span class="org-builtin">:jump-to-captured</span> t)
        (<span class="org-string">"ol"</span> <span class="org-string">"org-protocol Links(l)"</span>
         entry (file+headline +org-capture-links-file <span class="org-string">"Links"</span>)
         <span class="org-string">"** %a %^G:website:\n\n%U\n\n%:initial %?"</span>
         <span class="org-builtin">:jump-to-capture</span> t)
        (<span class="org-string">"j"</span> <span class="org-string">"Journal"</span>)
        (<span class="org-string">"jt"</span> <span class="org-string">"Journal Today"</span> plain (<span class="org-keyword">function</span> +org-journal-find-location)
         <span class="org-string">"** %(format-time-string org-journal-time-format)%^{Title}\n%i%?"</span>
         <span class="org-builtin">:jump-to-captured</span> t
         <span class="org-builtin">:immediate-finish</span> t)
        (<span class="org-string">"js"</span> <span class="org-string">"Scheduled Journal"</span> plain (<span class="org-keyword">function</span> +org-journal-date-location)
         <span class="org-string">"** TODO %?\n &lt;%(princ +org-journal--date-location-scheduled-time)&gt;\n"</span>
         <span class="org-builtin">:jump-to-captured</span> t)
        )
      org-capture-default-templates <span class="org-string">"tt"</span>)
(add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d32a27" class="outline-4">
<h4 id="org0d32a27">Additional org packages</h4>
<div class="outline-text-4" id="text-org0d32a27">
<p>
This will be stored in each individual files.
</p>
</div>
<ul class="org-ul">
