posts/Emacs-Configuration.org
**** org-roam
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-org-roam.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-org-roam.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'org-roam)
         (straight-use-package 'org-roam-ui))
       (customize-set-variable 'org-roam-db-location (expand-file-name "org-roam.db" +emacs-data-dir))
       (add-hook 'org-roam-backlinks-mode 'turn-on-visual-line-mode)
       (setq org-roam-directory
             (file-name-as-directory
              (file-truename
               (expand-file-name "roam" org-directory)))
             org-roam-completion-everywhere t
             org-roam-mode-section-functions
             #'(org-roam-backlinks-section
                org-roam-reflinks-section))
       (unless (file-directory-p org-roam-directory)
         (make-directory org-roam-directory :parents))
       (org-roam-db-autosync-mode)
       (require 'org-roam-dailies)
       (setq org-roam-dailies-directory
             (file-name-as-directory
              (file-truename
               (expand-file-name "daily" org-roam-directory))))
       (require 'org-roam-graph)
       (setq org-roam-node-display-template
             (concat "${title:*} "
                     (propertize "${tags:10}" 'face 'org-tag)))

       (add-to-list 'display-buffer-alist
                    '("\\*org-roam\\*"
                      (display-buffer-in-side-window)
                      (side . right)
                      (slot . 0)
                      (window-width . 0.33)
                      (window-parameters . ((no-other-window . t)
                                            (no-delete-other-windows . t)))))
       (unless +config/is-guix-system
         (setq org-roam-ui-sync-theme t
               org-roam-ui-follow t
               org-roam-ui-update-on-save t
               org-roam-ui-open-on-start t))
       (if (and (fboundp 'server-running-p)
                (not (server-running-p)))
           (server-start))
       (require 'org-protocol)
       (require 'org-roam-protocol)
       (setq org-roam-capture-templates
             (quote (("d" "default" plain
                      "* ${title}\n%?" :if-new
                      (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                 "#+title: ${title}\n#+filetags:\n#+date: %<%Y-%m-%d>\n\n")
                      :unnarrowed t)
                     )))
       (setq org-roam-capture-ref-templates
             (quote (("r" "ref" plain
                      "%?"
                      :if-new (file+head
                               "%(format-time-string \"%Y-%m-%d--%H-%M-%SZ--${slug}.org\" (current-time) t)"
                               "#+title: ${title}\n#+filetags:\n#+date: %<%Y-%m-%d>\n\n")
                      :unnarrowed t :jump-to-captured t))))
       (setq org-roam-dailies-capture-templates
             (quote (("d" "Default" plain
                      "%?"
                      :if-new (file+head
                               "%(format-time-string \"%Y-%m-%d--journal.org\" (current-time) t)"
                               "#+title: Journal %<%Y-%m-%d>\n#+date: %<%Y-%m-%d>\n#+journal: private journal\n\n\n")
                      :unnarrowed t))))
     #+end_src
***** Keybindings
      #+begin_src emacs-lisp
        (global-set-key (kbd "C-c r i") 'org-roam-node-insert)
        (global-set-key (kbd "C-c r f") 'org-roam-node-find)
        (global-set-key (kbd "C-c r c") 'org-roam-capture)
        (global-set-key (kbd "C-c r b") 'org-roam-buffer-toggle)
        (global-set-key (kbd "C-c r B") 'org-roam-buffer-display-dedicated)
        (global-set-key (kbd "C-c r s") 'org-roam-db-sync)
      #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-org-roam)
        ;;; config-org-roam.el ends here
      #+end_src
**** org-elfeed
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-org-elfeed.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-org-elfeed.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'elfeed)
         (straight-use-package 'elfeed-org))

       (require 'elfeed)
       (setq rmh-elfeed-org-files (list (concat org-directory "/elfeed.org")))
       (eval-after-load 'elfeed
         `(make-directory ,(expand-file-name "elfeed/" +emacs-data-dir) t))
       (setq elfeed-db-directory (expand-file-name "elfeed/db/" +emacs-data-dir))
       (setq elfeed-enclosure-default-dir (expand-file-name "elfeed/enclosures/" +emacs-data-dir))
       (setq elfeed-score-score-file (expand-file-name "elfeed/score/score.el" +emacs-data-dir))
       (elfeed-org)
     #+end_src
