posts/Emacs-Configuration.html
<li><a id="org4dd9b2b"></a>org-roam<br>
<div class="outline-text-5" id="text-org4dd9b2b">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-org-roam.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-roam.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'org-roam)
  (straight-use-package 'org-roam-ui))
(customize-set-variable 'org-roam-db-location (expand-file-name <span class="org-string">"org-roam.db"</span> +emacs-data-dir))
(add-hook 'org-roam-backlinks-mode 'turn-on-visual-line-mode)
(<span class="org-keyword">setq</span> org-roam-directory
      (file-name-as-directory
       (file-truename
        (expand-file-name <span class="org-string">"roam"</span> org-directory)))
      org-roam-completion-everywhere t
      org-roam-mode-section-functions
      #'(org-roam-backlinks-section
         org-roam-reflinks-section))
(<span class="org-keyword">unless</span> (file-directory-p org-roam-directory)
  (make-directory org-roam-directory <span class="org-builtin">:parents</span>))
(org-roam-db-autosync-mode)
(<span class="org-keyword">require</span> '<span class="org-constant">org-roam-dailies</span>)
(<span class="org-keyword">setq</span> org-roam-dailies-directory
      (file-name-as-directory
       (file-truename
        (expand-file-name <span class="org-string">"daily"</span> org-roam-directory))))
(<span class="org-keyword">require</span> '<span class="org-constant">org-roam-graph</span>)
(<span class="org-keyword">setq</span> org-roam-node-display-template
      (concat <span class="org-string">"${title:*} "</span>
              (propertize <span class="org-string">"${tags:10}"</span> 'face 'org-tag)))

(add-to-list 'display-buffer-alist
             '(<span class="org-string">"\\*org-roam\\*"</span>
               (display-buffer-in-side-window)
               (side . right)
               (slot . 0)
               (window-width . 0.33)
               (window-parameters . ((no-other-window . t)
                                     (no-delete-other-windows . t)))))
(<span class="org-keyword">unless</span> +config/is-guix-system
  (<span class="org-keyword">setq</span> org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
(<span class="org-keyword">if</span> (<span class="org-keyword">and</span> (fboundp 'server-running-p)
         (not (server-running-p)))
    (server-start))
(<span class="org-keyword">require</span> '<span class="org-constant">org-protocol</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">org-roam-protocol</span>)
(<span class="org-keyword">setq</span> org-roam-capture-templates
      (<span class="org-keyword">quote</span> ((<span class="org-string">"d"</span> <span class="org-string">"default"</span> plain
               <span class="org-string">"* ${title}\n%?"</span> <span class="org-builtin">:if-new</span>
               (file+head <span class="org-string">"%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                          <span class="org-string">"#+title: ${title}\n#+filetags:\n#+date: %&lt;%Y-%m-%d&gt;\n\n"</span>)
               <span class="org-builtin">:unnarrowed</span> t)
              )))
(<span class="org-keyword">setq</span> org-roam-capture-ref-templates
      (<span class="org-keyword">quote</span> ((<span class="org-string">"r"</span> <span class="org-string">"ref"</span> plain
               <span class="org-string">"%?"</span>
               <span class="org-builtin">:if-new</span> (file+head
                        <span class="org-string">"%(format-time-string \"%Y-%m-%d--%H-%M-%SZ--${slug}.org\" (current-time) t)"</span>
                        <span class="org-string">"#+title: ${title}\n#+filetags:\n#+date: %&lt;%Y-%m-%d&gt;\n\n"</span>)
               <span class="org-builtin">:unnarrowed</span> t <span class="org-builtin">:jump-to-captured</span> t))))
(<span class="org-keyword">setq</span> org-roam-dailies-capture-templates
      (<span class="org-keyword">quote</span> ((<span class="org-string">"d"</span> <span class="org-string">"Default"</span> plain
               <span class="org-string">"%?"</span>
               <span class="org-builtin">:if-new</span> (file+head
                        <span class="org-string">"%(format-time-string \"%Y-%m-%d--journal.org\" (current-time) t)"</span>
                        <span class="org-string">"#+title: Journal %&lt;%Y-%m-%d&gt;\n#+date: %&lt;%Y-%m-%d&gt;\n#+journal: private journal\n\n\n"</span>)
               <span class="org-builtin">:unnarrowed</span> t))))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org2c8b60a"></a>Keybindings<br>
<div class="outline-text-6" id="text-org2c8b60a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c r i"</span>) 'org-roam-node-insert)
(global-set-key (kbd <span class="org-string">"C-c r f"</span>) 'org-roam-node-find)
(global-set-key (kbd <span class="org-string">"C-c r c"</span>) 'org-roam-capture)
(global-set-key (kbd <span class="org-string">"C-c r b"</span>) 'org-roam-buffer-toggle)
(global-set-key (kbd <span class="org-string">"C-c r B"</span>) 'org-roam-buffer-display-dedicated)
(global-set-key (kbd <span class="org-string">"C-c r s"</span>) 'org-roam-db-sync)
</pre>
</div>
</div>
</li>
<li><a id="org8d30e26"></a>Footer<br>
<div class="outline-text-6" id="text-org8d30e26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-org-roam</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-roam.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgb374a41"></a>org-elfeed<br>
<div class="outline-text-5" id="text-orgb374a41">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-org-elfeed.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-elfeed.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'elfeed)
  (straight-use-package 'elfeed-org))

(<span class="org-keyword">require</span> '<span class="org-constant">elfeed</span>)
(<span class="org-keyword">setq</span> rmh-elfeed-org-files (list (concat org-directory <span class="org-string">"/elfeed.org"</span>)))
(eval-after-load 'elfeed
  `(make-directory ,(expand-file-name <span class="org-string">"elfeed/"</span> +emacs-data-dir) t))
(<span class="org-keyword">setq</span> elfeed-db-directory (expand-file-name <span class="org-string">"elfeed/db/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> elfeed-enclosure-default-dir (expand-file-name <span class="org-string">"elfeed/enclosures/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> elfeed-score-score-file (expand-file-name <span class="org-string">"elfeed/score/score.el"</span> +emacs-data-dir))
(elfeed-org)
</pre>
</div>
</div>
<ul class="org-ul">
