posts/Emacs-Configuration.org
***** elfeed notification
      #+begin_src emacs-lisp
        (defvar +config/elfeed-update-complete-hook nil
          "Functions called with no arguments when `elfeed-update' is finished.")

        (defvar +config/elfeed-updates-in-progress 0
          "Number of feed updates in-progress.")

        (defvar +config/elfeed-search-update-filter nil
          "The filter when `elfeed-update' is called.")

        (defun +config/elfeed-update-complete-hook (&rest ignore)
          "When update queue is empty, run `+config/elfeed-update-complete-hook' functions."
          (when (= 0 +config/elfeed-updates-in-progress)
            (run-hooks '+config/elfeed-update-complete-hook)))

        (add-hook 'elfeed-update-hooks #'+config/elfeed-update-complete-hook)

        (defun +config/elfeed-update-message-completed (&rest _ignore)
          (message "Feeds updated")
          (notifications-notify :title "Elfeed" :body "Feeds updated."))

        (add-hook '+config/elfeed-update-complete-hook #'+config/elfeed-update-message-completed)

        (defun +config/elfeed-search-update-restore-filter (&rest ignore)
          "Restore filter after feeds update."
          (when +config/elfeed-search-update-filter
            (elfeed-search-set-filter +config/elfeed-search-update-filter)
            (setq +config/elfeed-search-update-filter nil)))

        (add-hook '+config/elfeed-update-complete-hook #'+config/elfeed-search-update-restore-filter)

        (defun +config/elfeed-search-update-save-filter (&rest ignore)
          "Save and change the filter while updating."
          (setq +config/elfeed-search-update-filter elfeed-search-filter)
          (setq elfeed-search-filter "#0"))

        ;; NOTE: It would be better if this hook were run before starting the feed updates, but in
        ;; `elfeed-update', it happens afterward.
        (add-hook 'elfeed-update-init-hooks #'+config/elfeed-search-update-save-filter)

        (defun +config/elfeed-update-counter-inc (&rest ignore)
          (cl-incf +config/elfeed-updates-in-progress))

        (advice-add #'elfeed-update-feed :before #'+config/elfeed-update-counter-inc)

        (defun +config/elfeed-update-counter-dec (&rest ignore)
          (cl-decf +config/elfeed-updates-in-progress)
          (when (< +config/elfeed-updates-in-progress 0)
            ;; Just in case
            (setq +config/elfeed-updates-in-progress 0)))

        (add-hook 'elfeed-update-hooks #'+config/elfeed-update-counter-dec)
      #+end_src
***** Keybinding
      #+begin_src emacs-lisp
        (global-set-key (kbd "C-c e e") 'elfeed)
      #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-org-elfeed)
        ;;; config-org-elfeed.el ends here
      #+end_src
**** org-gcal
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-org-gcal.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-org-gcal.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'org-gcal)

       (require 'config-pass)
       (with-eval-after-load 'pass
         (require 'org-gcal)
         (setq org-gcal-dir (expand-file-name "org/gcal/" +emacs-data-dir))
         (setq org-gcal-client-id (password-store-get "console.cloud.google.com/gcal/id"))
         (setq org-gcal-client-secret (password-store-get "console.cloud.google.com/gcal/secret")))
     #+end_src
***** Keybinding
      #+begin_src emacs-lisp
        (global-set-key (kbd "C-c g s") 'org-gcal-sync)
        (global-set-key (kbd "C-c g f") 'org-gcal-fetch)
      #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-org-gcal)
        ;;; config-org-gcal.el ends here
      #+end_src
