posts/Emacs-Configuration.html
<li><a id="org93a406d"></a>elfeed notification<br>
<div class="outline-text-6" id="text-org93a406d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+config/elfeed-update-complete-hook</span> nil
  <span class="org-doc">"Functions called with no arguments when `</span><span class="org-doc"><span class="org-constant">elfeed-update</span></span><span class="org-doc">' is finished."</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+config/elfeed-updates-in-progress</span> 0
  <span class="org-doc">"Number of feed updates in-progress."</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+config/elfeed-search-update-filter</span> nil
  <span class="org-doc">"The filter when `</span><span class="org-doc"><span class="org-constant">elfeed-update</span></span><span class="org-doc">' is called."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-update-complete-hook</span> (<span class="org-type">&amp;rest</span> ignore)
  <span class="org-doc">"When update queue is empty, run `</span><span class="org-doc"><span class="org-constant">+config/elfeed-update-complete-hook</span></span><span class="org-doc">' functions."</span>
  (<span class="org-keyword">when</span> (= 0 +config/elfeed-updates-in-progress)
    (run-hooks '+config/elfeed-update-complete-hook)))

(add-hook 'elfeed-update-hooks #'+config/elfeed-update-complete-hook)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-update-message-completed</span> (<span class="org-type">&amp;rest</span> _ignore)
  (message <span class="org-string">"Feeds updated"</span>)
  (notifications-notify <span class="org-builtin">:title</span> <span class="org-string">"Elfeed"</span> <span class="org-builtin">:body</span> <span class="org-string">"Feeds updated."</span>))

(add-hook '+config/elfeed-update-complete-hook #'+config/elfeed-update-message-completed)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-search-update-restore-filter</span> (<span class="org-type">&amp;rest</span> ignore)
  <span class="org-doc">"Restore filter after feeds update."</span>
  (<span class="org-keyword">when</span> +config/elfeed-search-update-filter
    (elfeed-search-set-filter +config/elfeed-search-update-filter)
    (<span class="org-keyword">setq</span> +config/elfeed-search-update-filter nil)))

(add-hook '+config/elfeed-update-complete-hook #'+config/elfeed-search-update-restore-filter)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-search-update-save-filter</span> (<span class="org-type">&amp;rest</span> ignore)
  <span class="org-doc">"Save and change the filter while updating."</span>
  (<span class="org-keyword">setq</span> +config/elfeed-search-update-filter elfeed-search-filter)
  (<span class="org-keyword">setq</span> elfeed-search-filter <span class="org-string">"#0"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">NOTE: It would be better if this hook were run before starting the feed updates, but in</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">elfeed-update</span></span><span class="org-comment">', it happens afterward.</span>
(add-hook 'elfeed-update-init-hooks #'+config/elfeed-search-update-save-filter)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-update-counter-inc</span> (<span class="org-type">&amp;rest</span> ignore)
  (<span class="org-keyword">cl-incf</span> +config/elfeed-updates-in-progress))

(advice-add #'elfeed-update-feed <span class="org-builtin">:before</span> #'+config/elfeed-update-counter-inc)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/elfeed-update-counter-dec</span> (<span class="org-type">&amp;rest</span> ignore)
  (<span class="org-keyword">cl-decf</span> +config/elfeed-updates-in-progress)
  (<span class="org-keyword">when</span> (&lt; +config/elfeed-updates-in-progress 0)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Just in case</span>
    (<span class="org-keyword">setq</span> +config/elfeed-updates-in-progress 0)))

(add-hook 'elfeed-update-hooks #'+config/elfeed-update-counter-dec)
</pre>
</div>
</div>
</li>
<li><a id="org0af6a3b"></a>Keybinding<br>
<div class="outline-text-6" id="text-org0af6a3b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c e e"</span>) 'elfeed)
</pre>
</div>
</div>
</li>
<li><a id="org6f64bac"></a>Footer<br>
<div class="outline-text-6" id="text-org6f64bac">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-org-elfeed</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-elfeed.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org25895aa"></a>org-gcal<br>
<div class="outline-text-5" id="text-org25895aa">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-org-gcal.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-gcal.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'org-gcal)

(<span class="org-keyword">defun</span> <span class="org-function-name">+config/org-gcal-setup-sync</span> (<span class="org-type">&amp;optional</span> dir id secret)
  <span class="org-doc">"Setup gcal with optional args DIR, ID and SECRET."</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">require</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">config-pass</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">org-gcal</span>)
  (<span class="org-keyword">if</span> dir
      (<span class="org-keyword">setq</span> org-gcal-dir dir)
    (<span class="org-keyword">setq</span> org-gcal-dir (expand-file-name <span class="org-string">"org/gcal/"</span> +emacs-data-dir)))
  (<span class="org-keyword">if</span> id
      (<span class="org-keyword">setq</span> org-gcal-client-id id)
    (<span class="org-keyword">setq</span> org-gcal-client-id (password-store-get <span class="org-string">"console.cloud.google.com/gcal/id"</span>)))
  (<span class="org-keyword">if</span> secret
      (<span class="org-keyword">setq</span> org-gcal-client-secret secret)
    (<span class="org-keyword">setq</span> org-gcal-client-secret (password-store-get <span class="org-string">"console.cloud.google.com/gcal/secret"</span>))))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org7a0fdb8"></a>Keybinding<br>
<div class="outline-text-6" id="text-org7a0fdb8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c g s"</span>) 'org-gcal-sync)
(global-set-key (kbd <span class="org-string">"C-c g f"</span>) 'org-gcal-fetch)
</pre>
</div>
</div>
</li>
