posts/Emacs-Configuration.org
**** org-journal
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-org-journal.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-org-journal.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'org-journal))
       (setq org-journal-dir (expand-file-name "journal" org-directory)
             org-journal-enable-agenda-integration t
             org-journale-enable-cache t
             org-journal-follow-mode t
             org-journal-prefix-key "C-c j")

       (defun +org-journal-find-location ()
         "Open today's journal, but specify a non-nil prefix argument in order to
         inhibit inserting the heading; org-capture will insert the heading."
         (org-journal-new-entry t)
         (unless (eq org-journal-file-type 'daily)
           (org-narrow-to-subtree))
         (goto-char (point-max)))

       (defvar +org-journal--date-location-scheduled-time nil)

       (defun +org-journal-date-location (&optional scheduled-time)
         (let ((scheduled-time (or scheduled-time (org-read-date nil nil nil "Date:"))))
           (setq +org-journal--date-location-scheduled-time scheduled-time)
           (org-journal-new-entry t (org-time-string-to-time scheduled-time))
           (unless (eq org-journal-file-type 'daily)
             (org-narrow-to-subtree))
           (goto-char (point-max))))

       (defun +org-journal-save-entry-and-exit()
         "Simple convenience function.
            Saves the buffer of the current day's entry and kills the window
            Similar to org-capture like behavior"
         (interactive)
         (save-buffer)
         (kill-buffer-and-window))

       (require 'org-journal)
       ;; this messes up org-clock
       ;;(define-key org-journal-mode-map (kbd "C-x C-s") '+org-journal-save-entry-and-exit)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-org-journal)
        ;;; config-org-gcal.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-org)
      ;;; config-defaults-org.el ends here
    #+end_src
** Default IDE
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-ide.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-ide.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
   #+end_src
*** Additional Package
**** flycheck
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-flycheck.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-flycheck.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'flycheck))
       (when (featurep 'consult)
           (straight-use-package 'consult-flycheck))
       (global-flycheck-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-flycheck)
        ;;; config-flycheck.el ends here
      #+end_src
**** projectile
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-projectile.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-projectile.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'projectile)
       (customize-set-variable 'projectile-cache-file (expand-file-name "projectile.cache" +emacs-data-dir))
       (customize-set-variable 'projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" +emacs-data-dir))
       (projectile-mode +1)
       (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-projectile)
        ;;; config-projectile.el ends here
      #+end_src
