posts/Emacs-Configuration.html
<li><a id="org597f5c7"></a>Footer<br>
<div class="outline-text-6" id="text-org597f5c7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-org-gcal</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-gcal.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org97e9b48"></a>org-journal<br>
<div class="outline-text-5" id="text-org97e9b48">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-org-journal.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-journal.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'org-journal))
(<span class="org-keyword">setq</span> org-journal-dir (expand-file-name <span class="org-string">"journal"</span> org-directory)
      org-journal-enable-agenda-integration t
      org-journale-enable-cache t
      org-journal-follow-mode t
      org-journal-prefix-key <span class="org-string">"C-c j"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-journal-find-location</span> ()
  <span class="org-doc">"Open today's journal, but specify a non-nil prefix argument in order to</span>
<span class="org-doc">  inhibit inserting the heading; org-capture will insert the heading."</span>
  (org-journal-new-entry t)
  (<span class="org-keyword">unless</span> (eq org-journal-file-type 'daily)
    (org-narrow-to-subtree))
  (goto-char (point-max)))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">+org-journal--date-location-scheduled-time</span> nil)

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-journal-date-location</span> (<span class="org-type">&amp;optional</span> scheduled-time)
  (<span class="org-keyword">let</span> ((scheduled-time (<span class="org-keyword">or</span> scheduled-time (org-read-date nil nil nil <span class="org-string">"Date:"</span>))))
    (<span class="org-keyword">setq</span> +org-journal--date-location-scheduled-time scheduled-time)
    (org-journal-new-entry t (org-time-string-to-time scheduled-time))
    (<span class="org-keyword">unless</span> (eq org-journal-file-type 'daily)
      (org-narrow-to-subtree))
    (goto-char (point-max))))

(<span class="org-keyword">defun</span> <span class="org-function-name">+org-journal-save-entry-and-exit</span>()
  <span class="org-doc">"Simple convenience function.</span>
<span class="org-doc">     Saves the buffer of the current day's entry and kills the window</span>
<span class="org-doc">     Similar to org-capture like behavior"</span>
  (<span class="org-keyword">interactive</span>)
  (save-buffer)
  (kill-buffer-and-window))

(<span class="org-keyword">require</span> '<span class="org-constant">org-journal</span>)
<span class="org-comment-delimiter">;; </span><span class="org-comment">this messes up org-clock</span>
<span class="org-comment-delimiter">;;</span><span class="org-comment">(define-key org-journal-mode-map (kbd "C-x C-s") '+org-journal-save-entry-and-exit)</span>
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgcb6e90e"></a>Footer<br>
<div class="outline-text-6" id="text-orgcb6e90e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-org-journal</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-org-gcal.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org27dd499" class="outline-4">
<h4 id="org27dd499">Footer</h4>
<div class="outline-text-4" id="text-org27dd499">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-org</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-org.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4aeaca6" class="outline-3">
<h3 id="org4aeaca6">Default IDE</h3>
<div class="outline-text-3" id="text-org4aeaca6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-ide.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-ide.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-orgc637c43" class="outline-4">
<h4 id="orgc637c43">Additional Package</h4>
<div class="outline-text-4" id="text-orgc637c43">
</div>
<ul class="org-ul">
<li><a id="org5846189"></a>flycheck<br>
<div class="outline-text-5" id="text-org5846189">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-flycheck.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-flycheck.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'flycheck))
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">consult</span>)
    (straight-use-package 'consult-flycheck))
(global-flycheck-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1485445"></a>Footer<br>
<div class="outline-text-6" id="text-org1485445">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-flycheck</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-flycheck.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgf371119"></a>projectile<br>
<div class="outline-text-5" id="text-orgf371119">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-projectile.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-projectile.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'projectile)
(customize-set-variable 'projectile-cache-file (expand-file-name <span class="org-string">"projectile.cache"</span> +emacs-data-dir))
(customize-set-variable 'projectile-known-projects-file (expand-file-name <span class="org-string">"projectile-bookmarks.eld"</span> +emacs-data-dir))
(projectile-mode +1)
(define-key projectile-mode-map (kbd <span class="org-string">"C-c p"</span>) 'projectile-command-map)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org214cdbd"></a>Footer<br>
<div class="outline-text-6" id="text-org214cdbd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-projectile</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-projectile.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
