posts/Emacs-Configuration.org
**** lsp-mode
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-lsp-mode.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-lsp-mode.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'lsp-mode)
         (straight-use-package 'lsp-ui)
         (when (featurep 'consult)
           (straight-use-package 'consult-lsp)))
       (setq lsp-keymap-prefix "C-c L")
       (customize-set-variable 'lsp-completion-provider :none)
       (customize-set-variable 'lsp-toml-cache-path (expand-file-name ".cache/lsp-toml" +emacs-data-dir))
       (customize-set-variable 'lsp-clojure-workspace-cache-dir (expand-file-name ".cache/lsp-toml" +emacs-data-dir))
       (defun +config/lsp-mode-setup-completion ()
         (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
               '(orderless))) ;; Configure flex
       (require 'lsp-mode)
       (add-hook 'c-mode-hook #'lsp-deferred)
       (add-hook 'c++-mode-hook #'lsp-deferred)
       (add-hook 'shell-mode-hook #'lsp-deferred)
       (add-hook 'yaml-mode-hook #'lsp-deferred)
       (customize-set-variable 'lsp-yaml-schema-store-local-db (expand-file-name ".cache/lsp/lsp-yaml-schemas.json" +emacs-data-dir))
       (add-hook 'rust-mode-hook #'lsp-deferred)
       (add-hook 'toml-mode-hook #'lsp-deferred)
       (add-hook 'python-mode-hook #'lsp-deferred)
       (add-hook 'nix-mode-hook #'lsp-deferred)
       (add-hook 'nginx-mode-hook #'lsp-deferred)
       (add-hook 'markdown-mode-hook #'lsp-deferred)
       (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
       (add-hook 'lsp-completion-mode-hook #'+config/lsp-mode-setup-completion)
     #+end_src
***** python deps
      lsp server.
      #+begin_src sh :tangle no
        pip install 'python-lsp-server[all]'
      #+end_src
***** extra deps
****** pyls-flake8
       #+begin_src sh :tangle no
         pip install pyls-flake8
       #+end_src
****** pyls-mypy
       #+begin_src sh :tangle no
         pip install pyls-mypy
       #+end_src
****** pyls-isort
       #+begin_src sh :tangle no
         pip install pyls-isort
       #+end_src
****** python-lsp-black
       #+begin_src sh :tangle no
         pip install python-lsp-black
       #+end_src
****** pyls-memestra
       #+begin_src sh :tangle no
         pip install pyls-memestra
       #+end_src
****** pylsp-rope
       #+begin_src sh :tangle no
         pip install pylsp-rope
       #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-lsp-mode)
        ;;; config-lsp-mode.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-ide)
      ;;; config-defaults-ide.el ends here
    #+end_src
** Default Email
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-email.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-email.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
   #+end_src
*** message-directory
    #+begin_src emacs-lisp
      (customize-set-variable 'message-directory (expand-file-name ".mail" (getenv "HOME")))
    #+end_src
*** message-auto-save-directory
    #+begin_src emacs-lisp
      (setq message-auto-save-directory (expand-file-name "mail/auto-save" +emacs-data-dir))
      (unless (file-directory-p message-auto-save-directory)
        (make-directory message-auto-save-directory :parents))
    #+end_src
*** sign outgoing mail by default
    #+begin_src emacs-lisp
      (add-hook 'message-setup-hook 'mml-secure-message-sign-pgpmime)
    #+end_src
*** msmtp
    #+begin_src emacs-lisp
      (setq send-mail-function 'sendmail-send-it
            ;; sendmail is a symlink to msmtp
            sendmail-program "/usr/bin/sendmail"
            mail-specify-envelope-from t
            message-sendmail-envelope-from 'header
            mail-envelope-from 'header)
    #+end_src
*** Additional Packages
