posts/Emacs-Configuration.html
<li><a id="org10b90e2"></a>lsp-mode<br>
<div class="outline-text-5" id="text-org10b90e2">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-lsp-mode.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-lsp-mode.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'lsp-mode)
  (straight-use-package 'lsp-ui)
  (<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">consult</span>)
    (straight-use-package 'consult-lsp)))
(<span class="org-keyword">setq</span> lsp-keymap-prefix <span class="org-string">"C-c L"</span>)
(customize-set-variable 'lsp-completion-provider <span class="org-builtin">:none</span>)
(customize-set-variable 'lsp-toml-cache-path (expand-file-name <span class="org-string">".cache/lsp-toml"</span> +emacs-data-dir))
(customize-set-variable 'lsp-clojure-workspace-cache-dir (expand-file-name <span class="org-string">".cache/lsp-toml"</span> +emacs-data-dir))
(<span class="org-keyword">defun</span> <span class="org-function-name">+config/lsp-mode-setup-completion</span> ()
  (<span class="org-keyword">setf</span> (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
        '(orderless))) <span class="org-comment-delimiter">;; </span><span class="org-comment">Configure flex</span>
(<span class="org-keyword">require</span> '<span class="org-constant">lsp-mode</span>)
(add-hook 'c-mode-hook #'lsp-deferred)
(add-hook 'c++-mode-hook #'lsp-deferred)
(add-hook 'shell-mode-hook #'lsp-deferred)
(add-hook 'yaml-mode-hook #'lsp-deferred)
(customize-set-variable 'lsp-yaml-schema-store-local-db (expand-file-name <span class="org-string">".cache/lsp/lsp-yaml-schemas.json"</span> +emacs-data-dir))
(add-hook 'rust-mode-hook #'lsp-deferred)
(add-hook 'toml-mode-hook #'lsp-deferred)
(add-hook 'python-mode-hook #'lsp-deferred)
(add-hook 'nix-mode-hook #'lsp-deferred)
(add-hook 'nginx-mode-hook #'lsp-deferred)
(add-hook 'markdown-mode-hook #'lsp-deferred)
(add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
(add-hook 'lsp-completion-mode-hook #'+config/lsp-mode-setup-completion)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgb05eeb3"></a>python deps<br>
<div class="outline-text-6" id="text-orgb05eeb3">
<p>
lsp server.
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install <span class="org-string">'python-lsp-server[all]'</span>
</pre>
</div>
</div>
</li>
<li><a id="orgbd9d808"></a>extra deps<br>
<ul class="org-ul">
<li><a id="orgefe8908"></a>pyls-flake8<br>
<div class="outline-text-7" id="text-orgefe8908">
<div class="org-src-container">
<pre class="src src-sh">pip install pyls-flake8
</pre>
</div>
</div>
</li>
<li><a id="org6d079f8"></a>pyls-mypy<br>
<div class="outline-text-7" id="text-org6d079f8">
<div class="org-src-container">
<pre class="src src-sh">pip install pyls-mypy
</pre>
</div>
</div>
</li>
<li><a id="org3c2ec0e"></a>pyls-isort<br>
<div class="outline-text-7" id="text-org3c2ec0e">
<div class="org-src-container">
<pre class="src src-sh">pip install pyls-isort
</pre>
</div>
</div>
</li>
<li><a id="orgaa7f17e"></a>python-lsp-black<br>
<div class="outline-text-7" id="text-orgaa7f17e">
<div class="org-src-container">
<pre class="src src-sh">pip install python-lsp-black
</pre>
</div>
</div>
</li>
<li><a id="org7cfbfe5"></a>pyls-memestra<br>
<div class="outline-text-7" id="text-org7cfbfe5">
<div class="org-src-container">
<pre class="src src-sh">pip install pyls-memestra
</pre>
</div>
</div>
</li>
<li><a id="org7fe6551"></a>pylsp-rope<br>
<div class="outline-text-7" id="text-org7fe6551">
<div class="org-src-container">
<pre class="src src-sh">pip install pylsp-rope
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd0ce8cc"></a>Footer<br>
<div class="outline-text-6" id="text-orgd0ce8cc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-lsp-mode</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-lsp-mode.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org2442b0d" class="outline-4">
<h4 id="org2442b0d">Footer</h4>
<div class="outline-text-4" id="text-org2442b0d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-ide</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-ide.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6765adb" class="outline-3">
<h3 id="org6765adb">Default Email</h3>
<div class="outline-text-3" id="text-org6765adb">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-email.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-email.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-org87018a8" class="outline-4">
<h4 id="org87018a8">message-directory</h4>
<div class="outline-text-4" id="text-org87018a8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'message-directory (expand-file-name <span class="org-string">".mail"</span> (getenv <span class="org-string">"HOME"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f42c87" class="outline-4">
<h4 id="org7f42c87">message-auto-save-directory</h4>
<div class="outline-text-4" id="text-org7f42c87">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> message-auto-save-directory (expand-file-name <span class="org-string">"mail/auto-save"</span> +emacs-data-dir))
(<span class="org-keyword">unless</span> (file-directory-p message-auto-save-directory)
  (make-directory message-auto-save-directory <span class="org-builtin">:parents</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8cbd6e7" class="outline-4">
<h4 id="org8cbd6e7">sign outgoing mail by default</h4>
<div class="outline-text-4" id="text-org8cbd6e7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'message-setup-hook 'mml-secure-message-sign-pgpmime)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3629527" class="outline-4">
<h4 id="org3629527">msmtp</h4>
<div class="outline-text-4" id="text-org3629527">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> send-mail-function 'sendmail-send-it
      <span class="org-comment-delimiter">;; </span><span class="org-comment">sendmail is a symlink to msmtp</span>
      sendmail-program <span class="org-string">"/usr/bin/sendmail"</span>
      mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)
</pre>
</div>
</div>
</div>
