posts/Emacs-Configuration.org
**** notmuch
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-notmuch.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-notmuch.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'notmuch)
       (straight-use-package 'ol-notmuch)
       (customize-set-variable 'notmuch-init-file (expand-file-name "notmuch-config" +emacs-data-dir))
       (customize-set-variable 'notmuch-search-oldest-first nil)
       (global-set-key (kbd "C-c M") 'notmuch)
     #+end_src
     This is the default saved-searches, for reference.
     #+begin_src emacs-lisp :tangle no
       (setq notmuch-saved-searches
             '((:name "inbox" :query "tag:inbox" :key "i")
               (:name "unread" :query "tag:unread" :key "u")
               (:name "flagged" :query "tag:flagged" :key "f") ;starred in gmail
               (:name "sent" :query "tag:sent" :key "t")
               (:name "drafts" :query "tag:draft" :key "d")
               (:name "all mail" :query "*" :key "a")))
     #+end_src
     Since I've used =afew= to modify /tags/ based on the accounts /maildir/ directories
     #+begin_src emacs-lisp
       (setq notmuch-saved-searches
             '((:name "inbox" :query "tag:inbox" :key "i")
               (:name "unread" :query "tag:unread" :key "u")
               (:name "spam" :query "tag:spam")
               (:name "gmail/inbox" :query "tag:gmail/inbox")
               (:name "gmail/sent" :query "tag:gmail/sent")
               (:name "gmail/draft" :query "tag:gmail/draft")
               (:name "gmail/archive" :query "tag:gmail/archive")
               (:name "gmail/spam" :query "tag:gmail/spam")
               (:name "yahoo/inbox" :query "tag:yahoo/inbox")
               (:name "yahoo/sent" :query "tag:yahoo/sent")
               (:name "yahoo/draft" :query "tag:yahoo/draft")
               (:name "yahoo/archive" :query "tag:yahoo/archive")
               (:name "yahoo/spam" :query "tag:yahoo/spam")
               (:name "hotmail/inbox" :query "tag:hotmail/inbox")
               (:name "hotmail/sent" :query "tag:hotmail/sent")
               (:name "hotmail/draft" :query "tag:hotmail/draft")
               (:name "hotmail/archive" :query "tag:hotmail/archive")
               (:name "hotmail/spam" :query "tag:hotmail/spam")
               (:name "ymail/inbox" :query "tag:ymail/inbox")
               (:name "ymail/sent" :query "tag:ymail/sent")
               (:name "ymail/draft" :query "tag:ymail/draft")
               (:name "ymail/archive" :query "tag:ymail/archive")
               (:name "ymail/spam" :query "tag:ymail/spam")))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-notmuch)
        ;;; config-notmuch.el ends here
      #+end_src
**** gnus-alias
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-gnus-alias.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-gnus-alias.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'gnus-alias)
       (add-hook 'message-setup-hook
                 (lambda ()
                   (gnus-alias-determine-identity)
                   (define-key message-mode-map (kbd "C-c f")
                     (lambda ()
                       (interactive)
                       (message-remove-header "Fcc")
                       (message-remove-header "Organization")
                       (gnus-alias-select-identity)
                       (notmuch-fcc-header-setup)))))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-gnus-alias)
        ;;; config-gnus-alias.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-email)
      ;;; config-defaults-email.el ends here
    #+end_src
** Default Shell
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-shell.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-shell.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
   #+end_src
*** Eshell
