posts/Emacs-Configuration.html
<div id="outline-container-orgf8886b0" class="outline-4">
<h4 id="orgf8886b0">Additional Packages</h4>
<div class="outline-text-4" id="text-orgf8886b0">
</div>
<ul class="org-ul">
<li><a id="org4d9952e"></a>notmuch<br>
<div class="outline-text-5" id="text-org4d9952e">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-notmuch.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-notmuch.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'notmuch)
(straight-use-package 'ol-notmuch)
(customize-set-variable 'notmuch-init-file (expand-file-name <span class="org-string">"notmuch-config"</span> +emacs-data-dir))
(customize-set-variable 'notmuch-search-oldest-first nil)
(global-set-key (kbd <span class="org-string">"C-c M"</span>) 'notmuch)
</pre>
</div>
<p>
This is the default saved-searches, for reference.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> notmuch-saved-searches
      '((<span class="org-builtin">:name</span> <span class="org-string">"inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:inbox"</span> <span class="org-builtin">:key</span> <span class="org-string">"i"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"unread"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:unread"</span> <span class="org-builtin">:key</span> <span class="org-string">"u"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"flagged"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:flagged"</span> <span class="org-builtin">:key</span> <span class="org-string">"f"</span>) <span class="org-comment-delimiter">;</span><span class="org-comment">starred in gmail</span>
        (<span class="org-builtin">:name</span> <span class="org-string">"sent"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:sent"</span> <span class="org-builtin">:key</span> <span class="org-string">"t"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"drafts"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:draft"</span> <span class="org-builtin">:key</span> <span class="org-string">"d"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"all mail"</span> <span class="org-builtin">:query</span> <span class="org-string">"*"</span> <span class="org-builtin">:key</span> <span class="org-string">"a"</span>)))
</pre>
</div>
<p>
Since I&rsquo;ve used <code>afew</code> to modify <i>tags</i> based on the accounts <i>maildir</i> directories
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> notmuch-saved-searches
      '((<span class="org-builtin">:name</span> <span class="org-string">"inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:inbox"</span> <span class="org-builtin">:key</span> <span class="org-string">"i"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"unread"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:unread"</span> <span class="org-builtin">:key</span> <span class="org-string">"u"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"spam"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:spam"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"gmail/inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:gmail/inbox"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"gmail/sent"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:gmail/sent"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"gmail/draft"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:gmail/draft"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"gmail/archive"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:gmail/archive"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"gmail/spam"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:gmail/spam"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"yahoo/inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:yahoo/inbox"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"yahoo/sent"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:yahoo/sent"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"yahoo/draft"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:yahoo/draft"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"yahoo/archive"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:yahoo/archive"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"yahoo/spam"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:yahoo/spam"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"hotmail/inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:hotmail/inbox"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"hotmail/sent"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:hotmail/sent"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"hotmail/draft"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:hotmail/draft"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"hotmail/archive"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:hotmail/archive"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"hotmail/spam"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:hotmail/spam"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"ymail/inbox"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:ymail/inbox"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"ymail/sent"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:ymail/sent"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"ymail/draft"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:ymail/draft"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"ymail/archive"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:ymail/archive"</span>)
        (<span class="org-builtin">:name</span> <span class="org-string">"ymail/spam"</span> <span class="org-builtin">:query</span> <span class="org-string">"tag:ymail/spam"</span>)))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgeb71f2c"></a>Footer<br>
<div class="outline-text-6" id="text-orgeb71f2c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-notmuch</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-notmuch.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd97c996"></a>gnus-alias<br>
<div class="outline-text-5" id="text-orgd97c996">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-gnus-alias.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-gnus-alias.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'gnus-alias)
(add-hook 'message-setup-hook
          (<span class="org-keyword">lambda</span> ()
            (gnus-alias-determine-identity)
            (define-key message-mode-map (kbd <span class="org-string">"C-c f"</span>)
              (<span class="org-keyword">lambda</span> ()
                (<span class="org-keyword">interactive</span>)
                (message-remove-header <span class="org-string">"Fcc"</span>)
                (message-remove-header <span class="org-string">"Organization"</span>)
                (gnus-alias-select-identity)
                (notmuch-fcc-header-setup)))))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgb217b81"></a>Footer<br>
<div class="outline-text-6" id="text-orgb217b81">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-gnus-alias</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-gnus-alias.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org65f8af2" class="outline-4">
<h4 id="org65f8af2">Footer</h4>
<div class="outline-text-4" id="text-org65f8af2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-email</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-email.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
