posts/Emacs-Configuration.html
<div id="outline-container-org96a1614" class="outline-3">
<h3 id="org96a1614">Default Shell</h3>
<div class="outline-text-3" id="text-org96a1614">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-shell.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-shell.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-org333cc75" class="outline-4">
<h4 id="org333cc75">Eshell</h4>
<div class="outline-text-4" id="text-org333cc75">
</div>
<ul class="org-ul">
<li><a id="orgcd58d78"></a>Eshell and emacs-server<br>
<div class="outline-text-5" id="text-orgcd58d78">
<p>
From <a href="https://www.emacswiki.org/emacs/EshellAndEmacsServer">emacswiki</a>. If using <i>chemacs,</i> to actually run this outside <i>emacs</i>, use: <code>emacsclient -a "" -s &lt;chemacs-profile&gt; -c -e '(+server-eshell)'</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">+server-eshell</span> ()
  <span class="org-doc">"Command to be called by emacs-client to start a new shell.</span>

<span class="org-doc">A new eshell will be created. When the frame is closed, the buffer is deleted or the shell exits,</span>
<span class="org-doc">then hooks will take care that the other actions happen. For example, when the frame is closed,</span>
<span class="org-doc">then the buffer will be deleted and the client disconnected.</span>

<span class="org-doc">Also creates a local binding of 'C-x #' to kill the buffer."</span>
  (<span class="org-keyword">lexical-let</span> ((buf (eshell t))
                (client (first server-clients))
                (frame (selected-frame)))
               (<span class="org-keyword">labels</span> ((close (<span class="org-type">&amp;optional</span> arg)
                               (<span class="org-keyword">when</span> (not (boundp '+cve/recurse))
                                 (<span class="org-keyword">let</span> ((+cve/recurse t))
                                   (delete-frame frame)
                                   (kill-buffer buf)
                                   (server-delete-client client)))))
                       (add-hook 'eshell-exit-hook #'close t t)
                       (add-hook 'delete-frame-functions #'close t t))
               (local-set-key (kbd <span class="org-string">"C-x #"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (kill-buffer buf)))
               (delete-other-windows)
               nil))
</pre>
</div>
</div>
</li>
<li><a id="orge5d623f"></a>Set current directory in prompt.<br>
<div class="outline-text-5" id="text-orge5d623f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> eshell-prompt-function
      (<span class="org-keyword">lambda</span> nil
        (concat
         (eshell/pwd)
         <span class="org-string">" $ "</span>)))
</pre>
</div>
</div>
</li>
<li><a id="org910ee22"></a>keybinding<br>
<div class="outline-text-5" id="text-org910ee22">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c t e"</span>) 'eshell)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org504ce18" class="outline-4">
<h4 id="org504ce18">Additional Packages</h4>
<div class="outline-text-4" id="text-org504ce18">
</div>
<ul class="org-ul">
<li><a id="org3848c89"></a>vterm<br>
<div class="outline-text-5" id="text-org3848c89">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-vterm.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-vterm.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'vterm))
(<span class="org-keyword">require</span> '<span class="org-constant">vterm</span>)
(global-set-key (kbd <span class="org-string">"C-c t t"</span>) 'vterm)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgca9b242"></a>Footer<br>
<div class="outline-text-6" id="text-orgca9b242">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-vterm</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-vterm.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org5d9c419" class="outline-4">
<h4 id="org5d9c419">Footer</h4>
<div class="outline-text-4" id="text-org5d9c419">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-shell</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-shell.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
