posts/Emacs-Configuration.org
**** vertico
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-vertico.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-vertico.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package '(vertico :files (:defaults "extensions/*")
                                       :includes (vertico-indexed
                                                  vertico-flat
                                                  vertico-grid
                                                  vertico-mouse
                                                  vertico-quick
                                                  vertico-buffer
                                                  vertico-repeat
                                                  vertico-reverse
                                                  vertico-directory
                                                  vertico-multiform
                                                  vertico-unobtrusive
                                                  )))
       (defun crm-indicator (args)
         (cons (concat "[CRM] " (car args)) (cdr args)))
       (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

       ;; Do not allow the cursor in the minibuffer prompt
       (setq minibuffer-prompt-properties
             '(read-only t cursor-intangible t face minibuffer-prompt))
       (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
       (setq tab-always-indent 'complete)
       (customize-set-variable 'vertico-cycle t)

       (require 'vertico)
       (vertico-mode)

       ;; Use `consult-completion-in-region' if Vertico is enabled.
       ;; Otherwise use the default `completion--in-region' function.
       (setq completion-in-region-function
             (lambda (&rest args)
               (apply (if vertico-mode
                          #'consult-completion-in-region
                        #'completion--in-region)
                      args)))
       (require 'vertico-directory)
       (add-hook 'rfn-shadow-update-overlay-hook #'vertico-directory-tidy)

       ;; tmm-menubar
       (global-set-key [f10] #'tmm-menubar)
       (advice-add #'tmm-add-prompt :after #'minibuffer-hide-completions)

       ;; ffap-menu
       (advice-add #'ffap-menu-ask :around (lambda (&rest args)
                                             (cl-letf (((symbol-function #'minibuffer-completion-help)
                                                        #'ignore))
                                               (apply args))))
       ;; prefix
       (advice-add #'vertico--format-candidate :around
                   (lambda (orig cand prefix suffix index _start)
                     (setq cand (funcall orig cand prefix suffix index _start))
                     (concat
                      (if (= vertico--index index)
                          (propertize " " 'face 'vertico-current)
                        "  ")
                      cand)))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-vertico)
        ;;; config-vertico.el ends here
      #+end_src
**** orderless
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-orderless.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-orderless.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'orderless))
       (require 'orderless)
       (setq completion-styles '(orderless)
             completion-category-defaults nil
             completion-category-overrides '((file (styles basic partial-completion))))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-orderless)
        ;;; config-orderless.el ends here
      #+end_src
**** marginalia
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-marginalia.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-marginalia.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'marginalia))
       (require 'marginalia)
       (define-key minibuffer-local-map (kbd "M-A") 'marginalia-cycle)
       (marginalia-mode 1)
     #+end_src
