posts/Emacs-Configuration.html
<div id="outline-container-org9e772f3" class="outline-3">
<h3 id="org9e772f3">Default Completion</h3>
<div class="outline-text-3" id="text-org9e772f3">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-completion.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-completion.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-org61c33df" class="outline-4">
<h4 id="org61c33df">Additional Packages</h4>
<div class="outline-text-4" id="text-org61c33df">
</div>
<ul class="org-ul">
<li><a id="orgd1d6d6f"></a>vertico<br>
<div class="outline-text-5" id="text-orgd1d6d6f">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-vertico.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-vertico.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package '(vertico <span class="org-builtin">:files</span> (<span class="org-builtin">:defaults</span> <span class="org-string">"extensions/*"</span>)
                                <span class="org-builtin">:includes</span> (vertico-indexed
                                           vertico-flat
                                           vertico-grid
                                           vertico-mouse
                                           vertico-quick
                                           vertico-buffer
                                           vertico-repeat
                                           vertico-reverse
                                           vertico-directory
                                           vertico-multiform
                                           vertico-unobtrusive
                                           )))
(<span class="org-keyword">defun</span> <span class="org-function-name">crm-indicator</span> (args)
  (cons (concat <span class="org-string">"[CRM] "</span> (car args)) (cdr args)))
(advice-add #'completing-read-multiple <span class="org-builtin">:filter-args</span> #'crm-indicator)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Do not allow the cursor in the minibuffer prompt</span>
(<span class="org-keyword">setq</span> minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
(<span class="org-keyword">setq</span> tab-always-indent 'complete)
(customize-set-variable 'vertico-cycle t)

(<span class="org-keyword">require</span> '<span class="org-constant">vertico</span>)
(vertico-mode)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use `</span><span class="org-comment"><span class="org-constant">consult-completion-in-region</span></span><span class="org-comment">' if Vertico is enabled.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Otherwise use the default `</span><span class="org-comment"><span class="org-constant">completion--in-region</span></span><span class="org-comment">' function.</span>
(<span class="org-keyword">setq</span> completion-in-region-function
      (<span class="org-keyword">lambda</span> (<span class="org-type">&amp;rest</span> args)
        (apply (<span class="org-keyword">if</span> vertico-mode
                   #'consult-completion-in-region
                 #'completion--in-region)
               args)))
(<span class="org-keyword">require</span> '<span class="org-constant">vertico-directory</span>)
(add-hook 'rfn-shadow-update-overlay-hook #'vertico-directory-tidy)

<span class="org-comment-delimiter">;; </span><span class="org-comment">tmm-menubar</span>
(global-set-key [f10] #'tmm-menubar)
(advice-add #'tmm-add-prompt <span class="org-builtin">:after</span> #'minibuffer-hide-completions)

<span class="org-comment-delimiter">;; </span><span class="org-comment">ffap-menu</span>
(advice-add #'ffap-menu-ask <span class="org-builtin">:around</span> (<span class="org-keyword">lambda</span> (<span class="org-type">&amp;rest</span> args)
                                      (<span class="org-keyword">cl-letf</span> (((symbol-function #'minibuffer-completion-help)
                                                 #'ignore))
                                        (apply args))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">prefix</span>
(advice-add #'vertico--format-candidate <span class="org-builtin">:around</span>
            (<span class="org-keyword">lambda</span> (orig cand prefix suffix index _start)
              (<span class="org-keyword">setq</span> cand (funcall orig cand prefix suffix index _start))
              (concat
               (<span class="org-keyword">if</span> (= vertico--index index)
                   (propertize <span class="org-string">"&#187; "</span> 'face 'vertico-current)
                 <span class="org-string">"  "</span>)
               cand)))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org6d471b6"></a>Footer<br>
<div class="outline-text-6" id="text-org6d471b6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-vertico</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-vertico.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org24b500e"></a>orderless<br>
<div class="outline-text-5" id="text-org24b500e">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-orderless.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-orderless.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'orderless))
(<span class="org-keyword">require</span> '<span class="org-constant">orderless</span>)
(<span class="org-keyword">setq</span> completion-styles '(orderless)
      completion-category-defaults nil
      completion-category-overrides '((file (styles basic partial-completion))))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orga55f7bd"></a>Footer<br>
<div class="outline-text-6" id="text-orga55f7bd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-orderless</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-orderless.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org771360d"></a>marginalia<br>
<div class="outline-text-5" id="text-org771360d">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-marginalia.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-marginalia.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'marginalia))
(<span class="org-keyword">require</span> '<span class="org-constant">marginalia</span>)
(define-key minibuffer-local-map (kbd <span class="org-string">"M-A"</span>) 'marginalia-cycle)
(marginalia-mode 1)
</pre>
</div>
</div>
<ul class="org-ul">
