posts/Emacs-Configuration.org
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-marginalia)
        ;;; config-marginalia.el ends here
      #+end_src
**** consult
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-consult.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-consult.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'consult))
       (require 'consult)
       (add-hook 'completion-list-mode-hook #'consult-preview-at-point-mode)
       (advice-add #'register-preview :override #'consult-register-window)
       (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
       (setq register-preview-delay 0.5
             register-preview-function #'consult-register-format)
       (setq xref-show-xrefs-function #'consult-xref
             xref-show-definitions-function #'consult-xref)
       (consult-customize
        consult-theme
        :preview-key '(:debounce 0.2 any)
        consult-ripgrep consult-git-grep consult-grep
        consult-bookmark consult-recent-file consult-xref
        consult--source-bookmark consult--source-recent-file
        consult--source-project-recent-file
        :preview-key (kbd "M-."))
       (setq consult-narrow-key "<") ;; (kbd "C-+")
       (global-set-key (kbd "C-c h") 'consult-history)
       (global-set-key (kbd "C-c m") 'consult-mode-command)
       (global-set-key (kbd "C-c k") 'consult-kmacro)
       ;; C-x bindings (ctl-x-map)
       (global-set-key (kbd "C-x M-:") 'consult-complex-command) ;; orig. repeat-complex-command
       ;;(global-set-key (kbd "C-x b") 'consult-buffer) ;; orig. switch-to-buffer
       (global-set-key (kbd "C-x 4 b") 'consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
       (global-set-key (kbd "C-x 5 b") 'consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
       (global-set-key (kbd "C-x r b") 'consult-bookmark)            ;; orig. bookmark-jump
       (global-set-key (kbd "C-x p b") 'consult-project-buffer)      ;; orig. project-switch-to-buffer
       ;; Custom M-# bindings for fast register access
       (global-set-key (kbd "M-#") 'consult-register-load)
       (global-set-key (kbd "M-'") 'consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
       (global-set-key (kbd "C-M-#") 'consult-register)
       ;; Other custom bindings
       (global-set-key (kbd "M-y") 'consult-yank-pop)                ;; orig. yank-pop
       (global-set-key (kbd "<help> a") 'consult-apropos)            ;; orig. apropos-command
       ;; M-g bindings (goto-map)
       (global-set-key (kbd "M-g e") 'consult-compile-error)
       (when (featurep 'flymake)
         (global-set-key (kbd "M-g f") 'consult-flymake))               ;; Alternative: consult-flycheck
       (when (featurep 'flycheck)
         (global-set-key (kbd "M-g f") 'consult-flycheck))
       (global-set-key (kbd "M-g g") 'consult-goto-line)             ;; orig. goto-line
       (global-set-key (kbd "M-g M-g") 'consult-goto-line)           ;; orig. goto-line
       (global-set-key (kbd "M-g o") 'consult-outline)               ;; Alternative: consult-org-heading
       ;;(global-set-key (kbd "M-g m") 'consult-mark) ;;conflict with telega
       (global-set-key (kbd "M-g k") 'consult-global-mark)
       ;;(global-set-key (kbd "M-g i") 'consult-imenu) ;; conflict with telega
       (global-set-key (kbd "M-g I") 'consult-imenu-multi)
       ;; M-s bindings (search-map)
       (global-set-key (kbd "M-s d") 'consult-find)
       (global-set-key (kbd "M-s D") 'consult-locate)
       (global-set-key (kbd "M-s g") 'consult-grep)
       (global-set-key (kbd "M-s G") 'consult-git-grep)
       (global-set-key (kbd "M-s r") 'consult-ripgrep)
       (global-set-key (kbd "M-s l") 'consult-line)
       (global-set-key (kbd "M-s L") 'consult-line-multi)
       (global-set-key (kbd "M-s m") 'consult-multi-occur)
       (global-set-key (kbd "M-s k") 'consult-keep-lines)
       (global-set-key (kbd "M-s u") 'consult-focus-lines)
       ;; Isearch integration
       (global-set-key (kbd "M-s e") 'consult-isearch-history)
       (define-key isearch-mode-map (kbd "M-e") #'consult-isearch-history)         ;; orig. isearch-edit-string
       (define-key isearch-mode-map (kbd "M-s e") #'consult-isearch-history)       ;; orig. isearch-edit-string
       (define-key isearch-mode-map (kbd "M-s l") #'consult-line)                  ;; needed by consult-line to detect isearch
       (define-key isearch-mode-map (kbd "M-s L") #'consult-line-multi)           ;; needed by consult-line to detect isearch

       (cond
        ((featurep 'projectile)
         (autoload 'projectile-project-root "projectile")
         (setq consult-project-root-function #'projectile-project-root))
        ((featurep 'project)
         (setq consult-project-root-function #'consult--project-root-default-function))
        ((featurep 'vc)
         (setq consult-project-root-function #'vc-root-dir)))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-consult)
        ;;; config-consult.el ends here
      #+end_src
