posts/Emacs-Configuration.html
<li><a id="org52e2273"></a>Footer<br>
<div class="outline-text-6" id="text-org52e2273">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-marginalia</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-marginalia.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org9387931"></a>consult<br>
<div class="outline-text-5" id="text-org9387931">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-consult.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-consult.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'consult))
(<span class="org-keyword">require</span> '<span class="org-constant">consult</span>)
(add-hook 'completion-list-mode-hook #'consult-preview-at-point-mode)
(advice-add #'register-preview <span class="org-builtin">:override</span> #'consult-register-window)
(advice-add #'completing-read-multiple <span class="org-builtin">:override</span> #'consult-completing-read-multiple)
(<span class="org-keyword">setq</span> register-preview-delay 0.5
      register-preview-function #'consult-register-format)
(<span class="org-keyword">setq</span> xref-show-xrefs-function #'consult-xref
      xref-show-definitions-function #'consult-xref)
(consult-customize
 consult-theme
 <span class="org-builtin">:preview-key</span> '(<span class="org-builtin">:debounce</span> 0.2 any)
 consult-ripgrep consult-git-grep consult-grep
 consult-bookmark consult-recent-file consult-xref
 consult--source-bookmark consult--source-recent-file
 consult--source-project-recent-file
 <span class="org-builtin">:preview-key</span> (kbd <span class="org-string">"M-."</span>))
(<span class="org-keyword">setq</span> consult-narrow-key <span class="org-string">"&lt;"</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment">(kbd "C-+")</span>
(global-set-key (kbd <span class="org-string">"C-c h"</span>) 'consult-history)
(global-set-key (kbd <span class="org-string">"C-c m"</span>) 'consult-mode-command)
(global-set-key (kbd <span class="org-string">"C-c k"</span>) 'consult-kmacro)
<span class="org-comment-delimiter">;; </span><span class="org-comment">C-x bindings (ctl-x-map)</span>
(global-set-key (kbd <span class="org-string">"C-x M-:"</span>) 'consult-complex-command) <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. repeat-complex-command</span>
<span class="org-comment-delimiter">;;</span><span class="org-comment">(global-set-key (kbd "C-x b") 'consult-buffer) ;; orig. switch-to-buffer</span>
(global-set-key (kbd <span class="org-string">"C-x 4 b"</span>) 'consult-buffer-other-window) <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. switch-to-buffer-other-window</span>
(global-set-key (kbd <span class="org-string">"C-x 5 b"</span>) 'consult-buffer-other-frame)  <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. switch-to-buffer-other-frame</span>
(global-set-key (kbd <span class="org-string">"C-x r b"</span>) 'consult-bookmark)            <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. bookmark-jump</span>
(global-set-key (kbd <span class="org-string">"C-x p b"</span>) 'consult-project-buffer)      <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. project-switch-to-buffer</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Custom M-# bindings for fast register access</span>
(global-set-key (kbd <span class="org-string">"M-#"</span>) 'consult-register-load)
(global-set-key (kbd <span class="org-string">"M-'"</span>) 'consult-register-store)          <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. abbrev-prefix-mark (unrelated)</span>
(global-set-key (kbd <span class="org-string">"C-M-#"</span>) 'consult-register)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Other custom bindings</span>
(global-set-key (kbd <span class="org-string">"M-y"</span>) 'consult-yank-pop)                <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. yank-pop</span>
(global-set-key (kbd <span class="org-string">"&lt;help&gt; a"</span>) 'consult-apropos)            <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. apropos-command</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">M-g bindings (goto-map)</span>
(global-set-key (kbd <span class="org-string">"M-g e"</span>) 'consult-compile-error)
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">flymake</span>)
  (global-set-key (kbd <span class="org-string">"M-g f"</span>) 'consult-flymake))               <span class="org-comment-delimiter">;; </span><span class="org-comment">Alternative: consult-flycheck</span>
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">flycheck</span>)
  (global-set-key (kbd <span class="org-string">"M-g f"</span>) 'consult-flycheck))
(global-set-key (kbd <span class="org-string">"M-g g"</span>) 'consult-goto-line)             <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. goto-line</span>
(global-set-key (kbd <span class="org-string">"M-g M-g"</span>) 'consult-goto-line)           <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. goto-line</span>
(global-set-key (kbd <span class="org-string">"M-g o"</span>) 'consult-outline)               <span class="org-comment-delimiter">;; </span><span class="org-comment">Alternative: consult-org-heading</span>
<span class="org-comment-delimiter">;;</span><span class="org-comment">(global-set-key (kbd "M-g m") 'consult-mark) ;;conflict with telega</span>
(global-set-key (kbd <span class="org-string">"M-g k"</span>) 'consult-global-mark)
<span class="org-comment-delimiter">;;</span><span class="org-comment">(global-set-key (kbd "M-g i") 'consult-imenu) ;; conflict with telega</span>
(global-set-key (kbd <span class="org-string">"M-g I"</span>) 'consult-imenu-multi)
<span class="org-comment-delimiter">;; </span><span class="org-comment">M-s bindings (search-map)</span>
(global-set-key (kbd <span class="org-string">"M-s d"</span>) 'consult-find)
(global-set-key (kbd <span class="org-string">"M-s D"</span>) 'consult-locate)
(global-set-key (kbd <span class="org-string">"M-s g"</span>) 'consult-grep)
(global-set-key (kbd <span class="org-string">"M-s G"</span>) 'consult-git-grep)
(global-set-key (kbd <span class="org-string">"M-s r"</span>) 'consult-ripgrep)
(global-set-key (kbd <span class="org-string">"M-s l"</span>) 'consult-line)
(global-set-key (kbd <span class="org-string">"M-s L"</span>) 'consult-line-multi)
(global-set-key (kbd <span class="org-string">"M-s m"</span>) 'consult-multi-occur)
(global-set-key (kbd <span class="org-string">"M-s k"</span>) 'consult-keep-lines)
(global-set-key (kbd <span class="org-string">"M-s u"</span>) 'consult-focus-lines)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Isearch integration</span>
(global-set-key (kbd <span class="org-string">"M-s e"</span>) 'consult-isearch-history)
(define-key isearch-mode-map (kbd <span class="org-string">"M-e"</span>) #'consult-isearch-history)         <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. isearch-edit-string</span>
(define-key isearch-mode-map (kbd <span class="org-string">"M-s e"</span>) #'consult-isearch-history)       <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. isearch-edit-string</span>
(define-key isearch-mode-map (kbd <span class="org-string">"M-s l"</span>) #'consult-line)                  <span class="org-comment-delimiter">;; </span><span class="org-comment">needed by consult-line to detect isearch</span>
(define-key isearch-mode-map (kbd <span class="org-string">"M-s L"</span>) #'consult-line-multi)           <span class="org-comment-delimiter">;; </span><span class="org-comment">needed by consult-line to detect isearch</span>

(<span class="org-keyword">cond</span>
 ((<span class="org-keyword">featurep</span> '<span class="org-constant">projectile</span>)
  (autoload 'projectile-project-root <span class="org-string">"projectile"</span>)
  (<span class="org-keyword">setq</span> consult-project-root-function #'projectile-project-root))
 ((<span class="org-keyword">featurep</span> '<span class="org-constant">project</span>)
  (<span class="org-keyword">setq</span> consult-project-root-function #'consult--project-root-default-function))
 ((<span class="org-keyword">featurep</span> '<span class="org-constant">vc</span>)
  (<span class="org-keyword">setq</span> consult-project-root-function #'vc-root-dir)))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgd0167ee"></a>Footer<br>
<div class="outline-text-6" id="text-orgd0167ee">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-consult</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-consult.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
