posts/Emacs-Configuration.org
**** embark
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-embark.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-embark.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'embark))
       (when (featurep 'consult)
         (straight-use-package 'embark-consult))
       (require 'embark)
       (global-set-key [remap describe-bindings] #'embark-bindings)
       (global-set-key (kbd "C-c C-.") 'embark-act)
       (setq prefix-help-command #'embark-prefix-help-command)
       (add-to-list 'display-buffer-alist
                    '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                      nil
                      (window-parameters (mode-line-format . none))))
       (when (featurep 'consult)
         (require 'embark-consult)
         (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-embark)
        ;;; config-embark.el ends here
      #+end_src
**** corfu
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-corfu.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-corfu.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'corfu))
       (require 'corfu)
       ;;(customize-set-variable 'corfu-cycle t)
       (customize-set-variable 'corfu-auto t)
       ;;(customize-set-variable 'corfu-preselect-first t)
       (customize-set-variable 'corfu-quit-no-match 'separator)
       ;;(customize-set-variable 'corfu-separator ?\s)
       (setq completion-cycle-threshold 3
             tab-always-indent 'complete)

       (defun +corfu-enable-in-minibuffer ()
         "Enable Corfu in the minibuffer if `completion-at-point' is bound."
         (when (where-is-internal #'completion-at-point (list (current-local-map)))
           ;; (setq-local corfu-auto nil) Enable/disable auto completion
           (corfu-mode 1)))
       (add-hook 'minibuffer-setup-hook #'+corfu-enable-in-minibuffer)

       (add-hook 'eshell-mode-hook
                 (lambda ()
                   (setq-local corfu-auto nil)
                   (corfu-mode)))

       (define-key corfu-map (kbd "TAB") 'corfu-next)
       (define-key corfu-map (kbd "S-TAB") 'corfu-previous)

       (defun +corfu-beginning-of-prompt ()
         "Move to beginning of completion input."
         (interactive)
         (corfu--goto -1)
         (goto-char (car completion-in-region--data)))

       (defun +corfu-end-of-prompt ()
         "Move to end of completion input."
         (interactive)
         (corfu--goto -1)
         (goto-char (cadr completion-in-region--data)))

       (define-key corfu-map [remap move-beginning-of-line] #'+corfu-beginning-of-prompt)
       (define-key corfu-map [remap move-end-of-line] #'+corfu-end-of-prompt)

       (corfu-global-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-corfu)
        ;;; config-corfu.el ends here
      #+end_src
**** dabbrev
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-dabbrev.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-dabbrev.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'dabbrev)
       (require 'dabbrev)
       (global-set-key (kbd "M-/") 'dabbrev-completion)
       (global-set-key (kbd "C-M-/") 'dabbrev-expand)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-dabbrev)
        ;;; config-dabbrev.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-completion)
      ;;; config-defaults-completion.el ends here
    #+end_src
** Default Tools
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-tools.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-tools.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
     (require 'config-defaults-variables)
   #+end_src
*** erc
