posts/Emacs-Configuration.html
<li><a id="org3204ca6"></a>embark<br>
<div class="outline-text-5" id="text-org3204ca6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-embark.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-embark.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'embark))
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">consult</span>)
  (straight-use-package 'embark-consult))
(<span class="org-keyword">require</span> '<span class="org-constant">embark</span>)
(global-set-key [remap describe-bindings] #'embark-bindings)
(global-set-key (kbd <span class="org-string">"C-c C-."</span>) 'embark-act)
(<span class="org-keyword">setq</span> prefix-help-command #'embark-prefix-help-command)
(add-to-list 'display-buffer-alist
             '(<span class="org-string">"\\`\\*Embark Collect </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">Live</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Completions</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\*"</span>
               nil
               (window-parameters (mode-line-format . none))))
(<span class="org-keyword">when</span> (<span class="org-keyword">featurep</span> '<span class="org-constant">consult</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">embark-consult</span>)
  (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org4ddb9cb"></a>Footer<br>
<div class="outline-text-6" id="text-org4ddb9cb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-embark</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-embark.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org34dcc70"></a>corfu<br>
<div class="outline-text-5" id="text-org34dcc70">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-corfu.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-corfu.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'corfu))
(<span class="org-keyword">require</span> '<span class="org-constant">corfu</span>)
<span class="org-comment-delimiter">;;</span><span class="org-comment">(customize-set-variable 'corfu-cycle t)</span>
(customize-set-variable 'corfu-auto t)
<span class="org-comment-delimiter">;;</span><span class="org-comment">(customize-set-variable 'corfu-preselect-first t)</span>
(customize-set-variable 'corfu-quit-no-match 'separator)
<span class="org-comment-delimiter">;;</span><span class="org-comment">(customize-set-variable 'corfu-separator ?\s)</span>
(<span class="org-keyword">setq</span> completion-cycle-threshold 3
      tab-always-indent 'complete)

(<span class="org-keyword">defun</span> <span class="org-function-name">+corfu-enable-in-minibuffer</span> ()
  <span class="org-doc">"Enable Corfu in the minibuffer if `</span><span class="org-doc"><span class="org-constant">completion-at-point</span></span><span class="org-doc">' is bound."</span>
  (<span class="org-keyword">when</span> (where-is-internal #'completion-at-point (list (current-local-map)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local corfu-auto nil) Enable/disable auto completion</span>
    (corfu-mode 1)))
(add-hook 'minibuffer-setup-hook #'+corfu-enable-in-minibuffer)

(add-hook 'eshell-mode-hook
          (<span class="org-keyword">lambda</span> ()
            (<span class="org-keyword">setq-local</span> corfu-auto nil)
            (corfu-mode)))

(define-key corfu-map (kbd <span class="org-string">"TAB"</span>) 'corfu-next)
(define-key corfu-map (kbd <span class="org-string">"S-TAB"</span>) 'corfu-previous)

(<span class="org-keyword">defun</span> <span class="org-function-name">+corfu-beginning-of-prompt</span> ()
  <span class="org-doc">"Move to beginning of completion input."</span>
  (<span class="org-keyword">interactive</span>)
  (corfu--goto -1)
  (goto-char (car completion-in-region--data)))

(<span class="org-keyword">defun</span> <span class="org-function-name">+corfu-end-of-prompt</span> ()
  <span class="org-doc">"Move to end of completion input."</span>
  (<span class="org-keyword">interactive</span>)
  (corfu--goto -1)
  (goto-char (cadr completion-in-region--data)))

(define-key corfu-map [remap move-beginning-of-line] #'+corfu-beginning-of-prompt)
(define-key corfu-map [remap move-end-of-line] #'+corfu-end-of-prompt)

(corfu-global-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgdf664e7"></a>Footer<br>
<div class="outline-text-6" id="text-orgdf664e7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-corfu</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-corfu.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org5c63579"></a>dabbrev<br>
<div class="outline-text-5" id="text-org5c63579">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-dabbrev.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-dabbrev.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'dabbrev)
(<span class="org-keyword">require</span> '<span class="org-constant">dabbrev</span>)
(global-set-key (kbd <span class="org-string">"M-/"</span>) 'dabbrev-completion)
(global-set-key (kbd <span class="org-string">"C-M-/"</span>) 'dabbrev-expand)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org34d7ff4"></a>Footer<br>
<div class="outline-text-6" id="text-org34d7ff4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-dabbrev</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-dabbrev.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org0c6561f" class="outline-4">
<h4 id="org0c6561f">Footer</h4>
<div class="outline-text-4" id="text-org0c6561f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-completion</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-completion.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
