posts/Emacs-Configuration.org
**** auto connect based on server
     #+begin_src emacs-lisp
       (customize-set-variable 'erc-nick user-login-name)
       (customize-set-variable 'erc-user-full-name user-full-name)

       (defun +erc/libera ()
         (erc-tls :server "irc.libera.chat"
                  :port "6697"))

       (add-hook 'erc-after-connect
                 `(lambda (SERVER NICK)
                    (cond
                     ((string-match "irc\\.libera\\.chat" SERVER)
                      (erc-message "PRIVMSG" (concat "NickServ identify " (password-store-get "irc.libera.chat/alexforsale")))))))
     #+end_src
**** autojoin
     #+begin_src emacs-lisp
       (require 'erc)
       (require 'erc-join)
       (erc-autojoin-mode 1)
       (setq erc-autojoin-channels-alist
             '(("irc.libera.chat" "#emacs" "#emacs-beginners" "gnus" "#archlinux"
                "archlinux-offtopic" "guix" "gentoo" )))
     #+end_src
**** only notify when nick or keywords mentioned.
     #+begin_src emacs-lisp
       (setq erc-current-nick-highlight-type 'nick)
       (setq erc-keywords '("\\berc[-a-z]*\\b" "\\bemms[-a-z]*\\b"))

       (setq erc-track-exclude-types '("JOIN" "PART" "QUIT" "NICK" "MODE"))
       (setq erc-track-use-faces t)
       (setq erc-track-faces-priority-list
             '(erc-current-nick-face erc-keyword-face))
       (setq erc-track-priority-faces-only 'all)
     #+end_src
*** Additional Packages
**** password-store
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-pass.el
     :END:
    #+begin_src emacs-lisp
      ;;; config-defaults-tools.el --- Summary -*- lexical-binding: t -*-
      ;;; Commentary:
      ;; This file is auto-generated from `config.org'
      ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
      ;;; Code:
      (require 'config-defaults-variables)
    #+end_src
    #+begin_src emacs-lisp
      (unless +config/is-guix-system
        (straight-use-package 'pass))
      (setq password-store-password-length 12)
      (auth-source-pass-enable)
    #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-pass)
        ;;; config-pass.el ends here
      #+end_src
**** magit
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-magit.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-magit.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'magit)
         (straight-use-package 'diff-hl))
       (customize-set-variable 'transient-levels-file (expand-file-name "transient/levels.el" +emacs-data-dir))
       (customize-set-variable 'transient-values-file (expand-file-name "transient/values.el" +emacs-data-dir))
       (customize-set-variable 'transient-history-file (expand-file-name "transient/history.el" +emacs-data-dir))
       (require 'magit)
       (require 'diff-hl)
       (transient-append-suffix 'magit-log "a"
         '("w" "Wip" magit-wip-log-current))
       (transient-append-suffix 'magit-log "-A"
         '("-m" "Omit merge commits" "--no-merges"))
       (setq magit-log-arguments '("-n100" "--graph" "--decorate"))
       (add-hook 'magit-pre-refresh-hook #'diff-hl-magit-pre-refresh)
       (add-hook 'magit-post-refresh-hook #'diff-hl-magit-post-refresh)
       (add-hook 'magit-mode-hook #'hl-line-mode)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-magit)
        ;;; config-magit.el ends here
      #+end_src
