posts/Emacs-Configuration.html
<div id="outline-container-orgdcaf028" class="outline-3">
<h3 id="orgdcaf028">Default Tools</h3>
<div class="outline-text-3" id="text-orgdcaf028">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-tools.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-tools.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
</div>
<div id="outline-container-org18a4293" class="outline-4">
<h4 id="org18a4293">erc</h4>
<div class="outline-text-4" id="text-org18a4293">
</div>
<ul class="org-ul">
<li><a id="org37f9716"></a>auto connect based on server<br>
<div class="outline-text-5" id="text-org37f9716">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(customize-set-variable 'erc-nick user-login-name)
(customize-set-variable 'erc-user-full-name user-full-name)

(<span class="org-keyword">defun</span> <span class="org-function-name">+erc/libera</span> ()
  (erc-tls <span class="org-builtin">:server</span> <span class="org-string">"irc.libera.chat"</span>
           <span class="org-builtin">:port</span> <span class="org-string">"6697"</span>))

(add-hook 'erc-after-connect
          `(<span class="org-keyword">lambda</span> (SERVER NICK)
             (<span class="org-keyword">cond</span>
              ((string-match <span class="org-string">"irc\\.libera\\.chat"</span> SERVER)
               (erc-message <span class="org-string">"PRIVMSG"</span> (concat <span class="org-string">"NickServ identify "</span> (password-store-get <span class="org-string">"irc.libera.chat/alexforsale"</span>)))))))
</pre>
</div>
</div>
</li>
<li><a id="orge1dbe54"></a>autojoin<br>
<div class="outline-text-5" id="text-orge1dbe54">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">erc</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">erc-join</span>)
(erc-autojoin-mode 1)
(<span class="org-keyword">setq</span> erc-autojoin-channels-alist
      '((<span class="org-string">"irc.libera.chat"</span> <span class="org-string">"#emacs"</span> <span class="org-string">"#emacs-beginners"</span> <span class="org-string">"gnus"</span> <span class="org-string">"#archlinux"</span>
         <span class="org-string">"archlinux-offtopic"</span> <span class="org-string">"guix"</span> <span class="org-string">"gentoo"</span> )))
</pre>
</div>
</div>
</li>
<li><a id="orgafcd695"></a>only notify when nick or keywords mentioned.<br>
<div class="outline-text-5" id="text-orgafcd695">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> erc-current-nick-highlight-type 'nick)
(<span class="org-keyword">setq</span> erc-keywords '(<span class="org-string">"\\berc[-a-z]*\\b"</span> <span class="org-string">"\\bemms[-a-z]*\\b"</span>))

(<span class="org-keyword">setq</span> erc-track-exclude-types '(<span class="org-string">"JOIN"</span> <span class="org-string">"PART"</span> <span class="org-string">"QUIT"</span> <span class="org-string">"NICK"</span> <span class="org-string">"MODE"</span>))
(<span class="org-keyword">setq</span> erc-track-use-faces t)
(<span class="org-keyword">setq</span> erc-track-faces-priority-list
      '(erc-current-nick-face erc-keyword-face))
(<span class="org-keyword">setq</span> erc-track-priority-faces-only 'all)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfc48812" class="outline-4">
<h4 id="orgfc48812">Additional Packages</h4>
<div class="outline-text-4" id="text-orgfc48812">
</div>
<ul class="org-ul">
<li><a id="orgc3adc1f"></a>password-store<br>
<div class="outline-text-5" id="text-orgc3adc1f">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-pass.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-tools.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'pass))
(<span class="org-keyword">setq</span> password-store-password-length 12)
(auth-source-pass-enable)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgd4bab1e"></a>Footer<br>
<div class="outline-text-6" id="text-orgd4bab1e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-pass</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-pass.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org45e3eae"></a>magit<br>
<div class="outline-text-5" id="text-org45e3eae">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-magit.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-magit.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'magit)
  (straight-use-package 'diff-hl))
(customize-set-variable 'transient-levels-file (expand-file-name <span class="org-string">"transient/levels.el"</span> +emacs-data-dir))
(customize-set-variable 'transient-values-file (expand-file-name <span class="org-string">"transient/values.el"</span> +emacs-data-dir))
(customize-set-variable 'transient-history-file (expand-file-name <span class="org-string">"transient/history.el"</span> +emacs-data-dir))
(<span class="org-keyword">require</span> '<span class="org-constant">magit</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">diff-hl</span>)
(transient-append-suffix 'magit-log <span class="org-string">"a"</span>
  '(<span class="org-string">"w"</span> <span class="org-string">"Wip"</span> magit-wip-log-current))
(transient-append-suffix 'magit-log <span class="org-string">"-A"</span>
  '(<span class="org-string">"-m"</span> <span class="org-string">"Omit merge commits"</span> <span class="org-string">"--no-merges"</span>))
(<span class="org-keyword">setq</span> magit-log-arguments '(<span class="org-string">"-n100"</span> <span class="org-string">"--graph"</span> <span class="org-string">"--decorate"</span>))
(add-hook 'magit-pre-refresh-hook #'diff-hl-magit-pre-refresh)
(add-hook 'magit-post-refresh-hook #'diff-hl-magit-post-refresh)
(add-hook 'magit-mode-hook #'hl-line-mode)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org528e35f"></a>Footer<br>
<div class="outline-text-6" id="text-org528e35f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-magit</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-magit.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
