posts/Emacs-Configuration.org
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-paredit)
        ;;; config-paredit.el ends here
      #+end_src
**** telega
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-telega.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-telega.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
       (require 'config-all-the-icons)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'telega))
       (unless +config/is-guix-system
         (customize-set-variable 'telega-server-libs-prefix "/usr"))
       (customize-set-variable 'telega-directory (expand-file-name "telega/" +emacs-data-dir))
       (customize-set-variable 'telega-options-plist '(:online t :is-location-visible t))
       (customize-set-variable 'telega-my-location '(:latitude -6.241586 :longitude 106.992416))
       (customize-set-variable 'telega-use-image t)
       (customize-set-variable 'telega-voip-allow-p2p t)
       (customize-set-variable 'telega-appindicator-use-label t)
       (customize-set-variable 'telega-active-locations-show-avatars t)
       (customize-set-variable 'telega-appindicator-icon-colors
                               '((offline "#ffffff" "#000000" nil)
                                 (online "#ffffff" "#000000" "#00ff00")
                                 (connecting "gray" "white" "white")))

       (add-hook 'telega-load-hook 'telega-notifications-mode)
       ;; not needed with notification
       ;;(add-hook 'telega-load-hook 'telega-mode-line-mode)
       (add-hook 'telega-load-hook 'telega-appindicator-mode)
       (add-hook 'telega-open-file-hook 'telega-edit-file-mode)
       (add-hook 'telega-load-hook 'telega-my-location-mode)
       ;; needs better keybind
       (add-hook 'telega-load-hook
                 (lambda ()
                   (define-key global-map (kbd "C-c t T") telega-prefix-map)))
       (require 'telega)
       ;; contrib packages
       ;; org-mode links
       (require 'ol-telega)
       (customize-set-variable 'telega-status-history-logs-dir (expand-file-name "telega/history/" +emacs-data-dir))
       (require 'telega-status-history)
       (add-hook 'telega-load-hook 'global-telega-url-shorten-mode)
       (require 'telega-url-shorten)
       (customize-set-variable 'telega-url-shorten-use-images t)
       (require 'telega-mnz)
       (add-hook 'telega-load-hook 'global-telega-mnz-mode)
       (require 'telega-transient)
       (telega-transient-mode 1)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-telega)
        ;;; config-telega.el ends here
      #+end_src
**** emms
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-emms.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-emms.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'emms)
         (straight-use-package 'org-emms))
       (customize-set-variable 'emms-directory (expand-file-name "emms" +emacs-data-dir))
       (customize-set-variable 'emms-player-mpv-update-metadata t)
       (require 'emms-setup)
       (require 'emms-source-file)
       (require 'emms-source-playlist)
       (emms-all)
       (emms-default-players)

       ;; history
       (emms-history-load)
       (setq emms-source-file-default-directory +emms-music-dir
             emms-source-playlist-default-format 'm3u
             emms-playlist-mode-center-when-go t
             emms-playlist-default-major-mode 'emms-playlist-mode
             emms-show-format "NP: %s"
             emms-playlist-buffer-name "*Music*"
             emms-player-mpv-environment '("PULSnE_PROP_media.role=music")
             emms-player-mpv-parameters '("--quiet" "--really-quiet" "--no-audio-display" "--force-window=no" "--vo=null"))
     #+end_src
