posts/Emacs-Configuration.html
<li><a id="org84750ce"></a>Footer<br>
<div class="outline-text-6" id="text-org84750ce">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-paredit</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-paredit.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org160c950"></a>telega<br>
<div class="outline-text-5" id="text-org160c950">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-telega.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-telega.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">config-all-the-icons</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'telega))
(<span class="org-keyword">unless</span> +config/is-guix-system
  (customize-set-variable 'telega-server-libs-prefix <span class="org-string">"/usr"</span>))
(customize-set-variable 'telega-directory (expand-file-name <span class="org-string">"telega/"</span> +emacs-data-dir))
(customize-set-variable 'telega-options-plist '(<span class="org-builtin">:online</span> t <span class="org-builtin">:is-location-visible</span> t))
(customize-set-variable 'telega-my-location '(<span class="org-builtin">:latitude</span> -6.241586 <span class="org-builtin">:longitude</span> 106.992416))
(customize-set-variable 'telega-use-image t)
(customize-set-variable 'telega-voip-allow-p2p t)
(customize-set-variable 'telega-appindicator-use-label t)
(customize-set-variable 'telega-active-locations-show-avatars t)
(customize-set-variable 'telega-appindicator-icon-colors
                        '((offline <span class="org-string">"#ffffff"</span> <span class="org-string">"#000000"</span> nil)
                          (online <span class="org-string">"#ffffff"</span> <span class="org-string">"#000000"</span> <span class="org-string">"#00ff00"</span>)
                          (connecting <span class="org-string">"gray"</span> <span class="org-string">"white"</span> <span class="org-string">"white"</span>)))

(add-hook 'telega-load-hook 'telega-notifications-mode)
<span class="org-comment-delimiter">;; </span><span class="org-comment">not needed with notification</span>
<span class="org-comment-delimiter">;;</span><span class="org-comment">(add-hook 'telega-load-hook 'telega-mode-line-mode)</span>
(add-hook 'telega-load-hook 'telega-appindicator-mode)
(add-hook 'telega-open-file-hook 'telega-edit-file-mode)
(add-hook 'telega-load-hook 'telega-my-location-mode)
<span class="org-comment-delimiter">;; </span><span class="org-comment">needs better keybind</span>
(add-hook 'telega-load-hook
          (<span class="org-keyword">lambda</span> ()
            (define-key global-map (kbd <span class="org-string">"C-c t T"</span>) telega-prefix-map)))
(<span class="org-keyword">require</span> '<span class="org-constant">telega</span>)
<span class="org-comment-delimiter">;; </span><span class="org-comment">contrib packages</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">org-mode links</span>
(<span class="org-keyword">require</span> '<span class="org-constant">ol-telega</span>)
(customize-set-variable 'telega-status-history-logs-dir (expand-file-name <span class="org-string">"telega/history/"</span> +emacs-data-dir))
(<span class="org-keyword">require</span> '<span class="org-constant">telega-status-history</span>)
(add-hook 'telega-load-hook 'global-telega-url-shorten-mode)
(<span class="org-keyword">require</span> '<span class="org-constant">telega-url-shorten</span>)
(customize-set-variable 'telega-url-shorten-use-images t)
(<span class="org-keyword">require</span> '<span class="org-constant">telega-mnz</span>)
(add-hook 'telega-load-hook 'global-telega-mnz-mode)
(<span class="org-keyword">require</span> '<span class="org-constant">telega-transient</span>)
(telega-transient-mode 1)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgadcfdc4"></a>Footer<br>
<div class="outline-text-6" id="text-orgadcfdc4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-telega</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-telega.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orgd920090"></a>emms<br>
<div class="outline-text-5" id="text-orgd920090">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-emms.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-emms.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'emms)
  (straight-use-package 'org-emms))
(customize-set-variable 'emms-directory (expand-file-name <span class="org-string">"emms"</span> +emacs-data-dir))
(customize-set-variable 'emms-player-mpv-update-metadata t)
(<span class="org-keyword">require</span> '<span class="org-constant">emms-setup</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">emms-source-file</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">emms-source-playlist</span>)
(emms-all)
(emms-default-players)

<span class="org-comment-delimiter">;; </span><span class="org-comment">history</span>
(emms-history-load)
(<span class="org-keyword">setq</span> emms-source-file-default-directory +emms-music-dir
      emms-source-playlist-default-format 'm3u
      emms-playlist-mode-center-when-go t
      emms-playlist-default-major-mode 'emms-playlist-mode
      emms-show-format <span class="org-string">"NP: %s"</span>
      emms-playlist-buffer-name <span class="org-string">"*Music*"</span>
      emms-player-mpv-environment '(<span class="org-string">"PULSnE_PROP_media.role=music"</span>)
      emms-player-mpv-parameters '(<span class="org-string">"--quiet"</span> <span class="org-string">"--really-quiet"</span> <span class="org-string">"--no-audio-display"</span> <span class="org-string">"--force-window=no"</span> <span class="org-string">"--vo=null"</span>))
</pre>
</div>
</div>
<ul class="org-ul">
