posts/Emacs-Configuration.org
**** pdf-tools
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-pdf-tools.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-pdf-tools.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (unless +config/is-guix-system
         (straight-use-package 'pdf-tools)
         (pdf-loader-install))
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-pdf-tools)
        ;;; config-pdf-tools.el ends here
      #+end_src
**** gist
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-gist.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-gist.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'gist)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-gist)
        ;;; config-gist.el ends here
      #+end_src
**** ripgrep
     :PROPERTIES:
     :header-args: :tangle ~/.config/emacs/modules/config-ripgrep.el
     :END:
     #+begin_src emacs-lisp
       ;;; config-ripgrep.el --- Summary -*- lexical-binding: t -*-
       ;;; Commentary:
       ;; This file is auto-generated from `config.org'
       ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
       ;;; Code:
       (require 'config-defaults-variables)
     #+end_src
     #+begin_src emacs-lisp
       (straight-use-package 'ripgrep)
     #+end_src
***** Footer
      #+begin_src emacs-lisp
        (provide 'config-ripgrep)
        ;;; config-ripgrep.el ends here
      #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-tools)
      ;;; config-defaults-tools.el ends here
    #+end_src
** Various other defaults
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-various.el :mkdirp t
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-editings.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
   #+end_src
*** =desktop-save-mode=
    #+begin_src emacs-lisp
      (eval-after-load 'desktop
        `(make-directory ,(expand-file-name "desktop/" +emacs-data-dir) t))
      (setq desktop-dirname (expand-file-name "desktop/" +emacs-data-dir))
      (setq desktop-path (list desktop-dirname))
    #+end_src
*** Browser
    #+begin_src emacs-lisp
      (setq browse-url-generic-program "xdg-open")
    #+end_src
*** calendar and diary
    #+begin_src emacs-lisp
      (require 'calendar)
      (setq diary-file "~/Documents/google-drive/Notes/diary")
      (add-hook 'diary-list-entries-hook 'diary-sort-entries t)
      (setq calendar-intermonth-spacing 1)
    #+end_src
*** calc file
    #+begin_src emacs-lisp
      (setq calc-settings-file (expand-file-name "calc-settings.el" +emacs-data-dir))
    #+end_src
*** ecomplete database
    #+begin_src emacs-lisp
      (setq ecomplete-database-file (expand-file-name "ecomplete-database.el" +emacs-data-dir))
    #+end_src
*** ede cache file
    #+begin_src emacs-lisp
      (setq ede-project-placeholder-cache-file (expand-file-name "ede-projects.el" +emacs-data-dir))
    #+end_src
*** =erc=
    #+begin_src emacs-lisp
      (eval-after-load 'erc
        `(make-directory ,(expand-file-name "erc/dcc/" +emacs-data-dir) t))
      (setq erc-dcc-get-default-directory    (expand-file-name "erc/dcc/" +emacs-data-dir))
      (setq erc-log-channels-directory       (expand-file-name "erc/log-channels/" +emacs-data-dir))
    #+end_src
*** =eshell=
    #+begin_src emacs-lisp
      (eval-after-load 'eshell
        `(make-directory ,(expand-file-name "eshell/" +emacs-data-dir) t))
      (setq eshell-aliases-file              (expand-file-name "eshell/aliases" +emacs-data-dir))
      (setq eshell-directory-name            (expand-file-name "eshell/" +emacs-data-dir))
    #+end_src
*** eudc
    #+begin_src emacs-lisp
      (setq eudc-options-file (expand-file-name "eudc-options.el" +emacs-data-dir))
    #+end_src
