posts/Emacs-Configuration.html
<li><a id="orgf305458"></a>pdf-tools<br>
<div class="outline-text-5" id="text-orgf305458">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-pdf-tools.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-pdf-tools.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">unless</span> +config/is-guix-system
  (straight-use-package 'pdf-tools)
  (pdf-loader-install))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orga9af01e"></a>Footer<br>
<div class="outline-text-6" id="text-orga9af01e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-pdf-tools</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-pdf-tools.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orga4ca90c"></a>gist<br>
<div class="outline-text-5" id="text-orga4ca90c">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-gist.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-gist.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'gist)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1a5467a"></a>Footer<br>
<div class="outline-text-6" id="text-org1a5467a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-gist</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-gist.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org40df3d6"></a>ripgrep<br>
<div class="outline-text-5" id="text-org40df3d6">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-ripgrep.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ripgrep.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">config-defaults-variables</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'ripgrep)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org8a943aa"></a>Footer<br>
<div class="outline-text-6" id="text-org8a943aa">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-ripgrep</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-ripgrep.el ends here</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org3c042dd" class="outline-4">
<h4 id="org3c042dd">Footer</h4>
<div class="outline-text-4" id="text-org3c042dd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-tools</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-tools.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaed2074" class="outline-3">
<h3 id="orgaed2074">Various other defaults</h3>
<div class="outline-text-3" id="text-orgaed2074">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-various.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-editings.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
<div id="outline-container-org6327bfe" class="outline-4">
<h4 id="org6327bfe"><code>desktop-save-mode</code></h4>
<div class="outline-text-4" id="text-org6327bfe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'desktop
  `(make-directory ,(expand-file-name <span class="org-string">"desktop/"</span> +emacs-data-dir) t))
(<span class="org-keyword">setq</span> desktop-dirname (expand-file-name <span class="org-string">"desktop/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> desktop-path (list desktop-dirname))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e9bad1" class="outline-4">
<h4 id="org0e9bad1">Browser</h4>
<div class="outline-text-4" id="text-org0e9bad1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> browse-url-generic-program <span class="org-string">"xdg-open"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9883651" class="outline-4">
<h4 id="org9883651">calendar and diary</h4>
<div class="outline-text-4" id="text-org9883651">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">calendar</span>)
(<span class="org-keyword">setq</span> diary-file <span class="org-string">"~/Documents/google-drive/Notes/diary"</span>)
(add-hook 'diary-list-entries-hook 'diary-sort-entries t)
(<span class="org-keyword">setq</span> calendar-intermonth-spacing 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcebcce2" class="outline-4">
<h4 id="orgcebcce2">calc file</h4>
<div class="outline-text-4" id="text-orgcebcce2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> calc-settings-file (expand-file-name <span class="org-string">"calc-settings.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb4135d" class="outline-4">
<h4 id="orgfb4135d">ecomplete database</h4>
<div class="outline-text-4" id="text-orgfb4135d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> ecomplete-database-file (expand-file-name <span class="org-string">"ecomplete-database.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b18c95" class="outline-4">
<h4 id="org1b18c95">ede cache file</h4>
<div class="outline-text-4" id="text-org1b18c95">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> ede-project-placeholder-cache-file (expand-file-name <span class="org-string">"ede-projects.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf750452" class="outline-4">
<h4 id="orgf750452"><code>erc</code></h4>
<div class="outline-text-4" id="text-orgf750452">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'erc
  `(make-directory ,(expand-file-name <span class="org-string">"erc/dcc/"</span> +emacs-data-dir) t))
(<span class="org-keyword">setq</span> erc-dcc-get-default-directory    (expand-file-name <span class="org-string">"erc/dcc/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> erc-log-channels-directory       (expand-file-name <span class="org-string">"erc/log-channels/"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga14f3b9" class="outline-4">
<h4 id="orga14f3b9"><code>eshell</code></h4>
<div class="outline-text-4" id="text-orga14f3b9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'eshell
  `(make-directory ,(expand-file-name <span class="org-string">"eshell/"</span> +emacs-data-dir) t))
(<span class="org-keyword">setq</span> eshell-aliases-file              (expand-file-name <span class="org-string">"eshell/aliases"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> eshell-directory-name            (expand-file-name <span class="org-string">"eshell/"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7692fa1" class="outline-4">
<h4 id="org7692fa1">eudc</h4>
<div class="outline-text-4" id="text-org7692fa1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> eudc-options-file (expand-file-name <span class="org-string">"eudc-options.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
