posts/Emacs-Configuration.org
*** =eww=
    #+begin_src emacs-lisp
      (with-eval-after-load 'eww
        `(make-directory ,(expand-file-name "eww/" +emacs-data-dir) t)
        (setq eww-bookmarks-directory (expand-file-name "eww/" +emacs-data-dir)))
    #+end_src
*** =gnus=
    #+begin_src emacs-lisp
      (with-eval-after-load 'gnus
        `(make-directory ,(expand-file-name "gnus/dribble/" +emacs-data-dir) t)
        (setq gnus-dribble-directory (expand-file-name "gnus/dribble/" +emacs-data-dir))
        (setq gnus-init-file (expand-file-name "gnus/init.el" +emacs-data-dir)))
    #+end_src
*** =ido=
    #+begin_src emacs-lisp
      (eval-after-load 'ido
        (setq ido-save-directory-list-file (expand-file-name "ido-save-directory-list.el" +emacs-data-dir)))
    #+end_src
*** =dired=
    #+begin_src emacs-lisp
      (with-eval-after-load 'dired
        (setq image-dired-db-file (expand-file-name "image-dired/db.el" +emacs-data-dir))
        (setq image-dired-dir (expand-file-name "image-dired/" +emacs-data-dir))
        (setq image-dired-gallery-dir (expand-file-name "image-dired/gallery/" +emacs-data-dir))
        (setq image-dired-temp-image-file (expand-file-name "image-dired/temp-image" +emacs-data-dir))
        (setq image-dired-temp-rotate-image-file (expand-file-name "image-dired/temp-rotate-image" +emacs-data-dir)))
    #+end_src
*** =newsticker=
    #+begin_src emacs-lisp
      (with-eval-after-load 'newsticker
        `(make-directory ,(expand-file-name "newsticker/" +emacs-data-dir) t)
        (setq newsticker-cache-filename (expand-file-name "newsticker/cache.el" +emacs-data-dir))
        (setq newsticker-dir (expand-file-name "newsticker/data/" +emacs-data-dir)))
    #+end_src
*** =nsm=
    #+begin_src emacs-lisp
      (eval-after-load 'nsm
        (setq nsm-settings-file (expand-file-name "nsm-settings.el" +emacs-data-dir)))
    #+end_src
*** =tramp=
    #+begin_src emacs-lisp
      (setq tramp-auto-save-directory (expand-file-name "tramp/auto-save/" +emacs-data-dir))
      (setq tramp-persistency-file-name (expand-file-name "tramp/persistency.el" +emacs-data-dir))
    #+end_src
*** =shadowfile=
    #+begin_src emacs-lisp
      (with-eval-after-load 'shadowfile
        `(make-directory ,(expand-file-name "shadow/" +emacs-data-dir) t)
        (setq shadow-info-file (expand-file-name "shadow/info.el" +emacs-data-dir))
        (setq shadow-todo-file (expand-file-name "shadow/todo.el" +emacs-data-dir)))
    #+end_src
*** =url=
    #+begin_src emacs-lisp
      (with-eval-after-load 'url
        (setq url-cache-directory (expand-file-name "url/cache/" +emacs-data-dir))
        (setq url-configuration-directory (expand-file-name "url/" +emacs-data-dir))
        (setq url-cookie-file (expand-file-name "url/cookies.el" +emacs-data-dir))
        (setq url-history-file (expand-file-name "url/history.el" +emacs-data-dir)))
    #+end_src
*** =remember=
    #+begin_src emacs-lisp
      (with-eval-after-load 'remember
        (setq remember-data-file (expand-file-name "remember/data" +emacs-data-dir))
        (setq remember-data-directory (expand-file-name "remember/data.d/" +emacs-data-dir)))
    #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-various)
      ;;; config-defaults-various.el ends here
    #+end_src
** Defaults keybindings
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/modules/config-defaults-keybindings.el
   :END:
   #+begin_src emacs-lisp
     ;;; config-defaults-keybindings.el --- Summary -*- lexical-binding: t -*-
     ;;; Commentary:
     ;; This file is auto-generated from `config.org'
     ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
     ;;; Code:
   #+end_src
*** recentf
    Previously unbound
    #+begin_src emacs-lisp
      (global-set-key (kbd "C-x M-f") 'recentf-open-files)
    #+end_src
*** Footer
    #+begin_src emacs-lisp
      (provide 'config-defaults-keybindings)
      ;;; config-defaults-keybindings.el ends here
    #+end_src
* site-lisp
** website
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/site-lisp/websites.el :mkdirp t
   :END:
   Configuration for org-generated website, this is basically from my [[https://git.java281.dynv6.net/alexforsale/java281.dynv6.net][website]] =publish.el=.
*** commented header
    #+begin_src emacs-lisp
      ;;; websites.el --- org-publish configurations
      ;;
      ;;; Commentary:
      ;; This file is auto-generated from `config.org'
      ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
      ;; I will try to avoid any hardcoded variables here.
      ;;; Code:
    #+end_src
*** required packages
    Most of these already built-in except for /reveal/
    #+begin_src emacs-lisp
      (require 'org)
      (require 'ox-html)
      (require 'ox-publish)
      (require 'ox-rss)
      (straight-use-package 'ox-reveal)
      (require 'ox-reveal)
      (straight-use-package 'htmlize)
      (require 'htmlize)
    #+end_src
