posts/Emacs-Configuration.html
<div id="outline-container-org42fb465" class="outline-4">
<h4 id="org42fb465"><code>eww</code></h4>
<div class="outline-text-4" id="text-org42fb465">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'eww
  `(make-directory ,(expand-file-name <span class="org-string">"eww/"</span> +emacs-data-dir) t)
  (<span class="org-keyword">setq</span> eww-bookmarks-directory (expand-file-name <span class="org-string">"eww/"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6b76a8" class="outline-4">
<h4 id="orgf6b76a8"><code>gnus</code></h4>
<div class="outline-text-4" id="text-orgf6b76a8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'gnus
  `(make-directory ,(expand-file-name <span class="org-string">"gnus/dribble/"</span> +emacs-data-dir) t)
  (<span class="org-keyword">setq</span> gnus-dribble-directory (expand-file-name <span class="org-string">"gnus/dribble/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> gnus-init-file (expand-file-name <span class="org-string">"gnus/init.el"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6b7636" class="outline-4">
<h4 id="orgf6b7636"><code>ido</code></h4>
<div class="outline-text-4" id="text-orgf6b7636">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'ido
  (<span class="org-keyword">setq</span> ido-save-directory-list-file (expand-file-name <span class="org-string">"ido-save-directory-list.el"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4331802" class="outline-4">
<h4 id="org4331802"><code>dired</code></h4>
<div class="outline-text-4" id="text-org4331802">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'dired
  (<span class="org-keyword">setq</span> image-dired-db-file (expand-file-name <span class="org-string">"image-dired/db.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> image-dired-dir (expand-file-name <span class="org-string">"image-dired/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> image-dired-gallery-dir (expand-file-name <span class="org-string">"image-dired/gallery/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> image-dired-temp-image-file (expand-file-name <span class="org-string">"image-dired/temp-image"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> image-dired-temp-rotate-image-file (expand-file-name <span class="org-string">"image-dired/temp-rotate-image"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org99be61d" class="outline-4">
<h4 id="org99be61d"><code>newsticker</code></h4>
<div class="outline-text-4" id="text-org99be61d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'newsticker
  `(make-directory ,(expand-file-name <span class="org-string">"newsticker/"</span> +emacs-data-dir) t)
  (<span class="org-keyword">setq</span> newsticker-cache-filename (expand-file-name <span class="org-string">"newsticker/cache.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> newsticker-dir (expand-file-name <span class="org-string">"newsticker/data/"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5bef7ce" class="outline-4">
<h4 id="org5bef7ce"><code>nsm</code></h4>
<div class="outline-text-4" id="text-org5bef7ce">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'nsm
  (<span class="org-keyword">setq</span> nsm-settings-file (expand-file-name <span class="org-string">"nsm-settings.el"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5cad1b" class="outline-4">
<h4 id="orga5cad1b"><code>tramp</code></h4>
<div class="outline-text-4" id="text-orga5cad1b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> tramp-auto-save-directory (expand-file-name <span class="org-string">"tramp/auto-save/"</span> +emacs-data-dir))
(<span class="org-keyword">setq</span> tramp-persistency-file-name (expand-file-name <span class="org-string">"tramp/persistency.el"</span> +emacs-data-dir))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a3ad93" class="outline-4">
<h4 id="org8a3ad93"><code>shadowfile</code></h4>
<div class="outline-text-4" id="text-org8a3ad93">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'shadowfile
  `(make-directory ,(expand-file-name <span class="org-string">"shadow/"</span> +emacs-data-dir) t)
  (<span class="org-keyword">setq</span> shadow-info-file (expand-file-name <span class="org-string">"shadow/info.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> shadow-todo-file (expand-file-name <span class="org-string">"shadow/todo.el"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org077448a" class="outline-4">
<h4 id="org077448a"><code>url</code></h4>
<div class="outline-text-4" id="text-org077448a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'url
  (<span class="org-keyword">setq</span> url-cache-directory (expand-file-name <span class="org-string">"url/cache/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> url-configuration-directory (expand-file-name <span class="org-string">"url/"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> url-cookie-file (expand-file-name <span class="org-string">"url/cookies.el"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> url-history-file (expand-file-name <span class="org-string">"url/history.el"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org95361f5" class="outline-4">
<h4 id="org95361f5"><code>remember</code></h4>
<div class="outline-text-4" id="text-org95361f5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'remember
  (<span class="org-keyword">setq</span> remember-data-file (expand-file-name <span class="org-string">"remember/data"</span> +emacs-data-dir))
  (<span class="org-keyword">setq</span> remember-data-directory (expand-file-name <span class="org-string">"remember/data.d/"</span> +emacs-data-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org70a035a" class="outline-4">
<h4 id="org70a035a">Footer</h4>
<div class="outline-text-4" id="text-org70a035a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-various</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-various.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga5832e8" class="outline-3">
<h3 id="orga5832e8">Defaults keybindings</h3>
<div class="outline-text-3" id="text-orga5832e8">
<pre class="example">
header-args: :tangle (expand-file-name "modules/config-defaults-keybindings.el" user-emacs-directory)
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-keybindings.el --- Summary -*- lexical-binding: t -*-</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
<div id="outline-container-org8c55352" class="outline-4">
<h4 id="org8c55352">recentf</h4>
<div class="outline-text-4" id="text-org8c55352">
<p>
Previously unbound
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-x M-f"</span>) 'recentf-open-files)
</pre>
</div>
</div>
</div>
<div id="outline-container-org50df6ef" class="outline-4">
<h4 id="org50df6ef">Footer</h4>
<div class="outline-text-4" id="text-org50df6ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">config-defaults-keybindings</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">config-defaults-keybindings.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
</section>
<section id="outline-container-org53134d3" class="outline-2">
<h2 id="org53134d3">site-lisp</h2>
<div class="outline-text-2" id="text-org53134d3">
</div>
<div id="outline-container-org98caf93" class="outline-3">
<h3 id="org98caf93">website</h3>
<div class="outline-text-3" id="text-org98caf93">
<pre class="example">
header-args: :tangle (expand-file-name "site-lisp/websites.el" user-emacs-directory) :mkdirp t
</pre>
<p>
Configuration for org-generated website, this is basically from my <a href="https://git.java281.dynv6.net/alexforsale/java281.dynv6.net">website</a> <code>publish.el</code>.
</p>
</div>
<div id="outline-container-org3a2a986" class="outline-4">
<h4 id="org3a2a986">commented header</h4>
<div class="outline-text-4" id="text-org3a2a986">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">websites.el --- org-publish configurations</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">I will try to avoid any hardcoded variables here.</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
</div>
