posts/Emacs-Configuration.org
*** Setup org-export
    #+begin_src emacs-lisp
      (setq org-export-with-section-numbers nil
            org-export-with-smart-quotes t
            org-export-with-toc nil)
    #+end_src
*** define =this-date-format= variable
    #+begin_src emacs-lisp
      (defvar this-date-format "%b %d, %Y")
    #+end_src
*** Setup the html stuffs
    #+begin_src emacs-lisp
      (setq org-html-divs '((preamble "header" "top")
                            (content "main" "content")
                            (postamble "footer" "postamble"))
            org-html-container-element "section"
            org-html-metadata-timestamp-format this-date-format
            org-html-checkbox-type 'html
            org-html-html5-fancy t
            org-html-validation-link t
            org-html-doctype "html5"
            org-html-htmlize-output-type 'css)
    #+end_src
*** Create custom variable for html-head
    #+begin_src emacs-lisp
      (defvar me/website-html-head
        "<link rel='icon' type='image/x-icon' href='/images/favicon.jpg'/>
      <meta name='viewport' content='width=device-width, initial-scale=1'>
      <link rel='stylesheet' href='https://code.cdn.mozilla.net/fonts/fira.css'>
      <link rel='stylesheet' href='/css/site.css?v=2' type='text/css'/>
      <link rel='stylesheet' href='/css/custom.css' type='text/css'/>
      <link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>")
    #+end_src
*** Pre/Post amble
    #+begin_src emacs-lisp
      (defun +website/website-html-preamble (plist)
        "PLIST: An entry."
        (if (org-export-get-date plist this-date-format)
            (plist-put plist
                       :subtitle (format "Published on %s by %s."
                                         (org-export-get-date plist this-date-format)
                                         (car (plist-get plist :author)))))
        ;; Preamble
        (with-temp-buffer
          (insert-file-contents
           (expand-file-name
            "html-templates/preamble.html"
            +website-directory)) (buffer-string)))

      (defun +website/website-html-postamble (plist)
        "PLIST."
        (concat (format
                 (with-temp-buffer
                   (insert-file-contents
                    (expand-file-name
                     "html-templates/postamble.html"
                     +website-directory)) (buffer-string))
                 (format-time-string this-date-format
                                     (plist-get plist :time))
                 (plist-get plist :creator))))
    #+end_src
*** =site-attachment= variable
    #+begin_src emacs-lisp
      (defvar site-attachments
        (regexp-opt '("jpg" "jpeg" "gif" "png" "svg"
                      "ico" "cur" "css" "js" "woff" "html" "pdf" "txt"))
        "File types that are published as static files.")
    #+end_src
*** =me/org-sitemap-format-entry= function
    #+begin_src emacs-lisp
      (defun me/org-sitemap-format-entry (entry style project)
        "Format posts with author and published data in the index page.

      ENTRY: file-name
      STYLE:
      PROJECT: `posts in this case."
        (cond ((not (directory-name-p entry))
               (format "*[[file:%s][%s]]*
                       ,#+HTML: <p class='pubdate'>by %s on %s.</p>"
                       entry
                       (org-publish-find-title entry project)
                       (car (org-publish-find-property entry :author project))
                       (format-time-string this-date-format
                                           (org-publish-find-date entry project))))
              ((eq style 'tree) (file-name-nondirectory (directory-file-name entry)))
              (t entry)))
    #+end_src
*** =+publish-root= variable
    #+begin_src emacs-lisp
      (defvar +website-publish-root (if (boundp '+publish-as-user)
                              (concat "/~" user-login-name "/")
                            "/"))
    #+end_src
*** reveal stuffs
    Currently unused, I'll keep this for now just in case.
    #+begin_src emacs-lisp
      (defun me/org-reveal-publish-to-html (plist filename pub-dir)
        "Publish an org file to reveal.js HTML Presentation.
      FILENAME is the filename of the Org file to be published.  PLIST
      is the property list for the given project.  PUB-DIR is the
      publishing directory. Returns output file name."
        (let ((org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))
          (org-publish-org-to 'reveal filename ".html" plist pub-dir)))
    #+end_src
*** The =+website-directory= variable
    This is where the /website/ /org/ directory placed.
    #+begin_src emacs-lisp
      (defvar +website-directory
        (expand-file-name "website/" org-directory)
        "Location of the website directory.")
    #+end_src
*** =+website-url= variable
    #+begin_src emacs-lisp
      (defvar +website-url "https://java281.dynv6.net"
        "The url for the website.")
    #+end_src
