posts/Emacs-Configuration.html
<div id="outline-container-orgc04e14e" class="outline-4">
<h4 id="orgc04e14e">required packages</h4>
<div class="outline-text-4" id="text-orgc04e14e">
<p>
Most of these already built-in except for <i>reveal</i>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-html</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-rss</span>)
(straight-use-package 'ox-reveal)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-reveal</span>)
(straight-use-package 'htmlize)
(<span class="org-keyword">require</span> '<span class="org-constant">htmlize</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7dd038" class="outline-4">
<h4 id="orgb7dd038">Setup org-export</h4>
<div class="outline-text-4" id="text-orgb7dd038">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-export-with-section-numbers nil
      org-export-with-smart-quotes t
      org-export-with-toc nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org874994c" class="outline-4">
<h4 id="org874994c">define <code>this-date-format</code> variable</h4>
<div class="outline-text-4" id="text-org874994c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">this-date-format</span> <span class="org-string">"%b %d, %Y"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf6853c" class="outline-4">
<h4 id="orgcf6853c">Setup the html stuffs</h4>
<div class="outline-text-4" id="text-orgcf6853c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-html-divs '((preamble <span class="org-string">"header"</span> <span class="org-string">"top"</span>)
                      (content <span class="org-string">"main"</span> <span class="org-string">"content"</span>)
                      (postamble <span class="org-string">"footer"</span> <span class="org-string">"postamble"</span>))
      org-html-container-element <span class="org-string">"section"</span>
      org-html-metadata-timestamp-format this-date-format
      org-html-checkbox-type 'html
      org-html-html5-fancy t
      org-html-validation-link t
      org-html-doctype <span class="org-string">"html5"</span>
      org-html-htmlize-output-type 'css)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2a2258" class="outline-4">
<h4 id="orgf2a2258">Create custom variable for html-head</h4>
<div class="outline-text-4" id="text-orgf2a2258">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">me/website-html-head</span>
  <span class="org-string">"&lt;link rel='icon' type='image/x-icon' href='/images/favicon.jpg'/&gt;</span>
<span class="org-string">&lt;meta name='viewport' content='width=device-width, initial-scale=1'&gt;</span>
<span class="org-string">&lt;link rel='stylesheet' href='https://code.cdn.mozilla.net/fonts/fira.css'&gt;</span>
<span class="org-string">&lt;link rel='stylesheet' href='/css/site.css?v=2' type='text/css'/&gt;</span>
<span class="org-string">&lt;link rel='stylesheet' href='/css/custom.css' type='text/css'/&gt;</span>
<span class="org-string">&lt;link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/&gt;"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org73e5d3f" class="outline-4">
<h4 id="org73e5d3f">Pre/Post amble</h4>
<div class="outline-text-4" id="text-org73e5d3f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">+website/website-html-preamble</span> (plist)
  <span class="org-doc">"PLIST: An entry."</span>
  (<span class="org-keyword">if</span> (org-export-get-date plist this-date-format)
      (plist-put plist
                 <span class="org-builtin">:subtitle</span> (format <span class="org-string">"Published on %s by %s."</span>
                                   (org-export-get-date plist this-date-format)
                                   (car (plist-get plist <span class="org-builtin">:author</span>)))))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Preamble</span>
  (<span class="org-keyword">with-temp-buffer</span>
    (insert-file-contents
     (expand-file-name
      <span class="org-string">"html-templates/preamble.html"</span>
      +website-directory)) <span class="org-warning">(buffer-string)))</span>

(<span class="org-keyword">defun</span> <span class="org-function-name">+website/website-html-postamble</span> (plist)
  <span class="org-doc">"PLIST."</span>
  (concat (format
           (<span class="org-keyword">with-temp-buffer</span>
             (insert-file-contents
              (expand-file-name
               <span class="org-string">"html-templates/postamble.html"</span>
               +website-directory)) <span class="org-warning">(buffer-string))</span>
           (format-time-string this-date-format
                               (plist-get plist <span class="org-builtin">:time</span>))
           (plist-get plist <span class="org-builtin">:creator</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d54e46" class="outline-4">
<h4 id="org1d54e46"><code>site-attachment</code> variable</h4>
<div class="outline-text-4" id="text-org1d54e46">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">site-attachments</span>
  (regexp-opt '(<span class="org-string">"jpg"</span> <span class="org-string">"jpeg"</span> <span class="org-string">"gif"</span> <span class="org-string">"png"</span> <span class="org-string">"svg"</span>
                <span class="org-string">"ico"</span> <span class="org-string">"cur"</span> <span class="org-string">"css"</span> <span class="org-string">"js"</span> <span class="org-string">"woff"</span> <span class="org-string">"html"</span> <span class="org-string">"pdf"</span> <span class="org-string">"txt"</span>))
  <span class="org-doc">"File types that are published as static files."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9ef658" class="outline-4">
<h4 id="orgf9ef658"><code>me/org-sitemap-format-entry</code> function</h4>
<div class="outline-text-4" id="text-orgf9ef658">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">me/org-sitemap-format-entry</span> (entry style project)
  <span class="org-doc">"Format posts with author and published data in the index page.</span>

<span class="org-doc">ENTRY: file-name</span>
<span class="org-doc">STYLE:</span>
<span class="org-doc">PROJECT: `posts in this case."</span>
  (<span class="org-keyword">cond</span> ((not (directory-name-p entry))
         (format <span class="org-string">"*[[file:%s][%s]]*</span>
<span class="org-string">                 #+HTML: &lt;p class='pubdate'&gt;by %s on %s.&lt;/p&gt;"</span>
                 entry
                 (org-publish-find-title entry project)
                 (car (org-publish-find-property entry <span class="org-builtin">:author</span> project))
                 (format-time-string this-date-format
                                     (org-publish-find-date entry project))))
        ((eq style 'tree) (file-name-nondirectory (directory-file-name entry)))
        (t entry)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a1bc71" class="outline-4">
<h4 id="org7a1bc71"><code>+publish-root</code> variable</h4>
<div class="outline-text-4" id="text-org7a1bc71">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+website-publish-root</span> (<span class="org-keyword">if</span> (boundp '+publish-as-user)
                        (concat <span class="org-string">"/~"</span> user-login-name <span class="org-string">"/"</span>)
                      <span class="org-string">"/"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd00bb4" class="outline-4">
<h4 id="orgdd00bb4">reveal stuffs</h4>
<div class="outline-text-4" id="text-orgdd00bb4">
<p>
Currently unused, I&rsquo;ll keep this for now just in case.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">me/org-reveal-publish-to-html</span> (plist filename pub-dir)
  <span class="org-doc">"Publish an org file to reveal.js HTML Presentation.</span>
<span class="org-doc">FILENAME is the filename of the Org file to be published.  PLIST</span>
<span class="org-doc">is the property list for the given project.  PUB-DIR is the</span>
<span class="org-doc">publishing directory. Returns output file name."</span>
  (<span class="org-keyword">let</span> ((org-reveal-root <span class="org-string">"https://cdn.jsdelivr.net/npm/reveal.js"</span>))
    (org-publish-org-to 'reveal filename <span class="org-string">".html"</span> plist pub-dir)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdac26ef" class="outline-4">
<h4 id="orgdac26ef">The <code>+website-directory</code> variable</h4>
<div class="outline-text-4" id="text-orgdac26ef">
<p>
This is where the <i>website</i> <i>org</i> directory placed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+website-directory</span>
  (expand-file-name <span class="org-string">"website/"</span> org-directory)
  <span class="org-doc">"Location of the website directory."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2416cc" class="outline-4">
<h4 id="orge2416cc"><code>+website-url</code> variable</h4>
<div class="outline-text-4" id="text-orge2416cc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+website-url</span> <span class="org-string">"https://java281.dynv6.net"</span>
  <span class="org-doc">"The url for the website."</span>)
</pre>
</div>
</div>
</div>
