posts/Emacs-Configuration.org
*** =+website-publish-directory=
    #+begin_src emacs-lisp
      (defvar +website-publish-directory "/srv/http"
        "Location to serve the website.")
    #+end_src
*** =org-publish-project-alist=
    The meat of this configuration.
    #+begin_src emacs-lisp
      (setq org-publish-project-alist
            `(("website-posts"
               :base-directory ,(expand-file-name "posts/" +website-directory)
               :base-extension "org"
               :recursive t
               :publishing-function org-html-publish-to-html
               :publishing-directory ,(expand-file-name "posts" +website-publish-directory)
               :exclude ,(regexp-opt '("README.org" "draft" "404.org"))
               :auto-sitemap t
               :sitemap-filename "index.org"
               :sitemap-title "Index"
               :sitemap-format-entry me/org-sitemap-format-entry
               :sitemap-style list
               :sitemap-sort-files anti-chronologically
               :html-link-home ,+website-publish-root
               :html-link-up ,+website-publish-root
               :html-head-include-scripts t
               :html-head-include-default-style nil
               :html-head ,me/website-html-head
               :html-preamble +website/website-html-preamble
               :html-postamble +website/website-html-postamble)
              ("website-pages"
               :base-directory ,+website-directory
               :base-extension "org"
               :exclude ,(regexp-opt '("README.org" "draft" "404.org" "template.org"))
               :recursive nil
               :publishing-function org-html-publish-to-html
               :publishing-directory ,+website-publish-directory
               :html-link-home ,+website-publish-root
               :html-link-up ,+website-publish-root
               :auto-sitemap nil
               :html-head-include-scripts t
               :html-head-include-default-style nil
               :html-head ,me/website-html-head
               :html-preamble +website/website-html-preamble
               :html-postamble +website/website-html-postamble)
              ("website-css"
               :base-directory ,(expand-file-name "css/" +website-directory)
               :base-extension "css"
               :publishing-directory ,(expand-file-name "css/" +website-publish-directory)
               :publishing-function org-publish-attachment
               :recursive t)
              ("website-images"
               :base-directory ,(expand-file-name "images/" +website-directory)
               :base-extension ,site-attachments
               :publishing-directory ,(expand-file-name "images/" +website-publish-directory)
               :publishing-function org-publish-attachment
               :recursive t)
              ("website-assets"
               :base-directory ,(expand-file-name "assets/" +website-directory)
               :base-extension ,site-attachments
               :publishing-directory ,(expand-file-name "assets/" +website-publish-directory)
               :publishing-function org-publish-attachment
               :recursive t)
              ("website-rss"
               :base-directory ,(expand-file-name "posts/" +website-directory)
               :base-extension "org"
               :html-link-home ,+website-url
               :rss-link-home ,+website-url
               :html-link-use-abs-url t
               :rss-extension "xml"
               :publishing-directory ,+website-publish-directory
               :publishing-function (org-rss-publish-to-rss)
               :section-number nil
               :exclude ".*"
               :include ("index.org")
               :table-of-contents nil)
              ("website" :components ("website-posts"
                                      "website-pages"
                                      "website-css"
                                      "website-images"
                                      "website-assets"
                                      "website-rss"))))
    #+end_src
*** the footer
    #+begin_src emacs-lisp
       (provide 'websites)
       ;;; websites.el ends here
     #+end_src
** blog
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/site-lisp/blog.el :mkdirp t
   :END:
   Configuration for org-generated blog.
*** commented header
    #+begin_src emacs-lisp
      ;;; blog.el --- org-publish configurations
      ;;
      ;;; Commentary:
      ;; This file is auto-generated from `config.org'
      ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
      ;; I will try to avoid any hardcoded variables here.
      ;;; Code:
    #+end_src
*** required packages
    Most of these already built-in except for /reveal/
    #+begin_src emacs-lisp
      (require 'org)
      (require 'ox-html)
      (require 'ox-publish)
      (require 'ox-rss)
      (straight-use-package 'ox-reveal)
      (require 'ox-reveal)
      (straight-use-package 'htmlize)
      (require 'htmlize)
    #+end_src
*** Setup org-export
    #+begin_src emacs-lisp
      (setq org-export-with-section-numbers nil
            org-export-with-smart-quotes t
            org-export-with-toc nil)
    #+end_src
*** define =this-date-format= variable
    #+begin_src emacs-lisp
      (defvar this-date-format "%b %d, %Y")
    #+end_src
*** Setup the html stuffs
    #+begin_src emacs-lisp
      (setq org-html-divs '((preamble "header" "top")
                            (content "main" "content")
                            (postamble "footer" "postamble"))
            org-html-container-element "section"
            org-html-metadata-timestamp-format this-date-format
            org-html-checkbox-type 'html
            org-html-html5-fancy t
            org-html-validation-link t
            org-html-doctype "html5"
            org-html-htmlize-output-type 'css)
    #+end_src
