posts/Emacs-Configuration.html
<div id="outline-container-org6736033" class="outline-4">
<h4 id="org6736033"><code>+website-publish-directory</code></h4>
<div class="outline-text-4" id="text-org6736033">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+website-publish-directory</span> <span class="org-string">"/srv/http"</span>
  <span class="org-doc">"Location to serve the website."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ea73e4" class="outline-4">
<h4 id="org3ea73e4"><code>org-publish-project-alist</code></h4>
<div class="outline-text-4" id="text-org3ea73e4">
<p>
The meat of this configuration.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-publish-project-alist
      `((<span class="org-string">"website-posts"</span>
         <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"posts/"</span> +website-directory)
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"posts"</span> +website-publish-directory)
         <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span> <span class="org-string">"404.org"</span>))
         <span class="org-builtin">:auto-sitemap</span> t
         <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"index.org"</span>
         <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Index"</span>
         <span class="org-builtin">:sitemap-format-entry</span> me/org-sitemap-format-entry
         <span class="org-builtin">:sitemap-style</span> list
         <span class="org-builtin">:sitemap-sort-files</span> anti-chronologically
         <span class="org-builtin">:html-link-home</span> ,+website-publish-root
         <span class="org-builtin">:html-link-up</span> ,+website-publish-root
         <span class="org-builtin">:html-head-include-scripts</span> t
         <span class="org-builtin">:html-head-include-default-style</span> nil
         <span class="org-builtin">:html-head</span> ,me/website-html-head
         <span class="org-builtin">:html-preamble</span> +website/website-html-preamble
         <span class="org-builtin">:html-postamble</span> +website/website-html-postamble)
        (<span class="org-string">"website-pages"</span>
         <span class="org-builtin">:base-directory</span> ,+website-directory
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span> <span class="org-string">"404.org"</span> <span class="org-string">"template.org"</span>))
         <span class="org-builtin">:recursive</span> nil
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:publishing-directory</span> ,+website-publish-directory
         <span class="org-builtin">:html-link-home</span> ,+website-publish-root
         <span class="org-builtin">:html-link-up</span> ,+website-publish-root
         <span class="org-builtin">:auto-sitemap</span> nil
         <span class="org-builtin">:html-head-include-scripts</span> t
         <span class="org-builtin">:html-head-include-default-style</span> nil
         <span class="org-builtin">:html-head</span> ,me/website-html-head
         <span class="org-builtin">:html-preamble</span> +website/website-html-preamble
         <span class="org-builtin">:html-postamble</span> +website/website-html-postamble)
        (<span class="org-string">"website-css"</span>
         <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"css/"</span> +website-directory)
         <span class="org-builtin">:base-extension</span> <span class="org-string">"css"</span>
         <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"css/"</span> +website-publish-directory)
         <span class="org-builtin">:publishing-function</span> org-publish-attachment
         <span class="org-builtin">:recursive</span> t)
        (<span class="org-string">"website-images"</span>
         <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"images/"</span> +website-directory)
         <span class="org-builtin">:base-extension</span> ,site-attachments
         <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"images/"</span> +website-publish-directory)
         <span class="org-builtin">:publishing-function</span> org-publish-attachment
         <span class="org-builtin">:recursive</span> t)
        (<span class="org-string">"website-assets"</span>
         <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"assets/"</span> +website-directory)
         <span class="org-builtin">:base-extension</span> ,site-attachments
         <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"assets/"</span> +website-publish-directory)
         <span class="org-builtin">:publishing-function</span> org-publish-attachment
         <span class="org-builtin">:recursive</span> t)
        (<span class="org-string">"website-rss"</span>
         <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"posts/"</span> +website-directory)
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:html-link-home</span> ,+website-url
         <span class="org-builtin">:rss-link-home</span> ,+website-url
         <span class="org-builtin">:html-link-use-abs-url</span> t
         <span class="org-builtin">:rss-extension</span> <span class="org-string">"xml"</span>
         <span class="org-builtin">:publishing-directory</span> ,+website-publish-directory
         <span class="org-builtin">:publishing-function</span> (org-rss-publish-to-rss)
         <span class="org-builtin">:section-number</span> nil
         <span class="org-builtin">:exclude</span> <span class="org-string">".*"</span>
         <span class="org-builtin">:include</span> (<span class="org-string">"index.org"</span>)
         <span class="org-builtin">:table-of-contents</span> nil)
        (<span class="org-string">"website"</span> <span class="org-builtin">:components</span> (<span class="org-string">"website-posts"</span>
                                <span class="org-string">"website-pages"</span>
                                <span class="org-string">"website-css"</span>
                                <span class="org-string">"website-images"</span>
                                <span class="org-string">"website-assets"</span>
                                <span class="org-string">"website-rss"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e08500" class="outline-4">
<h4 id="org1e08500">the footer</h4>
<div class="outline-text-4" id="text-org1e08500">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">websites</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">websites.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org57d60a4" class="outline-3">
<h3 id="org57d60a4">blog</h3>
<div class="outline-text-3" id="text-org57d60a4">
<pre class="example">
header-args: :tangle (expand-file-name "site-lisp/blog.el" user-emacs-directory)
</pre>
<p>
Configuration for org-generated blog.
</p>
</div>
<div id="outline-container-orgd0e0999" class="outline-4">
<h4 id="orgd0e0999">commented header</h4>
<div class="outline-text-4" id="text-orgd0e0999">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">blog.el --- org-publish configurations</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">I will try to avoid any hardcoded variables here.</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
</pre>
</div>
</div>
</div>
