posts/Emacs-Configuration.org
*** =+website-publish-directory=
    #+begin_src emacs-lisp
      (defvar +blog-publish-directory "~/public_html"
        "Location to serve the website.")
    #+end_src
*** =org-publish-project-alist=
    The meat of this configuration.
    #+begin_src emacs-lisp
      (setq org-publish-project-alist
            (append org-publish-project-alist
                    `(("blog-posts"
                       :base-directory ,(expand-file-name "posts/" +blog-directory)
                       :base-extension "org"
                       :recursive t
                       :publishing-function org-html-publish-to-html
                       :publishing-directory ,(expand-file-name "posts" +blog-publish-directory)
                       :exclude ,(regexp-opt '("README.org" "draft" "404.org"))
                       :auto-sitemap t
                       :sitemap-filename "index.org"
                       :sitemap-title "Index"
                       :sitemap-format-entry me/org-sitemap-format-entry
                       :sitemap-style list
                       :sitemap-sort-files anti-chronologically
                       :html-link-home ,+blog-publish-root
                       :html-link-up ,+blog-publish-root
                       :html-head-include-scripts t
                       :html-head-include-default-style nil
                       :html-head ,me/website-html-head
                       :html-preamble +blog/website-html-preamble
                       :html-postamble +blog/website-html-postamble
                       :with-drawers t)
                      ("blog-pages"
                       :base-directory ,+blog-directory
                       :base-extension "org"
                       :exclude ,(regexp-opt '("README.org" "draft" "404.org" "template.org"))
                       :recursive nil
                       :publishing-function org-html-publish-to-html
                       :publishing-directory ,+blog-publish-directory
                       :html-link-home ,+blog-publish-root
                       :html-link-up ,+blog-publish-root
                       :auto-sitemap nil
                       :html-head-include-scripts t
                       :html-head-include-default-style nil
                       :html-head ,me/website-html-head
                       :html-preamble +blog/website-html-preamble
                       :html-postamble +blog/website-html-postamble
                       :with-drawers t)
                      ("blog-css"
                       :base-directory ,(expand-file-name "css/" +blog-directory)
                       :base-extension "css"
                       :publishing-directory ,(expand-file-name "css/" +blog-publish-directory)
                       :publishing-function org-publish-attachment
                       :recursive t)
                      ("blog-images"
                       :base-directory ,(expand-file-name "images/" +blog-directory)
                       :base-extension ,site-attachments
                       :publishing-directory ,(expand-file-name "images/" +blog-publish-directory)
                       :publishing-function org-publish-attachment
                       :recursive t)
                      ("blog-assets"
                       :base-directory ,(expand-file-name "assets/" +blog-directory)
                       :base-extension ,site-attachments
                       :publishing-directory ,(expand-file-name "assets/" +blog-publish-directory)
                       :publishing-function org-publish-attachment
                       :recursive t)
                      ("blog-rss"
                       :base-directory ,(expand-file-name "posts/" +blog-directory)
                       :base-extension "org"
                       :html-link-home ,+blog-url
                       :rss-link-home ,+blog-url
                       :html-link-use-abs-url t
                       :rss-extension "xml"
                       :publishing-directory ,+blog-publish-directory
                       :publishing-function (org-rss-publish-to-rss)
                       :section-number nil
                       :exclude ".*"
                       :include ("index.org")
                       :table-of-contents nil)
                      ("blog" :components ("blog-posts"
                                           "blog-pages"
                                           "blog-css"
                                           "blog-images"
                                           "blog-assets"
                                           "blog-rss")))))
    #+end_src
*** the footer
    #+begin_src emacs-lisp
       (provide 'blog)
       ;;; blog.el ends here
     #+end_src
** Roam Publish
   :PROPERTIES:
   :header-args: :tangle ~/.config/emacs/site-lisp/roam-publish.el :mkdirp t
   :END:
*** commented header
    #+begin_src emacs-lisp
      ;;; roam-publish.el --- org-publish configurations
      ;;
      ;;; Commentary:
      ;; This file is auto-generated from `config.org'
      ;; See `https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html'
      ;; I will try to avoid any hardcoded variables here.
      ;;; Code:
      (require 'blog)
    #+end_src
