posts/Emacs-Configuration.html
<div id="outline-container-org53464df" class="outline-4">
<h4 id="org53464df"><code>+website-publish-directory</code></h4>
<div class="outline-text-4" id="text-org53464df">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">+blog-publish-directory</span> <span class="org-string">"~/public_html"</span>
  <span class="org-doc">"Location to serve the website."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org67ca4ee" class="outline-4">
<h4 id="org67ca4ee"><code>org-publish-project-alist</code></h4>
<div class="outline-text-4" id="text-org67ca4ee">
<p>
The meat of this configuration.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-publish-project-alist
      (append org-publish-project-alist
              `((<span class="org-string">"blog-posts"</span>
                 <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"posts/"</span> +blog-directory)
                 <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
                 <span class="org-builtin">:recursive</span> t
                 <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
                 <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"posts"</span> +blog-publish-directory)
                 <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span> <span class="org-string">"404.org"</span>))
                 <span class="org-builtin">:auto-sitemap</span> t
                 <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"index.org"</span>
                 <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Index"</span>
                 <span class="org-builtin">:sitemap-format-entry</span> me/org-sitemap-format-entry
                 <span class="org-builtin">:sitemap-style</span> list
                 <span class="org-builtin">:sitemap-sort-files</span> anti-chronologically
                 <span class="org-builtin">:html-link-home</span> ,+blog-publish-root
                 <span class="org-builtin">:html-link-up</span> ,+blog-publish-root
                 <span class="org-builtin">:html-head-include-scripts</span> t
                 <span class="org-builtin">:html-head-include-default-style</span> nil
                 <span class="org-builtin">:html-head</span> ,me/website-html-head
                 <span class="org-builtin">:html-preamble</span> +blog/website-html-preamble
                 <span class="org-builtin">:html-postamble</span> +blog/website-html-postamble
                 <span class="org-builtin">:with-drawers</span> t)
                (<span class="org-string">"blog-pages"</span>
                 <span class="org-builtin">:base-directory</span> ,+blog-directory
                 <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
                 <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span> <span class="org-string">"404.org"</span> <span class="org-string">"template.org"</span>))
                 <span class="org-builtin">:recursive</span> nil
                 <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
                 <span class="org-builtin">:publishing-directory</span> ,+blog-publish-directory
                 <span class="org-builtin">:html-link-home</span> ,+blog-publish-root
                 <span class="org-builtin">:html-link-up</span> ,+blog-publish-root
                 <span class="org-builtin">:auto-sitemap</span> nil
                 <span class="org-builtin">:html-head-include-scripts</span> t
                 <span class="org-builtin">:html-head-include-default-style</span> nil
                 <span class="org-builtin">:html-head</span> ,me/website-html-head
                 <span class="org-builtin">:html-preamble</span> +blog/website-html-preamble
                 <span class="org-builtin">:html-postamble</span> +blog/website-html-postamble
                 <span class="org-builtin">:with-drawers</span> t)
                (<span class="org-string">"blog-css"</span>
                 <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"css/"</span> +blog-directory)
                 <span class="org-builtin">:base-extension</span> <span class="org-string">"css"</span>
                 <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"css/"</span> +blog-publish-directory)
                 <span class="org-builtin">:publishing-function</span> org-publish-attachment
                 <span class="org-builtin">:recursive</span> t)
                (<span class="org-string">"blog-images"</span>
                 <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"images/"</span> +blog-directory)
                 <span class="org-builtin">:base-extension</span> ,site-attachments
                 <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"images/"</span> +blog-publish-directory)
                 <span class="org-builtin">:publishing-function</span> org-publish-attachment
                 <span class="org-builtin">:recursive</span> t)
                (<span class="org-string">"blog-assets"</span>
                 <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"assets/"</span> +blog-directory)
                 <span class="org-builtin">:base-extension</span> ,site-attachments
                 <span class="org-builtin">:publishing-directory</span> ,(expand-file-name <span class="org-string">"assets/"</span> +blog-publish-directory)
                 <span class="org-builtin">:publishing-function</span> org-publish-attachment
                 <span class="org-builtin">:recursive</span> t)
                (<span class="org-string">"blog-rss"</span>
                 <span class="org-builtin">:base-directory</span> ,(expand-file-name <span class="org-string">"posts/"</span> +blog-directory)
                 <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
                 <span class="org-builtin">:html-link-home</span> ,+blog-url
                 <span class="org-builtin">:rss-link-home</span> ,+blog-url
                 <span class="org-builtin">:html-link-use-abs-url</span> t
                 <span class="org-builtin">:rss-extension</span> <span class="org-string">"xml"</span>
                 <span class="org-builtin">:publishing-directory</span> ,+blog-publish-directory
                 <span class="org-builtin">:publishing-function</span> (org-rss-publish-to-rss)
                 <span class="org-builtin">:section-number</span> nil
                 <span class="org-builtin">:exclude</span> <span class="org-string">".*"</span>
                 <span class="org-builtin">:include</span> (<span class="org-string">"index.org"</span>)
                 <span class="org-builtin">:table-of-contents</span> nil)
                (<span class="org-string">"blog"</span> <span class="org-builtin">:components</span> (<span class="org-string">"blog-posts"</span>
                                     <span class="org-string">"blog-pages"</span>
                                     <span class="org-string">"blog-css"</span>
                                     <span class="org-string">"blog-images"</span>
                                     <span class="org-string">"blog-assets"</span>
                                     <span class="org-string">"blog-rss"</span>)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f72d79" class="outline-4">
<h4 id="org1f72d79">the footer</h4>
<div class="outline-text-4" id="text-org1f72d79">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">blog</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">blog.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6025718" class="outline-3">
<h3 id="org6025718">Roam Publish</h3>
<div class="outline-text-3" id="text-org6025718">
<pre class="example">
header-args: :tangle (expand-file-name "site-lisp/roam-publish.el" user-emacs-directory)
</pre>
</div>
<div id="outline-container-org0d42e34" class="outline-4">
<h4 id="org0d42e34">commented header</h4>
<div class="outline-text-4" id="text-org0d42e34">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">roam-publish.el --- org-publish configurations</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is auto-generated from `</span><span class="org-comment"><span class="org-constant">config.org</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See `</span><span class="org-comment"><span class="org-constant">https://java281.dynv6.net/~alexforsale/posts/Emacs-Configuration.html</span></span><span class="org-comment">'</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">I will try to avoid any hardcoded variables here.</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>
(<span class="org-keyword">require</span> '<span class="org-constant">blog</span>)
</pre>
</div>
</div>
</div>
